[
   "Provide details about the Kokan Kayna Express, including its route, schedule, and amenities.",
   "Please provide the Shyamoli bus options for tomorrow, November 9, 2025, from Hyderabad to Bhubaneswar, including departure times, duration, and fares.",
   "I want to travel to Pune from Vijayawada.",
   "I need to find a bus from Yelanhanka, Bangalore to Chandigarh.",
   "I am unable to complete the process.",
   "What is trip guarantee",
   "Please provide the driver details for my bus journey with LIYAS TOURS from Kozhikode to Kallambalam.",
   "I need assistance with booking a wheelchair for my upcoming travel plans.",
   "Is there a cancellation fee for my bus ticket from Nakkapalli to Hyderabad with 'Shree Manikanta Travels'?",
   "Please provide me with road trip options for traveling from New Delhi to Udaipur with an overnight halt in Jaipur.",
   "What discounts and coupons are available for the GT Travels bus from Bangalore to Vijayapura?",
   "I would like to know more about the return trip discount for my journey from Kalpetta to Hyderabad.",
   "What is the meaning of the SBI DC coupon on booking a bus?",
   "Show me available bus options from Mumbai to Kanyakumari.",
   "Will the driver provide the details of the toll? ",
   "I want to book GSRTC tickets from source city to Maharashtra.",
   "I need a bus from Bandra station to Pune.",
   "Since I am booking the FlixBus from Karnal to Una (Himachal Pradesh) for December 30, do we need to arrive by 12 AM on that date?",
   "Process the cancellation request for one passenger ticket from the user's booked tickets.",
   "I need to confirm the tickets from Hyderabad to Puducherry on 24 December 2025 and also check for nearby stations.",
   "I want to book a tempo for local transport.",
   "What discounts are available for my bus journey from Bangalore to Chennai?",
   "I would like to proceed with booking 8 sleeper tickets on the Pbr Mfp Express from Ahmedabad to Jagannath Puri for 25/10.",
   "The bus tracking is not working.",
   "I need an itinerary for transportation from Kolkata to Medinipur.",
   "Provide information on the source city for renting a car in Ahmedabad.",
   "Why is the premium option not showing?",
   "If I book tickets from Guwahati to Dwarka for my mother right now, will she not be confused? If not, what will happen? Our plan is to travel from Guwahati to Dwarka on 9th March 2026 and return on 20th February 2026 for 6 people.",
   "What is the cancellation policy for the Mahalaxmi Travels bus from Lucknow to Jaipur?",
   "When will I receive the driver details for the Journey with Grand Travels bus from Dhenkanal to Raipur (Chhattisgarh)?",
   "The MMTGPAY offer is not working. Can you please help me resolve this issue?",
   "What is the fare for 2 people traveling from Dwarka to Ahmedabad on the 'VandeMatram Travels' bus?",
   "Show me road travel options from Bangalore to Mysore.",
   "Proceed with the cab booking from Subhas Chandra Airport to Babu Ghat Bus Stand on 30-08-2025 at 17:00.",
   "I am looking for MSRTC bus options from Pune to Dhule.",
   "What are the bus routes from Dunlop bus stop to Bishnupur?",
   "What is the contact number for the Golden Temple Volvo Bus Service from Pathankot to Dharamshala?",
   "I want the bus route details for the journey with Shree Jalaram Viral Bus from Rajula to Anand.",
   "photos",
   "What discounts and coupons are available for my journey on 'PTC-SkyBus' from Lucknow to Indore?",
   "I want to book a bus ticket from Jayankondam to Chennai with Tranzking Travels on 2026-01-20. However, when I try to select a seat, it asks if I need a female seat. I am a male, so how can I book this seat?",
   "Is there a cancellation fee for the Himachal Tourist Bus Service from Delhi to Manali?",
   "What if the car came is not clean and in a good condition ",
   "What is the contact number for Maharani bus from Gaya to Chaibasa?",
   "What discounts and coupons are available for the KSRTC (Kerala) bus from Aluva to Vadakara?",
   "Where can I find the Trip Guarantee option for my ticket from Mumbai to Nadiad?",
   "What discounts and coupons are available for my bus journey with SVR Tours and Travels from Shirdi to Hyderabad?",
   "I want to travel in Vistadome from Mumbai to Lonavla.",
   "I want to book an APSRTC bus from Hyderabad to Chirala, departing at 6 AM on 06 February 2026.",
   "The vehicle cost is too high for the trip to Vedaranyam and Vaitheeswaran Koil on 10-01-2026.",
   "Show me bus options for traveling from Hospet to Tiruvannamalai.",
   "I would like to book a van for 7 people from Kuala Lumpur to Ipoh on 30/10/2025.",
   "What is the cancellation policy for the Journey with APSRTC Bus from Visakhapatnam to Kakinada?",
   "What details you need",
   "I want to travel to Bijapur with this.",
   "Is there a cancellation fee for the bus journey from Gopalganj to Patna?",
   "Please provide information on the cancellation policy regarding voucher amounts for bookings.",
   "Proceed with adding an extra bag for the user's booking.",
   "I want to know the cancellation charges for changing my bus departure time from 3:30 PM to 2:30 PM.",
   "What discounts and coupons are available for the Mahanayek Bus Service from Barasat to Nandakumar?",
   "I need to use the gift card to book the ticket. Can you help me with that?",
   "Is there a cancellation fee for my bus booking with Waraich Travels from Kharar to Jammu?",
   "Time duration from Kolhapur to bandra terminus ",
   "Please book a return bus from Munnar to Bangalore for August 10, 2025, and recommend hotels in Munnar for 2 nights from August 8 to August 10, 2025.",
   "I want to book 12 tickets from Chennai to Palani in a single booking.",
   "Is there a cancellation fee for the Sethi Yatra Company bus from Allahabad to Lucknow?",
   "I prefer to start my journey from Chennai to Pondicherry at night on 28th January. Please find me seater bus options with both AC and non-AC types.",
   "I want to book 2 tickets from Mumbai to Prayagraj on 24-11-2025, and availability is shown.",
   "Is there a cancellation fee for my bus booking with 'AMRG TRANSPORTS' from Chennai to Tiruchirapalli?",
   "What are the bus options for Sri Gayathri Travels from Visakhapatnam to Nellore for today, 20 December 2025?",
   "I'm not seeing the option to avail the Trip Guarantee offer. Can you help me find out if it's available?",
   "What is the cost for Free Cancellation for the bus with GUJARAT TRAVELS from Aurangabad (Maharashtra) to Ahmedabad?",
   "I would like to review the Shubham travels bus from Vijayawada to Bangalore.",
   "Why is the Trip Guarantee option not showing for my ticket from Kaptanganj to Delhi?",
   "What discounts and coupons are available for my bus journey from Gorantla (Hindupur) to Tirupati with APSRTC?",
   "Please finalize the rental options for your trip from Palwal to Matluonda on 02-10-2025 at 14:00, considering the distance of approximately 419 kilometers.",
   "Sorry, thanks for your information.",
   "I would like to know the APSRTC bus timings from Narasannapeta to Anakapalli.",
   "What happens if I don't receive a confirmed ticket for my journey on the TELANGANA SF EXP from SC to NDLS on 08-10-2025?",
   "What discounts and coupons are available for my bus journey from Aurangabad (Maharashtra) to Hyderabad with 'Ramana Tours And Travels'?",
   "I am looking for buses from Nagapattinam to Kanyakumari.",
   "I prefer a sleeper seat for my bus journey from Hyderabad to Bangalore on 19 January 2026.",
   "What is the route for the bus journey?",
   "What is the cancellation policy for the Sangitam Travels bus from Pune to Shegaon (Buldhana)?",
   "I want to book a ticket from Badarpur to Kolkata, but I don't see any trip guarantee options available.",
   "What discounts and coupons are available for the KSRTC (Kerala) bus from Kottarakara to Guruvayoor?",
   "What discounts and coupons are available for PKM Transport bus from Tirupur to Chennai?",
   "Where can I board a bus to Shimla from Chandigarh?",
   "I need to find a bus from Chennai to Karur and Salem on the 23rd for 2 travelers.",
   "It's my first booking. Do I get a discount on my first booking?",
   "What is the bus fare from Indore to Khatu Shyam for 2 travelers on February 3, 2026?",
   "What discounts and coupons are available for the SBSTC bus from Durgapur (West Bengal) to Kolkata?",
   "Process the cancellation request for a specific traveler from the user's ticket.",
   "I want a government bus from Baddi to Chandigarh.",
   "What discounts and coupons are available for Vetri Travels bus from Gobichettipalaiyam to Chennai?",
   "When is the first bus available from Parippally to Alappuzha in the morning?",
   "What discounts and coupons are available for the Megha Bus from Munnar to Ernakulam?",
   "Please assist me with rescheduling my bus journey.",
   "What is the coupon code for the bus journey from Delhi to Patiala?",
   "If I choose the option to confirm my ticket or opt for 3X refund, will I receive a refund of 230 rupees if my ticket gets confirmed?",
   "Show me MSRTC bus options from Erandol to Aurangabad.",
   "I need to find a bus from Chennai to Kochi.",
   "Is there a cancellation fee for the Zingbus Plus from Coimbatore to Chennai?",
   "If there is any chance regarding my travel from Visakhapatnam to Hyderabad on 28-09-2025, please let me know.",
   "Yes, I would like to add Kumbhalgarh to my journey for 2 days from Udaipur, starting on 11-01-2026 and returning on 12-01-2026.",
   "I need to change my name on the ticket due to an incorrect mention.",
   "Please provide options for a break journey from Hijli or Kharagpur to Delhi.",
   "What are the penalty charges for cancelling the KSRTC bus from Mananthavady to Bangalore?",
   "I need to book 3 tickets with Trip Guarantee from Kolkata to Sagauli on 24-10-2025.",
   "What is the cancellation policy for the Journey with PSS Transport Bus from Thanjavur to Tirunelveli?",
   "What is the use of the coupon MMTGPAY if I can only access customer support after booking?",
   "What are the ticket prices for the Vande Bharat Express from Guwahati to Kolkata?",
   "Will this ticket from Mumbai to Nagaur be confirmed for 19-10-2025?",
   "I pressed back multiple times on the booking page; could that be the reason I'm unable to apply for MMTGPay?",
   "Where can I provide feedback for the Alternate Trip feature?",
   "Is there a cancellation fee for the bus journey from Ahmedabad to Delhi on the 'Shrinath Solitaire'?",
   "Is the trip from Mumbai to Botad on 13-12-2025 covered under trip guarantee?",
   "Trips are confirmed and driver will be provided surely and leave on time",
   "What is the cost of renting a car for my trip to southern Italy after attending Milan Design Week on August 7, 2026?",
   "What discounts and coupons are available for the APSRTC bus from Jaggaiahpet to Hyderabad?",
   "I need assistance with my travel plans, but I haven't specified any preferences or details yet.",
   "What discounts and coupons are available for the YAS Tours & Travels bus from Hyderabad to Dindigul?",
   "I need a low-cost sleeper bus from Bangalore to Vijayawada on 23rd January 2026, departing after 8 PM.",
   "I would like to use my Travel Voucher right away to book a bus ticket on the same route as my previous booking.",
   "I want to confirm tickets for 2 female senior citizens from Jhansi to Vapi because I can't take the risk of cancellation. Is there any other way to ensure that the tickets are confirmed?",
   "I am not seeing the Trip Guarantee option while booking the tickets. Can you help me find out why it's missing?",
   "What is the process for auto updation of my booking?",
   "I want to update my travel date for the bus to 22 August 2025.",
   "I'm considering Ctu as a destination in the Capital City of Prague. Can you provide me with more information about it?",
   "What are the bus offers for APSRTC from Bangalore to Tadipatri?",
   "I want to travel from Thane to Goa by bus.",
   "What is the toll-free number for assistance in India?",
   "Please provide the best available offers for the bus from Sheopur to Bhopal on 15th September, including details on timings, duration, and fares.",
   "Please check the status of my booking with Emporia.",
   "Please confirm my ticket from Kolkata to Bengaluru for the journey on 28-09-2025.",
   "What is the cancellation policy for the Tranzindia Travels bus from Hyderabad to Mysore?",
   "I need to find an AC bus for a round trip from Chennai to Rajahmundry for me, my husband, and our 8-month-old baby.",
   "Use Sultanpur, Uttar Pradesh as the source location for bus travel options to Anand Vihar.",
   "I would like to know about activities for kids under five on the 'New Singh Bus Service' from Varanasi to Ayodhya.",
   "I need to find the best bus options for traveling from Chennai to Madurai.",
   "I need to book a ticket from Aluva to Bangalore on January 4, 2026.",
   "I want bus tickets for a female traveler from Rajpura (Punjab) to Karnal for today, 05 December 2025, using a Luxury Intercity Service bus.",
   "Is Vaya in Surat a boarding or dropping point for the GSRTC bus from Bardoli to Karjan?",
   "What discounts and coupons are available for the WBTC (CTC) BARASAT-DIGHA via Esplanade (AC-VOLVO) bus from Kolkata to Digha?",
   "I received 100 rs cash through a coupon, where did I use it on my Hanumangarh to Jaipur ticket?",
   "I want to know about promo codes for bus bookings.",
   "What is the bus pickup location in Bandikui from Dausa?",
   "What discounts and coupons are available for the IntrCity SmartBus from Sultanpur (Uttar Pradesh) to Delhi?",
   "I want to talk to an agent. You did not answer my previous question.",
   "What happens if my Trip Guarantee ticket does not get confirmed?",
   "Please provide the traveller details for Nikhil Choudhary, age 22, male, for my journey from Madhupur to Delhi.",
   "What is the cancellation policy for the Zingbus Plus from Nagpur to Hyderabad?",
   "Please provide my welcome code for Mayuri Travels.",
   "I want to know about the Fast Trip coupon for my bus journey from Gonda to Lucknow with UPSRTC.",
   "I would like to book 4 tickets from Delhi to Nashik.",
   "What is the total price for the round trip from Gundlupet to Ooty and back on 18-12-2025?",
   "I want to arrange 2 bus tickets from my location to Kota, Rajasthan on 16/10.",
   "what is my date of journey?",
   "User wants to know the status of their 2x refund.",
   "Please provide a copy of the user's ticket for their completed journey.",
   "Which booking is the code TKMSALE available for? I want to use it for my APSRTC bus from Tadipatri to Bangalore.",
   "Is there a bus available tomorrow from Berhampur (Orissa) to Bangalore with Shyamoli Paribahan Pvt Ltd?",
   "Only pickup or else drop also available?",
   "What is the contact number for Kaveri Travels bus from Chennai to Hyderabad?",
   "I want to find bus options from Bangalore to Hyderabad for my trip from December 12th to December 16th, 2025.",
   "When is the pickup time for the KSRTC bus from Kottayam to Mysore?",
   "I am unable to make my booking.",
   "What is the cancellation policy for the journey with Zingbus from Goa to Hyderabad?",
   "Please confirm my trip from Muzaffarpur to Mumbai on 04-12-2025.",
   "I want a fully conform ticket from Bengaluru to Kolkata.",
   "Particular",
   "I need assistance regarding the GSRTC bus from Junagadh(Gujarat) to Idar.",
   "I need to book a tempo traveler for eight persons from Mysore junction to Madikeri.",
   "I haven't received my ticket yet. Can you help me check the status of my ticket?",
   "Is there a possibility of getting a 100% refund for the Sri Sugam Bus Tours and Travels from Kannur to Chennai?",
   "Please help me with my bookings.",
   "Please send me the boarding location for the bus from Ballari to Bangalore.",
   "What is the cost for Free Cancellation for the Express Line bus from Bangalore to Pune?",
   "Where can I find the Seat Lock feature on MakeMyTrip?",
   "Instead of people i just have some extra luggage and only one person is travelling with driver",
   "Which classes allow partial payment for my journey from Pune to Bhusawal?",
   "Is Trip Guarantee available for my journey from Bengaluru to Thrissur?",
   "I want to book a car for a round trip in Ayodhya, visiting Bala Rama temples and all important temples.",
   "What is Mmt customer support no?",
   "Which option is more likely to get confirmed: 2 AC tickets with RLWL 9 or Sleeper Class tickets with RLWL 31?",
   "Please find me bus options from Bangalore to Delhi.",
   "Please find bus options from Devgadh Baria to Lonavala.",
   "I last spoke to a customer care executive before booking.",
   "I am looking for UPSRTC bus routes from nearby cities to Delhi for today.",
   "I want to book a bus from Bangalore to Chennai on the night of 17th October 2025.",
   "I want to book a bus ticket from Madurai to Chennai using the SETC booking option.",
   "Mein apna ticket kyon book kar nahi PA raha Hoon?",
   "Is there a cancellation fee for the IntrCity SmartBus from Indore to Mumbai?",
   "Please recommend some reliable bus services from Madurai to Hyderabad, focusing on those with better customer reviews than Orange Travels.",
   "What time does the bus leave from Borivali to Dapoli? I need to know the departure time.",
   "I want to make a booking right now, but I don't have the money yet.",
   "What is the cancellation policy for the Journey with GSRTC Bus from Ahmedabad to Mehsana?",
   "It&#39;s too late, bcs I have shared with my employer for arranging my stay and further process",
   "My payment is confirmed.",
   "I need a bus from Chennai to Bangalore tomorrow (2025-11-13).",
   "What discounts and coupons are available for the SBSTC-KARUNAMOYEE bus from Kolkata to Durgapur?",
   "Is there a cancellation fee for my bus booking with Vivek Travels from Vadodara to Dhoraji?",
   "Which seats on the Bharat Benz A/C Seater/Sleeper bus from Delhi to Jaipur are designated as ladies-only?",
   "Yes, I would like to know more about how the Alternate Trip feature works for my journey on the SVDK JAM EXP from Jalandhar to Rajkot on 7th December 2025.",
   "I need a bus from Ahmedabad to Patan.",
   "Is there any discount available for booking tickets on the 15th or 16th?",
   "Since there are no train services available from Barabanki Junction to Jammu on 29th January 2026, please explore bus options to Jammu.",
   "Yes, I would like to know how to apply the available coupons during my bus booking from Chennai to Thanjavur.",
   "If you want, I can send the email.",
   "Yes, I need assistance with the meaning of the confirm option.",
   "I would like to know more about the cancellation policy for my booking from Bangalore to Varkala.",
   "I need to find a bus from Kochi to Bangalore on 8th October 2025.",
   "Is there a cancellation fee for the A1 Travels bus from Coimbatore to Bangalore?",
   "I need a private car for 2 people from Dwarka to Agra for the Taj Mahal visit.",
   "I want to book a hip-hop bus for a Mumbai darshan tour starting from Dadar to visit the Gateway of India.",
   "Want talk to an executive",
   "I'm trying to apply the code GPAYMMT10, but I'm getting an error. Can you help me resolve this issue?",
   "Luggage carrier ",
   "Kbs and zingbus",
   "I am looking for buses from Vasur to Kerala.",
   "I would like to know more about the ticket availability for my journey on Udyan Express from Kurduvadi to Bengaluru on 27-10-2025. I don't want to see alternate trip plans.",
   "The coupon code 'lightning' was not applied. Can you please help me resolve this issue?",
   "What discounts and coupons are available for the bus service Vijay Tour and Travels from Lucknow to Dehradun?",
   "Show me all available sleeper bus options from Jaunpur to Kanpur DAV College on 24 January.",
   "I want to buy a self-driving car plan.",
   "Yes, I would like to explore indirect journey options from Rampurhat to Hyderabad after March 20.",
   "Please check the status of your ticket download and provide assistance on why it may not be downloading.",
   "In this booking the can booking was included right",
   "Which is the best bus service from Ulundurpettai?",
   "Proceed to book a SECTC bus from Velankanni to Chengalpattu.",
   "I might need space for several bags in the CNG Dzire for my journey from Lucknow to Ayodhya on 09 Feb 2026 at 10:00.",
   "I need to rent a car from Mangalore to Gokarna from December 25th to 28th, 2025.",
   "What discounts and coupons are available for my GSRTC bus journey from Dhari to Bagdana?",
   "Please share the contact number for the Pooja Travels office in Nagpur.",
   "I am looking for information about 'Karthiga Travels' for my journey from Pondicherry to Coimbatore.",
   "Please check the status of the review page and resolve the issue of it being stuck.",
   "I chose the trip guarantee option.",
   "I need to arrange a car for a round trip from Jodhpur to Jaisalmer.",
   "What is the discount associated with the coupon code TKMSALE for my journey from Hyderabad to Tiruchirappalli?",
   "Provide detailed information about the Flix bus option for traveling from Manali to Delhi, including schedule, duration, and pricing.",
   "Please provide the bus tracking information for the current bus route.",
   "I don't have any kind of pin code, what can I do?",
   "Is there a washroom available on the Shri Amar Shakti Travels bus from Kanpur to Ringas?",
   "I want to know how to avail the 'visit now, pay later' offer for my upcoming travel plans.",
   "Provide detailed bus schedule and operators for the direct bus from Bangalore to Hampi.",
   "I have a male passenger traveling with me.",
   "What is the cancellation policy for the Sri Durgamba Travels bus from Bangalore to Mantralaya?",
   "Show me bus options from Mumbai to Pune sorted by price.",
   "I would like to know more about the bus amenities and travel policies for Sagar Bus Transport from Ludhiana to Malout.",
   "Show me some AC buses from Baddi to Faridabad after 5 PM today.",
   "What discounts and coupons are available for the APSRTC bus from Kakinada to Vijayanagaram?",
   "What is the cancellation policy for the Cherry tours&travels bus from Tanguturu to Hyderabad?",
   "Within the city",
   "I need to find the best bus options for traveling from Jaipur to Gwalior.",
   "I am looking for Intrcity buses from Kolhapur.",
   "Will this bus take us to Srinagar or Jammu?",
   "Show me private bus options from Delhi to Chandigarh that depart after 10 PM.",
   "Please provide detailed information on the 15017 LTT Gap Express, including its schedule, route, and any other relevant details.",
   "What is the distance from Khammam to Bonakal?",
   "I have a Trip Guarantee of 490 Rs.",
   "I need to arrange a vehicle for a round trip from Kochi to explore Kochi, Munnar, Alleppey, and Varkala starting on 4th December at 6 pm.",
   "What arrangements are made for the driver during our night stay in Karauli, and who is responsible for covering the driver's expenses?",
   "Where are the next stops for my bus for toilet breaks?",
   "What are the penalty charges for cancelling a ticket with PAL Travel Lines?",
   "What is the cancellation policy for the BABA LOKNATH bus from Tezpur to Guwahati?",
   "I want to book my tickets from Mughal Sarai to Ahmadnagar, but I am sorry that the promocode cannot be used at the moment.",
   "I would like to proceed with booking a bus seat for my journey from Ujjain to Shirdi.",
   "I want to speak with an executive because my Mmtgpay code is not working.",
   "User wants the best pickup location to set in Uber to reach Z Express Coulter in Bangalore.",
   "What is the cancellation policy for the India Tours & Travels (GetBookCab) bus from Kathgodam to Delhi?",
   "Show me the offer for the APSRTC bus from Bangalore to Tirupati.",
   "I have forgotten my user ID password.",
   "Show me bus options to Nashik.",
   "I need a driver with a car for my Kodaikanal trip from Bangalore, starting at 3 AM on 22nd November and ending at midnight on 24th November.",
   "Please retrieve the booking and refund status using my mobile number and email ID.",
   "My wallet.",
   "What time will I reach Aurangabad with 'Musafir Travels Akanksha' from Hyderabad?",
   "Is the Arnavi Travel bus from Pune to Nanded on time?",
   "I am missing my password and username for my account.",
   "Show me the cheapest AC sleeper bus from Nellore to Gachibowli.",
   "Track the bus from Pune to Bangalore.",
   "Please provide the live tracking information for the Kusum Travels non-AC bus from Kochi to Agra.",
   "Where is the seat upgradation option available during the booking process for my journey from Samastipur to Ambala on 07-01-2026?",
   "I want to confirm my journey with the following details: pickup location Kodai Road, drop location Kodaikanal, new stop addition Madurai, departure date 15-01-2026, and trip end date 17-01-2026. I will be spending time in Kodaikanal until the morning of 17-01-2026, and then traveling from Kodaikanal to Madurai on the same day.",
   "Process the request to cancel a partial ticket.",
   "Show me the cheapest seats on the Jain travels bus from Delhi to Jaipur.",
   "What discounts and coupons are available for my bus journey from Bangalore to Hyderabad with 'National travels'?",
   "I am looking for FlixBus options from Secunderabad to Visakhapatnam.",
   "Why are the tickets not being shown?",
   "What does the primo tag mean for buses?",
   "Is this my first ticket booking from Jaipur to Jodhpur?",
   "If it says trip guarantee, will the ticket be confirmed?",
   "Show me the available bus services from Visakhapatnam to Patna for today, February 4th, with Sleeper Class seating and Ladies quota.",
   "What offers are available for new account holders and first-time bus bookings?",
   "Track my onward bus.",
   "Is the Metroline bus service from Angamaly to Bangalore reliable, safe, and on time?",
   "The promo code is not applicable for the bus Shree Khurana Shabrij Travels from Pune to Hingoli.",
   "What will be the total cost?",
   "Please provide detailed information about gift coupons available for purchase, including types, values, and any terms and conditions.",
   "I would like to know about bus options from Shegaon to Pune for Saturday, September 13, 2025.",
   "I need assistance with my refund issue. Can you help me resolve the problem with my refund?",
   "What discounts and coupons are available for the ACLS Navigator bus from Chennai to Perumanallur?",
   "Is there a bathroom available on the bus for my journey?",
   "I need to find a bus from Surat to Savarkundla.",
   "I tried calling every number in the MakeMyTrip app to connect with an operator, but I'm not getting through to anyone. I want to raise an issue and complain.",
   "I need to find bus options from my current location to Pune for today, 12 October 2025, departing at 10pm for 2 travelers.",
   "Please provide assistance with your bus trip details, including any specific information you need help with.",
   "I couldn't find user consent.",
   "What refund will I get if I opt for Free Cancellation for the Vikas Travels Jaipur bus, traveling from Khatushyamji to Delhi?",
   "I want to book 4 Vande Bharat Exp tickets from Raipur to Gondia on 21-10-2025.",
   "Where is or?",
   "Yes, I would like to know more about the terms and conditions for the Trip Guarantee refund.",
   "What is the exact boarding place in Dharmavaram for my bus to Srisailam?",
   "Show me bus options from Rajnagar, West Bengal to Kolkata.",
   "I have checked the terms and conditions of the coupon; now can you check it for me?",
   "Why are they saying one traveller is needed?",
   "I need to get a platform ticket for my travel.",
   "I need the contact number for 'Sogufta Travels'.",
   "Is there a cancellation fee for the Orange Tours and Travels bus from Pune to Hyderabad?",
   "What are the penalty charges for cancelling my booking on 'KISSAN TRAVELS PILANI'? I need to know the details based on my total seat worth ₹1349 for my trip from Amritsar to Jaipur (Rajasthan).",
   "I want to travel by bus from Mathura to Katra between 10 AM and 12 PM on 04 February 2026.",
   "Show me buses from Rajahmundry to Porumamilla.",
   "I need to arrange for one person to be dropped off in Kanchipuram on the RKK Travels bus from Bangalore to Chennai.",
   "The pay letter option is not available. Can you help me with this issue?",
   "I want to book a bus from Edappally Toll to Tirupur Avinashi for tomorrow afternoon, 2025-10-14.",
   "What is the expiry date of the travel voucher received with the Alternate Trip feature?",
   "What are the penalty charges for cancellation with Panwar Tour and Travels bus from Marhaura to Agra?",
   "Is there a cancellation fee for my bus booking with Jabbar Travels from Sangareddy to Bangalore?",
   "I want to find budget-friendly AC bus options for traveling from Nagpur to Varanasi.",
   "What are the bus timings from Adilabad to Chandrapur? I'm specifically looking for TSRTC buses.",
   "Request an update on the refund status for Rs.950 that has not been credited yet.",
   "Proceed to book the journey on the APD TRANZ Bus from Ernakulam to Bangalore on August 17, 2025.",
   "The billing is correct for the bus journey from Sivasagar to Guwahati on 2026-01-18. Is the Volvo bus the best option for this route?",
   "Please provide the contact number for 'MB Link Travels' so I can get extra details about the bus journey from Ichalkaranji to Pune.",
   "I would like to know more about the amenities available in First AC class for my journey from Delhi to Ujjain on 12 February 2026.",
   "Which coupon can I use for my booking from Nagpur to Hyderabad?",
   "Trip guarantee is not being accepted.",
   "If I book a diesel car for my trip from Chennai to Bangalore on 18 January 2026 at 09:30, is there a guarantee that I will not get a car with CNG?",
   "What is the cancellation policy for the APSRTC bus from Hyderabad to Vellore?",
   "What is the refund amount I will receive if I choose Free Cancellation for the Varad Lines bus from Bangalore to Gokarna?",
   "Just you provide me Ticket number only",
   "I would like to know more about the eligibility criteria for the Trip Guarantee option for my Pune to Bengaluru trip.",
   "I want to travel on 18th September 2025 from Hisar to Gorakhpur.",
   "I will book the Silligudi bus from Krishnagar and would like to know if there are any available discount promo codes for this booking.",
   "I want to book a bus from Pune to Aurangabad on 28th October 2025.",
   "Will I be able to confirm a ticket from Baharagora to Puri?",
   "I need assistance with booking a bus for my travel plans. Please help me with the options available.",
   "What is the refund amount if I choose Free Cancellation for the DLT BUS from Bangalore to Coonoor?",
   "Please arrange an e-rickshaw ride in Mathura for local transportation.",
   "Please find available buses from Hyderabad to Ravulapalem, Andhra Pradesh.",
   "Please confirm the ticket from Ghaziabad to Mau.",
   "What about price increases if i try to book it on dec 18th?",
   "What discounts and coupons are available for the APSRTC bus from Samarlakota to Bhadrachalam?",
   "Pqwl mein seat confirm ho sakta hai kya? Main Rampur se Shahapur ja raha hoon.",
   "Please provide details on the best car options available for rent.",
   "What is the cancellation policy for the APSRTC bus from Srisailam to Tenali?",
   "I need to book a Swift Dzire for local transportation in Rajkot from December 10th to 13th, 2025, starting at 3:30 PM on December 10th, covering 40.0 kms.",
   "I want to book a bus from Bangalore to Railway Koduru for the night of 29th September 2025.",
   "What is the Free Cancellation add-on for my bus trip from Ankola to Bangalore? I want to know how it works and what the cancellation charges are if I decide to cancel.",
   "I want to know about the important places to visit in Jaffna.",
   "What are the charges",
   "Kal mein ticket katne ke liye counter kitna baje khulati hai?",
   "I will keep till 11.45pm. Please give the rate accordingly ",
   "I would like to proceed with booking the seat on the DARJEELING MAIL from SDAH to NJP by paying 25% of the fare now for my journey on 27-01-2026.",
   "I want to book a Mumbai darshan bus from Pune for today.",
   "I'm looking for bus trip options from Agra to Keladevi.",
   "I want to know the total trip price for two people traveling from Mumbai to Amritsar.",
   "Show me bus options from Katra, Jammu and Kashmir to Srinagar, Jammu and Kashmir.",
   "What does it mean when both GNWL12 and WL8 are mentioned together while booking a ticket from Kolkata to Bengaluru?",
   "I need to find an AC bus for sightseeing in Delhi, starting from Delhi.",
   "What discounts and coupons are available for the Online go bus from Pune to Shirdi?",
   "What discounts and coupons are available for my bus journey from Kozhikode to Muvattupuzha on 'SONIA LUXURY LINES'?",
   "I want to book a ticket from Mangluru Jn to Kozhikode for Vanthe Barath.",
   "I am not seeing the option for 25% seat lock for my journey from Hyderabad to Sojat.",
   "Update my surname",
   "Show me travel options from Hissar to Ambala, Haryana.",
   "I need to find a car with a driver for a day from Chandivali Junction to Shri Mumbadevi and Siddhivinayak Temple on 23 August 2025.",
   "What discounts and coupons are available for my bus journey from Gaddanakeri cross to Bangalore with 'SMS TRAVELS'?",
   "I want to know about the cancellation policy for the TGSRTC bus from Palavancha to Mancherial.",
   "Why is the fare for the bus from Udaipur to Kuchaman by Choudhary King Travels 3150, while the fare from Ahmedabad to Kuchaman is also 3150? Can you provide a detailed comparison of the two fares?",
   "I need to find bus services from Indira Gandhi International Airport to Ludhiana.",
   "Please recommend the best, cheapest, and most suitable bus options for 2 male friends traveling from Delhi to Jodhpur.",
   "Is a 9-month-old baby allowed to travel in a sleeper bus with parents?",
   "Show me bus options for traveling from Delhi to Rishikesh.",
   "Will I receive the ticket after the refund if my wait-listed ticket remains unconfirmed?",
   "Why am I unable to book a ticket for the Kamakshi Tours And Travels bus from Vijayawada to Tirupati?",
   "I want to book a ticket from Mumbai to New Delhi.",
   "My Aadhar card verification is pending.",
   "What is Free Cancellation for the YAS Tours & Travels bus from Bangalore to Kurnool?",
   "I want to know about the cancellation policy for the 'KBS Sree Garuda' bus from Tiruvannamalai to Bangalore.",
   "Is there a cancellation fee for the Pandit Sharma Travels bus from Basti to Surat?",
   "One seat is reserved for a female, right? Can she carry a 3-year-old child with her on the bus from Hyderabad to Tirupati with Ramana Tours And Travels?",
   "What discounts and coupons are available for the Arya Paribahan bus from Kolkata to Digha?",
   "I have 3 large bag and 1 medium suitcase",
   "Please find bus options from Jamshedpur to Haldia for today after 11 PM.",
   "Will I receive confirmation for the ticket?",
   "This is confirmed.",
   "Recommend the best connecting bus services for overnight travel from Indore to Kochi for January 23rd to 25th, ensuring the options include GPS tracking and toilet facilities on board.",
   "What is the cancellation policy for the KSRTC (Kerala) bus from Kalpetta to Kozhikode?",
   "i want to change my gst number in this vieana booking",
   "What is the policy if my bus with Jabbar Travels from Bangalore to Hyderabad is cancelled by the operator?",
   "I found several bus options for traveling from Delhi to Patna on October 17 and 18. Can you provide me with the available bus services for this route?",
   "I'm using this app for booking a bus for the first time from Lucknow to Nawpedwa Road, Uttar Pradesh. Please provide me with the bus details for this route.",
   "I want to travel tomorrow from Jaipur to Delhi Junction.",
   "I am looking for buses with a washroom.",
   "Why is the welcome MMT code not working for my booking from Tiruchirappalli to Bangalore?",
   "If my bus is canceled, will I receive a refund?",
   "Will my ticket booked for October 14th be confirmed?",
   "Please provide the boarding point options for buses from Dadar to Pune.",
   "I would like to know more about the booking process for the Alternate Trip offer from Singarayakonda to Hyderabad.",
   "The trip guarantee coupon code is not working.",
   "I want to update email ID",
   "Thank you! I would like to explore the bus options available on your platform. Please provide me with details about various routes and services.",
   "I want to pay cash for my bus ticket from Delhi to Bangalore with 'Ravina Travels (Regd)'.",
   "Is there a cancellation fee for the Mahendra Travels bus from Varanasi to Ambikapur?",
   "I need to find a bus from Sohabatiya Bagh, Prayagraj to Anand Bhawan, Prayagraj.",
   "Is this going to be exclusive booking for us or other shared passengers will be included?",
   "I am unable to apply my gift card for bus booking. Why is this happening?",
   "What is the cancellation policy for the Journey with Shri Sairam Travels (N.T.) bus from Mumbai to Deulgaon Mahi (Buldhana)?",
   "What discounts and coupons are available for the Vraj Travels bus from Surat to Rajkot (Gujarat)?",
   "Provide information on the types of buses available for travel from Jaipur to Thiruvananthapuram, including sleeper, semi-sleeper, and seater options, and explain the differences between them.",
   "Please add the same coach preference for my journey from Thrissur to Goa.",
   "I want to book a sleeper bus from Sonipat to Ujjain on 13-11-2025 for 4 persons, ensuring guaranteed sleeper seats.",
   "What is the trip guarantee?",
   "I want to book a bus from Kolhapur to Hyderabad for 11/12/2025 for 2 travelers.",
   "Is there a cancellation fee for Sharma travels bus from Bikaner to Udaipur?",
   "I need to hire a private Urbania bus for 16 members traveling from Indore to Omkaleshwar.",
   "I selected Itarsi as my boarding station, but it shows Danapur on the ticket. Please help me resolve this issue.",
   "I would like to know about trip guarantee options for my existing booking.",
   "What is trip guarantee or 3× refund?",
   "Please check the status of the invoice that the user did not receive.",
   "What is the departure time for Karmabhoomi Express from Raipur to NJP?",
   "I am looking for morning bus timings from Mangaluru to Mysore.",
   "I need to book a bus from Shankarpur to Katraj, Pune on 21 November 2025.",
   "What discounts and coupons are available for the Royal Roadlinks bus from Karur to Chennai?",
   "What is the TKMSALE discount or coupon available for my bus journey from Surendranagar (Gujarat) to Ahmedabad?",
   "What discounts and coupons are available for Vijayant Travels for travel from Rehli to Nagpur?",
   "Please share the current details for bus bookings.",
   "Is there a cancellation fee for the Jain Travels bus from Udaipur to Jodhpur?",
   "Set my payment preference to 'later' for future bookings.",
   "Please assist me with processing a refund for my ground transport booking that was canceled because I accidentally selected the wrong date. The booking was for 20 February 2026.",
   "I want to find bus transportation options from Vijayawada to the steel plant in Visakhapatnam.",
   "I am staying one night in Triambakeshwar from February 5th to February 6th, one night in Grishneshwar from February 6th to February 7th, and one night in Saputara from February 7th to February 8th for the trip.",
   "Noo , i m sad",
   "What is RLWL 5?",
   "Why is the Coromandel Express not showing as an option from Kakinada to Vijaywada, but it is available from Bhimavaram on MakeMyTrip?",
   "Search for bus tickets from Delhi to Jaipur with Rajasthan State Road Transport Corporation.",
   "What is the promo code for my travel from Bengaluru to Vizianagaram?",
   "What are the timings for the bus from Vellore to Maduravoyal?",
   "Is there any possibility that my ticket for the AVADH ASSAM EXP from Dibrugarh to Hanumangarh on 23 January 2026 will get confirmed?",
   "What discounts and coupons are available for Rugby Roadways bus from Ranchi to Katihar?",
   "We are a group of 30 members traveling from Sri Lanka to Chennai for 10 days (12‑12‑2025 to 22‑12‑2025) and need a bus that includes airport pickup and drop.",
   "What is the refund amount I will receive if I choose Free Cancellation for my Sanjay Travels bus from Jabalpur to Pune?",
   "Please find HRTC Volvo bus options from Solan to Delhi.",
   "I need a bus trip from Kakinada under ₹800.",
   "I need information about SETC government buses in Tamil Nadu.",
   "I need that to be credited to another payment mode",
   "Is there a cancellation fee for the FlixBus from Pune to Bangalore?",
   "Please provide the contact number for MakeMyTrip regarding refund inquiries.",
   "What discounts and coupons are available for the SBT Holidays (Sai Balaji Travels) bus from Hirekerur to Bangalore?",
   "I want to book an 8-hour rental for my in-city ride in Mumbai starting on 01st Oct (2025-10-01). Please provide the pickup time for the rental.",
   "I want to find the best bus options from Mumbai to Belgavi for my trip.",
   "Track the bus from Bangalore to Mumbai.",
   "I have not done payment but why?",
   "We have 4 people and plenty of luggage",
   "What is the cancellation policy and refund process for bookings made in Maine?",
   "I am looking for private bus options.",
   "I want to travel from Katra, Uttar Pradesh to Kashmiri Gate. Please recommend the best transportation options.",
   "What’s wrong with the current situation? I need to understand the issues.",
   "Please arrange for my pickup at 8 PM.",
   "I want to book bus tickets from Pimple to different tourist places near Pune.",
   "What is TripAssured for bus travel from Delhi to Bhopal? Can you explain the benefits and coverage it provides?",
   "I need a car for Mumbai Darshan. Please recommend suitable local car options for sightseeing in Mumbai, considering my preference for a car.",
   "What are the timings for the HOHO bus from New Delhi Railway Station?",
   "I am unable to book the bus tickets from Hyderabad to Pamidi for my trip on November 7, 2025. Please assist me in resolving this issue.",
   "If I want to book the first bus option from Pune to Tirupati via Toranagallu, what is the process?",
   "I am looking for buses from Tezpur to Guwahati.",
   "Show me transportation options from NDLS to Katra on 27 January 2026.",
   "Please share the 3 locations matching 'Kharagpur' as my destination, starting from Secunderabad and traveling by bus.",
   "I am looking for sleeper and non-AC bus options from Purnea to Patna for today, 16 November 2025.",
   "What time should I arrive at the pick-up location for the Lakshmi Travel bus from Thane to Shirdi?",
   "I want to add free cancellation for my journey with Rahi Tours And Travels from Aurangabad (Maharashtra) to Pune.",
   "I have not received my ticket yet for the journey from Bhubaneswar to Sambalpur.",
   "Is there a cancellation fee for the bus booking from Delhi to Varanasi with 'Laxmi holidays'?",
   "What are the penalty charges for cancellation of the KSRTC (Kerala) bus from Kottayam to Punalur?",
   "I have a voucher for my return ticket because my trip guarantee failed to allocate a seat, and I need to book a return ticket using this voucher.",
   "I have queries regarding trip guarantee.",
   "I'm looking for night bus options from Madurai to Bangalore on December 3, 2025.",
   "I want to confirm the option that guarantees a ticket on MakeMyTrip.",
   "Please provide the driver details for my journey with Thamarai Bus Transports from Coimbatore to Chennai.",
   "Please confirm the change to my bus booking date.",
   "I need to speak to the concerned managing person about Vijayawada Car Travels.",
   "I think the Alternate Trip is useless if my ticket is not confirmed.",
   "I would like to know about bus service options for traveling from Goa to Udupi.",
   "Please find me the best indirect train options from Bhopal to Durgapur for December 20, 2025, considering my preference for train travel and excluding buses, cabs, and indirect train connections.",
   "I need to travel from Adoni to Tirupati on 05-12-2025 and return to Adoni on 07-12-2025.",
   "What is the cancellation policy for the NueGo bus journey from Chennai to Pondicherry?",
   "I want to travel from Hyderabad to Dhanbad, Jharkhand. Please recommend transportation options for this route.",
   "I want KSRTC bus options from Alappuzha to Krishnagiri.",
   "They are hanging up",
   "I'm having issues with the chatbot and I can't provide a clear query. It keeps saying it cannot process my request. Can someone help me resolve this?",
   "Show me AC bus services from Cheoki to Ayodhya Dham.",
   "Would you like to explore other travel options or check for different dates for my trip from Dehradun to Jodhpur on October 5th, 2025?",
   "Why do I need Trip Assured if it is automatically included when I book and pay for my trip?",
   "I want to travel to Chandigarh from Mumbai. Please provide transportation recommendations for this route.",
   "What are the morning bus timings from Thoothukudi to Pattukkottai on 22nd January 2026?",
   "I want to book an Indo-Canadian bus with a heating arrangement.",
   "Please show me the two types of insurance options available for my bus journey with 'New Pal Travels' from Delhi to Amritsar, specifically the ₹18 and ₹15 options.",
   "I want to book a TNSTC bus.",
   "Please call me on 9949027555.",
   "What discounts and coupons are available for the Dolphin travel house bus from Mumbai to Hyderabad?",
   "I want to find bus options from Bangalore to Chennai.",
   "Is the Trip Guarantee feature safe, and what is the time span for the refund for my trip from Kolkata to Varanasi?",
   "I want to book bus tickets from Ahmedabad to Indore for tonight.",
   "Is there an option to add additional money to the travel voucher if the amount in the voucher is insufficient for my next trip from Nagpur to Mumbai?",
   "I am looking for information about the 'Motoria' bus.",
   "I want to know about the cancellation policy for the bus operated by 'Bedi Travels' from Delhi to Kangra.",
   "Please check the status of my ticket as it is not showing.",
   "I need to book a bus ticket from Vytilla to Coimbatore for tomorrow, 16 September 2025.",
   "Is there a cancellation fee for my bus booking with 'MR Travels' from Bangalore to Gannavaram?",
   "My questions are not being addressed properly. Can you connect me with an agent? I would prefer to discuss these details with a person to avoid confusion.",
   "Show me budget-friendly non-AC buses departing from Bengaluru to Mysore before 8 AM on January 21, 2026.",
   "What discounts and coupons are available for my bus journey from Aurangabad to Shirdi with 'Humsafar Travels'?",
   "I want to know about the trip guarantee return for my Vande Bharat trip tomorrow from Puri to Howrah.",
   "Is there a cancellation fee for the Skyliners Bus Service from Mumbai to Udaipur?",
   "I want to confirm a ticket with trip guarantee from Ahmedabad to Kalyan.",
   "I want to know about the cancellation policy for the RSRTC bus from Jaipur to Agra.",
   "What discounts are currently available for my upcoming trip?",
   "Yes, please proceed with the new search parameters that include stops at India Gate and Taj Mahal. I want to travel from Delhi to Agra with these stops.",
   "What is the cancellation policy for the Zingbus Plus from Bangalore to Nellore?",
   "Please assist me in booking a bus ticket for my trip from Kolhapur to Parbhani.",
   "Why is the Anand Travels bus from Mumbai to Mangalore not stopping at Thane?",
   "What is the schedule for the onward private bus?",
   "Please check the status of my ticket that is not showing in my trips.",
   "Price log karke rakha tha ticket ka Kal from ticket kaise karo.",
   "I cannot use my referral cash for booking a bus.",
   "Please explain what RLWL means in Marathi.",
   "I want to know about the cancellation policy of this bus from Vijayawada to Bangalore.",
   "When will I receive the driver details for the Journey with Bharathi Travels Bus from Bangalore to Tirupati?",
   "What will be the total time of the journey ?",
   "I'm looking for bus travel options from Delhi to Alipur Dwar.",
   "I need to find 2 bus seats from Bangalore to Tirupati tonight within a budget of ₹400-600.",
   "I want to travel from Patna to Lucknow by bus tomorrow, 26th October 2025.",
   "Is there a cancellation fee for the bus ticket from Gwalior to Haridwar with 'Gajraj bus service'?",
   "What discounts and coupons are available for the Om Sai Ram Travels bus from Indore to Sagar, Madhya Pradesh?",
   "Show me other travel options to Indore.",
   "I want to know more about the KSRTC bus service in Kerala.",
   "I would like to know more about the bus amenities and schedule for the GSRTC bus from Vadodara to Nathdwara.",
   "I'm experiencing an issue with verifying my Aadhar number. It says 'The number is invalid,' and after trying 2-3 times, it shows 'Limits are exhausted for today. Try tomorrow.' This happens every day. Can you help me understand why?",
   "I want to book a bus from Bengaluru to Manvi.",
   "Select Patna, Bihar as your destination for the bus from Laxmangarh.",
   "What is Free Cancellation for the ISHIKA TRADERS bus from Durgapur (West Bengal) to Digha?",
   "What are the safety precautions taken on the VEE VEE BUS for the journey from Chennai to Ooty?",
   "When will KSRTC travel options be available from Bangalore to Pune?",
   "I want to know about Trip Guarantee for my trip from Delhi to Mumbai.",
   "I would like to book 2 tickets on Udyan Express for tomorrow's journey from Pune to Bengaluru at 11:45 AM.",
   "I am looking for night bus service from Indira Gandhi Airport, New Delhi to Ludhiana.",
   "I need to speak with a live agent regarding my deleted ticket that was booked from my friend's phone.",
   "My IRTC is not working, how can I resolve this issue?",
   "I need to book the Round Trip TEMPOTRAVELLER from Gurgaon to Mussoorie on 27-12-2025.",
   "What are the timings for the Vande Bharat Express from Katra to Srinagar?",
   "What is the price for a sleeper bus from Siliguri to Dehradun on September 30, 2025?",
   "Please provide the bus timings from Delhi to Ujjain for tomorrow, including details about the available bus services and their respective departure times.",
   "I am traveling to Mumbai on December 10th. Please find me the best bus options from my location to Mumbai.",
   "I need the driver's contact number.",
   "I want to book a sleeper bus with Zingbus from Delhi to Katra.",
   "What senior citizen concessions or discounts are available for me for the APSRTC bus from Vijayawada to Hyderabad?",
   "Today, 14/12/2025, I came to the bus stop to go to Dholka, but the bus was late, so I had to take another bus. This is the worst service I have experienced.",
   "What discounts and coupons are available for KRSNA Travels bus from Dombivli to Mahabaleshwar?",
   "Is a ticket required for a 4-year-old in Vande Bharat?",
   "Why is the 3X Refund option not showing in the price breakup when I am trying to opt for it?",
   "Modal and year of car",
   "Where can I use my voucher for my trip from Mumbai to Prayagraj?",
   "What is the refund amount I will receive if I choose Free Cancellation for the Express Line bus from Kolkata to Siliguri?",
   "I want to book a bus from Chennai to Bangalore.",
   "Please find available sleeper bus options from Ponnur to S.R. Nagar, Hyderabad for 1 traveler.",
   "I want to find the best government bus options for traveling from Madurai to Kodaikanal, departing at 8 AM on September 18, 2025.",
   "I need to book a confirmed ticket from Indore to Delhi for tomorrow.",
   "Is there a cancellation fee for the Sharma Travels bus from Malakoli to Pune?",
   "I want to book a traveler bus for a whole day from Bangalore to Mysore and back to Bangalore on 20 October 2025.",
   "What discounts and coupons are available for the KGN INDIA bus from Hyderabad to Bangalore?",
   "I want to travel from Ranchi to Guwahati and arrive on 4th April 2026.",
   "I need to book a ticket from Nagpur to Hyderabad.",
   "What discounts and coupons are available for my bus journey with Lavi Travels from Ujjain to Neemuch (Madhya Pradesh)?",
   "Inquire about the status of my refund for failed payments.",
   "I want to know the available bus options from Hyderabad to Mysore on 27 September 2025.",
   "Please provide more details about the train and bus option for traveling from Coimbatore to Munnar.",
   "I want to know about trip guarantee and why it is showing me an alternate trip while booking. What does that mean?",
   "Please find alternative bus options for my round trip from Ahmedabad to Shirdi and back, considering different travel dates.",
   "What discounts and coupons are available for Maharani Travels bus from Gurugram (Gurgaon) to Jaipur?",
   "Planning to visit chandigarh to shimla \nRoam around nearby destination in shimla and kufri and return to chandigarh",
   "What are the Yamuna Saarthi bus timings?",
   "Wizardam.",
   "What happens if my ticket doesn't get confirmed under the trip guarantee scheme?",
   "I want to check the chances of getting my GNWL/33 ticket from Mumbai to Rajahmundry confirmed for 05-10-2025.",
   "What is the pickup point for my bus journey from Koilkuntla to Hyderabad?",
   "I need wheelchair assistance in Delhi.",
   "Is there a cancellation fee for the Mohan Travels bus from Hyderabad to Proddatur?",
   "Is there a cancellation fee for the NueGo bus from Delhi to Haldwani?",
   "I am looking for Volvo bus options from Ahmedabad to Vadodara.",
   "Please provide details on how to book a ship, including any specific destinations or preferences you may have.",
   "I need to find bus options from Kadubisanahalli to Tiruvannamalai.",
   "I want to travel from Ranchi to Siliguri on the 9th by bus.",
   "I want to reserve the seats in my name for 6 travelers from Vijayawada to Bengaluru on 19th October 2025, to ensure that no one else can take them.",
   "Is there a cancellation fee for the Rahul Travels bus from Pilibhit to Delhi?",
   "Please send me the coupon code for free cancellation.",
   "Show me bus options for my trip from Chennai to Ooty.",
   "I need to find a bus from Solan to Delhi for my travel plans.",
   "Show me bus options from Nagda Junction to Raipur.",
   "I would like to proceed with booking the bus with Dolphin Travel House from Yavatmal to Mumbai on 24 Nov 2025.",
   "What is the cancellation policy for the GSRTC bus from Ahmedabad to Unjha?",
   "Please call me regarding my inquiry about buses from LB Nagar to Tirupati.",
   "I want to register my buses on MakeMyTrip.",
   "Need urgent",
   "Provide details about bus options available for travel from Aligarh to Dharamshala on 2025-12-25 for 2 adults, including timings, prices, and booking information within a budget of 2000 INR.",
   "If I book a ticket for January 4th, can I pay the remaining amount on December 25th?",
   "I am looking for low-cost bus sleeper options.",
   "I need to know the pickup and drop-off locations for my vehicle rental from Thiruvananthapuram to Ooty or Bangalore, starting on December 22, 2025, at 3:00 PM for 6 days.",
   "ONWAY",
   "Yes, I would like to know how to apply the available coupons during my booking with Laxmi holidays.",
   "I want to book a bus ticket from Kilambakkam to Paramathi Velur in sleeper class at the cheapest rate.",
   "I need to find a private bus from Patna to Pokhara, Nepal and back.",
   "I will be traveling next Saturday (15 Dec 2025), with a pickup time of around 8:00 PM and a drop‑off on the same day at 11:00 PM. I would like to know if you provide self‑drive rental cars in Indore.",
   "Is free cancellation available for this bus?",
   "Will I get a full refund for my bus booking with BTR Travels from Hyderabad to Mumbai if my plans are uncertain?",
   "I need to reach Mumbai before 2 pm on 17 January 2026. Please recommend transportation options from Agra to Mumbai for that date.",
   "Please provide information on where to submit bank details for a refund.",
   "I am looking for buses from Mysuru to Ooty on 09/02/26 (2026-01-09).",
   "I am unable to add a coupon for the TGSRTC bus from Hyderabad to Korutla.",
   "I need to book 10 tickets from Solapur to Ahmedabad.",
   "I am planning to travel from Solapur to Varanasi on 14th February 2026. Can you assist me with transportation options?",
   "Please have your team contact me regarding the unexpected charges for the Gardens by the Bay transfers and the City tour on Sentosa Island.",
   "I want to travel from Mumbai to Gorakhpur from 10th February 2026 to 16th February 2026.",
   "What are the penalty charges for cancellation with Maa Chandi Travels bus from Kolkata to Digha?",
   "What discounts and coupons are available for the Laxmi holidays bus from Delhi to Jammu?",
   "When will I receive the driver details for the Journey with Shekhar Travels bus from Delhi to Ajmer?",
   "What is the addon for the FlixBus from Dharamshala (Himachal Pradesh) to Delhi?",
   "What discounts and coupons are available for the FlixBus from Hyderabad to Rajahmundry?",
   "Tell me how the bus system works for traveling from Dubai to Abu Dhabi, including details on routes, schedules, and ticket prices.",
   "What discounts and coupons are available for the T Power Tour and Travels bus from Indore to Jaipur?",
   "Please confirm tickets from Rohtak to Mansi on 20-10-2025.",
   "What formalities are left for confirming the bus booking from Indore to Pune?",
   "I have checked the terms and conditions for the coupon code GPAYMMT10.",
   "I want to book a bus ticket from Khammam to Chirala on January 13, 2026.",
   "What is the cancellation policy for the Royal Travels bus from Indore to Ujjain?",
   "I would like to change my boarding point from Sirsi to Buddhukota for the bus to Chennai on November 9, 2025.",
   "What is the cancellation policy for the Maharani Travels bus from Delhi to Khatushyamji?",
   "Show me available bus options from Mumbai to Kashmir on 18 December 2025.",
   "Please guide me through the process of submitting my Travel Delay Refund (TDR) request for my recent booking. I need assistance with the specific steps and any required information I should provide to ensure my request is processed correctly.",
   "Please provide the contact number for the bus.",
   "Yes, please share the contact number.",
   "I want to travel from Chandigarh to Ludhiana by bus at 10:00 AM on 24 January 2026.",
   "I want to book a bus from Junagadh to Rajkot.",
   "I want cancel my tickets",
   "I need to book a bus ticket from Kothagudem, Telangana to Vijayawada for 7:20 AM on 27 August 2025.",
   "Show me buses from Delhi to Pathankot",
   "Is there someone I can talk to regarding the cancellation of my bus?",
   "Is there a cancellation fee for the 'zingbus plus' bus from Delhi to Dehradun?",
   "Where does the Arora Travels Volvo bus pick up passengers in Allahabad for the Lucknow route?",
   "Show me bus options from Kurnool to Srisailam for 2 travelers.",
   "Why is the Welcome discount not applicable for my bus journey from Chennai to Devakottai?",
   "What discounts and coupons are available for the PSNA Travels bus from Dindigul to Chennai?",
   "I would like to know more about how to opt for the Alternate Trip feature for my journey from Delhi to Lucknow.",
   "Yes, I would like to book a government bus through MakeMyTrip.",
   "Provide detailed information about the bus option for travel from Guntur to Chennai (Karapakkam) on January 3, 2026, including timings, duration, and fare.",
   "I want to book a ticket from Kanpur to Nasik for 22nd October 2025.",
   "I would like to book an A/C bus with MRM Travels from Chennai to Tirunelveli on 11 September 2025.",
   "I need information about a previously guaranteed trip.",
   "What fine will be imposed for the 2:00 AM ticket?",
   "Please connect me to an agent regarding my trip from Bangalore to Chidambaram and state tax confirmation.",
   "What discounts and coupons are available for my bus journey from Davanagere to Mangaluru with 'Sri Durgamba Travels'?",
   "I am unable to book a bus using gift vouchers.",
   "I prefer the bus option for my trip from Nagpur to Bhopal. Please find me the best bus travel options available.",
   "Provide information regarding group booking options from Bhubaneswar to Chennai.",
   "I need to get a platform ticket for my upcoming journey.",
   "I want to book a car from Bahraich to Lucknow.",
   "Please connect me to an agent regarding booking a bus trip.",
   "I want to travel from Thrissur to Bengaluru next Wednesday, 11th February 2026.",
   "I am trying to book a ticket for a female passenger with Raj Ratan Tours And Travels from Mumbai to Indore, but I am unable to complete the booking.",
   "I want to know about the cancellation policy for the bus operated by 'SANA TRAVELS' from Kolkata to Puri.",
   "I would like to inquire about the status of my refund for booking ID NU710661144878994. The amount was deducted from my account, but I have not yet received the refund. Could you please check the status and provide me with an update? Thank you!",
   "I want to contact customer care to make a new group booking from Visakhapatnam to Gorakhpur.",
   "Please call",
   "My amount has been debited. Please help me resolve this issue regarding my payment from Hyderabad to Howrah.",
   "Please check the reviews for the Pramukh Travels bus from Bangalore to Hyderabad.",
   "What is the pick-up time in Berhampur for the OSRTC bus to Bhubaneswar?",
   "I want to travel from Tundla to Puri on 12th February 2026.",
   "When will the Hans Travels bus from Gorakhpur to Surat arrive?",
   "I'm looking for bus options from Malegaon to Kalyan.",
   "Why is the total bill showing 1899 when the charges are showing as 1799 for the Journey with LVP Travels Bus from Bangalore to Hyderabad?",
   "Show me 2 Sleeper Coach tickets from Nashik, Maharashtra to Vadodara for 2 passengers on February 13, 2026.",
   "I want to book an AC confirmed ticket from Bengaluru to Jasidih on 12th October 2025.",
   "What discounts and coupons are available for my bus journey from Bangalore to Kollur with 'Anand Travels'?",
   "Why is the Trip Guarantee not being applied for my journey from Mankapur to Delhi on 17-11-2025?",
   "Show me the images of a bus.",
   "Where can I find the trip guarantee option?",
   "Is there an option to book a return ticket for Krish Travels from Chennai to Coimbatore?",
   "The promo code is not working for my travel from Renigunta to Chennai. Can you help me resolve this issue?",
   "I want to book a bus from Jamnagar to Bhavnagar on 01 February 2026.",
   "What discounts and coupons are available for the Laxmi holidays bus from Manali to Delhi?",
   "I want to book a ticket from Hyderabad to Tirupathi on 15th September 2025.",
   "What does the user content mean regarding Ganesh Travels And Tours bus from Karatagi to Hubli?",
   "Number ?",
   "Please book 2 tickets for second AC from Ludhiana to Jammu on 09-11-2025 in the afternoon.",
   "What discounts and coupons are available for the KSRTC bus from Erattupetta to Angamaly?",
   "Why is the MMTGPAY coupon not applying for my booking with Tranzking Travels?",
   "Please check the status of my booking with reference number NN19T7Z411FCFZVE6557.",
   "Show me the bus from Bangalore to Chennai.",
   "Is there a cancellation fee for the BHAGWATI TRAVELS EXPRESS bus from Delhi to Ringas?",
   "I was at the final payment stage for my booking, but now it's disappeared. Can you help me with this?",
   "I want to know how to add more passengers to my ticket from Delhi to Kozhikode.",
   "I need assistance with the query number 229966724.",
   "If I opt for the Trip Guarantee, how much will I get refunded for my ticket from Bhopal to Ratlam on 17-08-2025?",
   "I want to contact the receptionist for Sanjay Travels bus service.",
   "I need to book government bus tickets for 23 people from Katpadi to Tirupati to visit the Sripuram Golden Temple.",
   "Is there a low bus fare available for my journey from Coimbatore to Bangalore in economy class with Sri Bala Tours and Travels?",
   "I understand that your site guarantees confirmation for my booking on the Doon Express (13009) for 27-12-2025 from Kolkata to Shahganj, or else I will receive three times the fare. Can you confirm this?",
   "Please proceed with booking 2 tickets of 3rd AC on the Udz Bdts Sf Exp from Udaipur to Surat.",
   "I will pay the amount for the Sri Amarnath Travels bus from Rajapalayam to Thudiyalur.",
   "Provide drop points for AC buses from Bengaluru to Mysore on 21 January 2026.",
   "What is the refund status for my first booking?",
   "Show me the best coupons available for the Jai Durga Sant-Prayag bus from Pune to Parbhani.",
   "Show me AC sleeper buses from Hyderabad to Bangalore on 24 December 2025 with 4+ ratings and the lowest prices.",
   "Proceed with booking a Tempo Traveller for the trip from Ghaziabad airport to Rishikesh bus stop on 27th September 2025 at 9:00 AM.",
   "I want to check the seat availability for a coupe from Hyderabad to Tirupati.",
   "Is there a cancellation fee for my bus ticket from Venjaramoodu to Kunnamkulam with KSRTC?",
   "I want to know the cancellation policy for Lokenath Bus Service. If I cancel the ticket two days ago, what will be my refund amount?",
   "What is the cancellation policy for the VRL Travels bus from Manvi to Bangalore?",
   "Is there a cancellation fee for my bus booking with Upasana Travels (Under ASTC) from Orang to Guwahati?",
   "I want to know about the cancellation policy for the 'N.T New National' bus from Mumbai to Aurangabad (Maharashtra).",
   "Please complete my booking for a bus from Amritsar to Jalandhar with 'ORBIT AVIATION PRIVATE LIMITED'.",
   "I would like to know more about the amenities and schedule of the Vijay Tour and Travels bus from Jalandhar to Jind.",
   "Please suggest a different pickup time for my return journey from Jaipur to Gurgaon on 05-01-2026.",
   "Show me the earliest bus options from Kanchipuram to Thanjavur.",
   "We are a couple traveling together. Can you help us with our travel plans?",
   "I want to travel from Kalyan to Ayodhya on 16 March 2026.",
   "I need to find a bus from Delhi to Jaipur for tomorrow, 05 November 2025.",
   "What is the luggage limit for a bus trip from UP Azamgarh to New Delhi?",
   "Refund issue",
   "What are the phone numbers for Shri Khurana Shabrij Travels?",
   "What discounts and coupons are available for Verma travels from Delhi to Azamgarh?",
   "What is the cancellation policy for the TGSRTC bus from Warangal to Kadapa?",
   "Is there a cancellation fee for my bus booking with 'Pramukh Travels' from Chennai to Visakhapatnam?",
   "I need a car from Howrah to Darjeeling.",
   "Provide the itinerary for traveling from Raipur, Madhya Pradesh to Ranchi by Royal Travels Raipur.",
   "What discounts and coupons are available for the Cauvery Travels bus from Bangalore to Sringeri?",
   "Show me the user's history of bookings.",
   "Please help me find ground transportation options to Mirasol Water Park, including details on buses, cabs, or trains available for my visit.",
   "If the Swaraj Express is available from Ghaziabad to Mumbai on 02 Jan 2026, please book it for me.",
   "I am planning a trip from Hyderabad to Mumbai and need transportation recommendations.",
   "What discounts and coupons are available for the APSRTC bus from Hyderabad to Amalapuram?",
   "When will I receive the driver details for the Journey with Maharani Travels bus from Delhi to Jaipur?",
   "I want to book an open deck bus for a city tour in Mumbai.",
   "What are the penalty charges for cancelling my bus booking from Katra (Jammu and Kashmir) to Delhi with 'Laxmi holidays'?",
   "I need to find a bus from Delhi to Kainchi dham.",
   "Show me bus options from Bangalore to Gokarna.",
   "Please tell me the nearest bus stop or point to SRM KTR campus.",
   "Where is my booking option? I'm unable to access the booking page for my confirmed booking from Thiruvananthapuram to Bangalore on December 19, 2025.",
   "Please change the travel date to 18th January for the trip from Tuni to Krishnarajapuram railway station for 2 members, preferably by bus or train.",
   "I need a bus ticket from Ambala to Chandigarh.",
   "What are the exact departure times for sleeper buses from Chennai to Thiruchendur on 25th November 2025?",
   "I want to check KSRTC bus availability from Kannur Caltex to Satellite Bus Stand.",
   "I want to request a full refund for my recent booking.",
   "I need a ticket from Varanasi to Bilaspur.",
   "What is the bus departure time from Geeta Mandir?",
   "I want to use my gift card for booking a bus ticket.",
   "Is this booking a guaranteed trip from Bengaluru to Shimoga?",
   "Why is this not applicable for the TGSRTC bus from Yellandu to Hyderabad?",
   "I want to book a bus from VV Vinayaka.",
   "I want to book a sleeper bus from Lucknow to Kathgodam on 29th November 2025. Please provide available options and fare details.",
   "I want to know about getting 25% of the amount for my travel from Mumbai to Chennai.",
   "I would like to book a bus with RKT Tours and Travels from Hosur to Thanjavur on 31/08/2025.",
   "Please assist me in resolving my issue with accessing the trips page after making a payment via UPI. I need to check the status of my ticket.",
   "I need pick from meadows residency in ooty snd drop at isha foundation ",
   "Please provide the cancellation policy details for my booking.",
   "What are the AC bus timings from Agra to Noida?",
   "Let's try again to find Airavat bus options from Bangalore to Pondicherry.",
   "Show me an Urbania bus from Pandharpur back to Shirdi on 23/1/2026.",
   "I need to find a bus from Ho Chi Minh City to Ankur Wat Temple in Siam.",
   "I need the GPay offer code to complete my bus booking, but I'm being told to contact support after booking. Can you please connect me with customer care?",
   "I need to find bus options for my travel plans.",
   "Is there a cancellation fee for the Chartered Bus - ASTC from North Lakhimpur to Guwahati?",
   "What is the cancellation penalty for FlixBus from Bangalore to Hyderabad?",
   "What discounts and coupons are available for the V Kaveri Travels bus from Bangalore to Srisailam?",
   "I need assistance with booking a bus from Avinashi to Thiruchandur.",
   "I have 11 people traveling with me from Delhi to Ujjain. Please recommend transportation options for our journey.",
   "I want to get return tickets from Bhubaneswar to Kolkata by bus.",
   "I want to know about the Dedo highway treatment.",
   "That no call me",
   "pets allowed",
   "I want a same day trip from delhi to taj mahal and fatehpur sikri on 15 feb",
   "Please get me across to someone I can speak with or file a complaint against you",
   "Please provide details on cancellation charges for bookings.",
   "Show me the cheapest bus price from Belgaum to Pune.",
   "I need a return ticket from Surat to Jodhpur.",
   "I'm looking for bus options from Bathinda to Gurgaon.",
   "What discounts and coupons are available for my bus journey from Peddapalli (Telangana) to Hyderabad with TGSRTC?",
   "What discounts and coupons are available for the NEW HOLIDAY TRAVEL bus from Kathgodam to Lucknow?",
   "I want to travel from Mumbai to Jaipur on 07 Feb 2026, but the booking options only go up to Sikar. Please show me the option to book up to Jaipur.",
   "My account is locked.",
   "I want to know the arrival time of my current bus from Delhi to Dehradun.",
   "I need to find a bus from Vashantanam to Rasipuram for 2 travelers.",
   "Is the Dolphin (Shivam Siddhart) bus from Varanasi to Mumbai a Primo bus?",
   "Show me the earliest bus options from Jodhpur to Aahor, starting at 3:50 AM.",
   "I need a personal car with a driver for 2 adults and 2 kids during our 2-night, 3-day stay in Jaipur.",
   "I need to find a bus from Coimbatore to Chennai with a dropping point at Chromepet, departing after 7:00 PM on 27 September 2025.",
   "Is there a cancellation fee for cancelling my bus ticket with 'SRL Travels' from Coimbatore to Chennai?",
   "I want to track a bus.",
   "What discounts and coupons are available for zingbus plus from Delhi to Rishikesh?",
   "Show me female-only seats on the Vikas Travels bus from Delhi to Dehradun.",
   "I want to know about the cancellation policy for the bus operated by 'Verma Travels' from Ahmedabad to Hyderabad.",
   "Please provide information on how to book an infant ticket for your upcoming travel.",
   "Who can help me get a ticket to Mysore Junction on 5th of December?",
   "I need to book a rental car for my friend to drive from Pune to Lonavla for the Rajmachi trek, then to Mumbai for a day, and finally return to Pune.",
   "I want a private bus from Kozhikode Bus Stand to Sulthan Bathery.",
   "What is the cancellation policy for the Classic Bus And Transport Private Limited from Nashik to Tuljapur?",
   "I need a bus from Sujanpur Tira, Himachal Pradesh to Chandigarh Airport",
   "I want to gather detailed information about the Airbus A380, including its specifications, features, and operational history.",
   "I'm really frustrated with the ticket confirmation process. Can you help me understand why my ticket isn't getting confirmed?",
   "I want to travel from Rishikesh to Hisar by bus.",
   "There are two persons",
   "Is the bus from 'Ram Dalal Holidays Pvt Ltd' for my journey from Rishikesh to Delhi a Primo bus?",
   "What is the ticket price for the Vande Bharat express from Delhi to Katra for 3 adults?",
   "What are the bus timings for traveling from Pune to Bhimashankar?",
   "Is there a cancellation fee for the Laxmi holidays bus from Mathura to Patna (Bihar)?",
   "What is the ticket value for children below 3 years?",
   "I want to travel from Chennai to Tiruvannamalai on March 28.",
   "Please arrange a call with an executive regarding my pickup.",
   "Not able to make payment afterpressing payment option from my round trip from Somanath to Gir on 4th  |Feb 730 am to 945 pm.",
   "What is the pick-up timing for the M R Travels bus from Ahmedabad to Jaipur?",
   "Please inform me about the new facilities you are offering, as I see that all the existing facilities remain the same. I don't understand how the facilities could change within just 2 months.",
   "Is there a cancellation fee for my bus booking with 'Shri Krishna Travels' from Surat to Varanasi?",
   "Is Rajendra Nagar point available for drop and pick up at Indore?",
   "Show me bus options to Lambasingi.",
   "What is the cancellation policy for the BHAIRAVA TOURS AND TRAVELS bus from Madanapalli to Srisailam?",
   "What are the penalty charges for cancelling my bus journey with 'BSS Cool Cool Travels' from Mau to Delhi?",
   "Yes, I would like to know how to apply the discounts and coupons during my booking for the Cochin Bus from Ernakulam to Mysore.",
   "reschedule booking",
   "What is the cancellation policy for the Jai Maa Gauri (Golu and Mahindra) bus from Aurangabad (Bihar) to Asansol (West Bengal)?",
   "What discounts and coupons are available for the Joon Moon Express bus from Jorhat to Guwahati?",
   "Mumbai to new delhi",
   "Is my booking for seats from Bengaluru (SBC) to Kanniyakumari confirmed?",
   "I want to book a KSRTC bus from Bengaluru to Chitradurga.",
   "I need transportation from Noida cut on the Delhi Expressway to Rishikesh.",
   "What is the platform number for the 17840 Tirupati Puri Express at Tirupati?",
   "What is the cancellation policy for the APSRTC bus journey from Vijayawada to Hyderabad?",
   "I want to know about the Krsvp bus for my onward journey.",
   "I want a bus from Parola to Warje, Pune for tomorrow morning, February 4th, 2026.",
   "I want to pay the ticket amount for two seats just booked from Vashi to Latur.",
   "I'm not seeing the Ticket Guarantee option or it's not responding. Can you help me with that?",
   "I am looking for the cheapest way to travel from Shivpuri to Jaipur.",
   "I need confirmed Executive Class tickets on Vande Bharat for a return journey from Borivali to Vadodara on 08-11-2025.",
   "Is there a cancellation fee for the bus ticket from Kannauj to Gorakhpur with 'BSS Cool Cool Travels'?",
   "What discounts and coupons are available for the TGSRTC bus from Rajahmundry to Hyderabad?",
   "Provide details for the Vande Bharat Express journey from Delhi to Hyderabad, including schedule, seat availability, fare, and onboard amenities.",
   "Unable to web check in",
   "What are the penalty charges for cancelling an SRS TRAVELS bus from Gokarna (Karnataka) to Bangalore?",
   "Please provide bus options from Chinchoda to Ghosri Pune.",
   "What discounts and coupons are available for KSRTC (Kerala) bus from Thiruvananthapuram to Kattappana?",
   "Retrieve the user's old invoices on MakeMyTrip.",
   "I need to talk to the help desk.",
   "I am looking for information about Kerala RTC buses.",
   "I am looking for cheap bus tickets from Trivandrum to Chennai.",
   "My 15% discount code for LAKSHMI HOLIDAYS TOURS AND TRAVELS from Tadepalligudem to Hyderabad is not working.",
   "The ID is not opening. Can you help me resolve this issue?",
   "I want to know the best way to travel from Pune to Raigad. Please suggest the most convenient and efficient options available.",
   "The driver is not picking up their phone.",
   "I want to add 5 people to my booking.",
   "Is there a bus from Kurula Nehru Nagar Bus Depot to Lalperi, Dhulia, operated by ST Mahamandal, available at night? If so, what time does it leave?",
   "I want to track a bus from Bangalore to Aurangabad.",
   "I want to know about the cancellation policy for the JKRTC bus from Srinagar to Jammu.",
   "I will pay for the trip guarantee, but I need assistance with the ticket.",
   "I want to book a confirmed ticket from Delhi to Kolkata.",
   "I want to talk with a human for booking.",
   "Provide details about the sleeper class amenities and fare on the Paschim Express (12925) from Mumbai Bandra to Amritsar Junction on 25th January.",
   "I need my trip guarantee refund.",
   "I would like to know more about the cancellation policy for the 'Goldline Super Deluxe' bus from Jaipur (Rajasthan) to Gurugram (Gurgaon). Is there a cancellation fee?",
   "What is the pickup location for Modern Travels bus from Kolkata to Siliguri?",
   "Please provide the bus details for travel from Ghaziabad to Kanpur.",
   "I am looking for SBSTC bus services.",
   "Provide detailed lounge options for business class at Guwahati and Patna airports, including access criteria, amenities, operating hours, and any upcoming lounge openings.",
   "What discounts and coupons are available for the WBTC (CTC) bus from Durgapur (West Bengal) to Kolkata?",
   "What is the pickup point in Panipat for bus travel?",
   "What does CC mean in relation to tickets?",
   "What is the Free Cancellation add-on for my bus journey from Angamaly to Mangaluru?",
   "What is the cost for Free Cancellation with Jabbar Travels bus from Bangalore to Chennai?",
   "Show me available bus and train options from Pune to Dwarka with available seats.",
   "I'm looking for bus options from Panvel to Alibaug for 4th October 2025.",
   "I want to book 2 tickets from Chennai to Madurai on 02-10-2025.",
   "I need to book a round trip car for sightseeing from Bhubaneswar to Konark and Chilika Lake, Odisha.",
   "I want clarification on booking a full car for a 5-day trip from Dandeli to Badami, starting on 30th November at 11:00 AM. Can you provide more details on the booking process and options available?",
   "What is the cancellation policy for the FlixBus from Chennai to Guntur (Andhra Pradesh)?",
   "Where can I find information about trip guarantee for my journey from Dhanbad to Madikonda on 22-08-2025?",
   "What discounts and coupons are available for Jai Mata Ji Travels bus from Gadarwara to Indore?",
   "I want to book a ticket for my 7-year-old child on the zingbus plus journey from Ernakulam to Salem.",
   "What discounts and coupons are available for my bus journey from Guwahati to Sepon with 'NETWORK TRAVELS'?",
   "There is no additional charges ",
   "I want to book a bus from Sarjapur, Bangalore to Bangalore airport.",
   "Why did they drop me?",
   "I need details about ro-ro services, including types of services available, schedules, and pricing.",
   "Show me bus options from Indore to Ratnagiri.",
   "I want to book tickets from Visakhapatnam to Renigunta on 27 November.",
   "Show me bus options from Rajahmundry to Kochi.",
   "I need a discount coupon for a bus.",
   "Please provide the link for providing feedback to my driver.",
   "Show me available Toyota Fortuner options for rental from Cochin to Kerala on 22-03-2026.",
   "yes cancel entire booking",
   "I want to book a ticket for the Gola Bus Service from Delhi to Katra for next year on November 5, 2026.",
   "Request the status of the refund for the cancelled ticket that has not been credited to the user's wallet.",
   "I prefer to travel by bus from Pune to Desai Naka, Dombivli East. Please provide the best bus options available for this route.",
   "Show me other bus options from Chennai to Vedasandur.",
   "I would like to make a customer care call.",
   "What is the concession available on female tickets for the Journey with RSRTC Bus from Fazilka to Khajuwala?",
   "I am looking for buses from Khimsar to Pali on 11 January (2026-01-11).",
   "What is the Trip Guarantee for my journey from Visakhapatnam to Tirupati?",
   "What is the refund amount if I choose Free Cancellation for the FlixBus from Delhi to Bareilly?",
   "I need assistance with work-related tasks.",
   "Very bad. I need to find bus travel options from Bhadrachalam to Jaso.",
   "What is the cancellation policy for the Laxmi holidays bus from Shimla to Delhi?",
   "I need to find a bus from Kalyan to Vaibhavwadi Kokan.",
   "I want a return ticket from Ujjain to Pune.",
   "What discounts and coupons are available for my bus journey from Pathalgaon to Bilaspur (Chhattisgarh) with 'Sitara Bus Service'?",
   "I want to return a ticket to Ahmedabad.",
   "Is there a cancellation fee for the K.S Travels bus from Amritsar to Delhi?",
   "Show me bus options from Katra, Jammu and Kashmir to Delhi.",
   "Is it mangalore to sringeri and sringeri to mangalore both the ride right? Included ",
   "Will the bus from Jhansi to Gorakhpur with Shivam Travels be canceled?",
   "Is there a cancellation fee for the PAL BUS (Patel Travels) from Rajkot to Jaipur?",
   "I would like to know more about the guided tours available for sightseeing in Adoor, starting from Bangalore.",
   "I want to book a round trip with Shyamoli Paribahan Pvt Ltd from Vijayawada to Puri.",
   "What is the coupon code for the APSRTC bus from Bangalore to Vinjamur (Andhra Pradesh)?",
   "I am unable to use the GPAYMMT10 coupon.",
   "I suggest that you consider making the boarding point at the New Bus Stand in Thoothukudi to attract more customers.",
   "im from mauritius",
   "I need bus options from Shivneri to Pune. Please provide the available routes, timings, and fares for this journey.",
   "What discounts and coupons are available for the APSRTC bus from Mulakalacheruvu to Hyderabad?",
   "I need a low-price cab from Dehradun airport to Sonprayag bus stand on 17th September 2025 at 12:00.",
   "Show me all available bus options from Delhi to Rewalsar for tomorrow, January 24, 2026.",
   "Show me bus options from Imphal to Bangalore.",
   "I want to add a coupon to my GSRTC bus booking from Somnath to Bhuj, but I am unable to do so.",
   "I have entered the travelers' names and dates, but when I click to proceed to the payment step, the app is unnecessarily asking me to reset my password. Why is this happening?",
   "What discounts and coupons are available for the Samay Travels bus from Gandhinagar (Gujarat) to Chotila?",
   "I need onward bus transportation from Deesa Dipak Hotel to Shankeshwar.",
   "Show me rickshaw options for traveling from Margao Station to Bambolim.",
   "Please provide the driver details for my journey with SGT Translinks Bus from Bangalore to Palani.",
   "Show me bus options from Bangalore airport to Ernakulam.",
   "I need to find a private car with a driver for my Char Dham Yatra trip starting from Roseate House, Delhi on May 11, 2026, with a pickup time at noon.",
   "I want to track the bus location for my trip from Varanasi to Ernakulam today.",
   "I am looking for Non-AC bus options from Paratwada to Pune on 25th January.",
   "Please provide the details of my bus booking from Dharmshala to Delhi for 2nd August for 4 travelers.",
   "Show me APSRTC buses.",
   "What is the cancellation policy for the Yuga Travels V-Class bus from Amravati to Kalyan?",
   "Show me bus options from Surat to Somnath.",
   "I want to know the boarding and dropping points for the bus from Thiruvananthapuram to Thodupuzha. The bus departs at 11:30 PM and arrives at 04:40 AM. Please provide the details.",
   "Is there a cancellation fee for the Raj Ratan Tours And Travels bus from Indore to Ahmedabad?",
   "Is there a cancellation fee for my bus ticket from Kolkata to Siliguri with 'Shyamoli Paribahan Pvt Ltd'?",
   "Why is the ticket fare showing less than the original ticket fare for the journey from Adavali to Thane?",
   "Why is my offer not reflecting for the Raj Kalpana Travels Pvt.Ltd bus from Delhi to Dehradun?",
   "When will I receive the driver details for my bus journey with SM Tranz Bus from Coimbatore to Tiruchendur?",
   "I need to find onward bus transportation from Vashi to Chotila.",
   "What is the discount for the coupon code MMTGPAY for my journey from Indore to Rewa?",
   "I need to know the available buses tonight (2025-10-23) from Chennai to Mettur.",
   "I would like to book a car package from Alleppey to Munnar with a pickup on October 3rd.",
   "What is the coupon code for KSRTC (Kerala) bus from Kozhikode to Sulthan Bathery?",
   "Initiate the group booking process for 15 travelers from Chennai to Jeddah.",
   "Show me the timings for the buses from Zirakpur to Delhi on 07 Aug (Thu) that were mentioned earlier.",
   "Please provide information on how to get your user ID verified for your trip to Patna.",
   "Why is the 25% booking amount option not showing for my travel from Delhi to Ujjain?",
   "Please provide the specific details of my voucher, including its validity period and the terms and conditions that apply to it.",
   "What discounts and coupons are available for Shama Transport bus from Ramanathapuram to Bangalore?",
   "I would like to know more about the cancellation policy specifically for this bus from Hyderabad to Srikakulam.",
   "I have not received the full refund for my booking. I paid ₹ 9,058 but only received ₹ 7,888. Can you assist me in resolving this issue?",
   "Maine ek ticket banaya trip guaranteed ka saath.",
   "The gift card option is not showing. Can you help me resolve this issue?",
   "What is user consent regarding the NueGo bus from Delhi to Rudrapur?",
   "When will I receive the driver details for the GK Travels bus from Rohtak to Patiala?",
   "What happens if my bus from Kalaburagi to Mumbai is cancelled by the operator?",
   "I need assistance with travel planning, but I haven't specified any preferences or destinations yet.",
   "Proceed with booking a ticket on the Rangia Leto Express from Guwahati to Dimapur, departing at 7:20 AM on 19th October 2025.",
   "We are a couple, husband and wife, looking to book 2 upper deck seats on the Shri Abinesh Roadways bus from Mysore to Chennai.",
   "What discounts and coupons are available for my bus journey from Dhanbad to Hazaribagh with 'Pammi Travels'?",
   "What does it mean when you say that at least one traveller is required for the zingbus plus from Meerut to Dehradun?",
   "Will the bus from Nanded to Warje, Pune drop at Karve Putla at 8 AM, or will it not make it to Lata?",
   "I can see the Trip Guarantee option, but the price for it is not mentioned. Can you help me with that?",
   "Why am I not seeing the option to use my 3000 worth of bus gift card while booking a bus ticket?",
   "What is the free cancellation policy for my bus booking with 'Azul Transports Private Limited' from Ettumanoor to Tamil Nadu?",
   "I want to know how to book a guaranteed ticket for my travel plans.",
   "I am looking for the fastest way to travel from Bangalore to Salem at 6 AM on February 6, 2026.",
   "What are the night charges",
   "I am looking for the lowest price for bus tickets.",
   "Provide information on why a convenience fee is charged.",
   "Please guide me on how to download my booking slip.",
   "I would like to book the Gujarat Travels bus from Ahmedabad to Dwarka, departing at 10 PM.",
   "Will they stay with us in chikmanglur full time?",
   "What is the refund date for trips booked through our service?",
   "If i pay parial booking amount when will i pay the rest",
   "I need to book a sleeper bus from Delhi to Indore on 17th October.",
   "I want to book bus tickets for Mumbai darshan on January 14, 2026.",
   "Plan for a trip from Prayagraj (Allahabad) to Lucknow for tomorrow.",
   "Why is the alternate travel plan not showing for my journey from Sindhudurg to Mumbai?",
   "Show me bus services from Gorakhpur to the Nepal border.",
   "What are the penalty charges for cancelling a booking with Laxmi Holidays? I want to know the details based on my booking from Delhi to Shimla.",
   "I am looking for the ISS bus service from Hisar to Bahadurgarh.",
   "Please share the mobile number of the GSRTC booking depot manager.",
   "Show me bus options for traveling from Bhubaneswar to Puri.",
   "I want to know about the cancellation policy for the bus from Katra (Jammu and Kashmir) to Zirakpur (Punjab) operated by 'Laxmi holidays'.",
   "What is the cost for Free Cancellation with GK Travels bus from Zirakpur to Gorakhpur?",
   "I made a payment, but the payment gateway has closed now. Please help me resolve this issue for my trip from Delhi to Kota.",
   "If I travel on a waiting list ticket from Delhi to Reengus and nobody takes the seat, can I still travel?",
   "Will I receive confirmation for my booking from Jodhpur to Arrah?",
   "What is the cancellation policy for the KSRTC (Kerala) bus from Mananthavady to Chalakudi?",
   "I want to pay online for the SHYAMOLI Pvt. Ltd. bus from Kolkata to Durgapur (West Bengal).",
   "If I pay extra for Trip Guarantee, will that additional amount be refunded?",
   "Is there a cancellation fee for my bus booking with Azul Transports Private Limited from Chennai to Pathanamthitta?",
   "I want to book my ticket from Ahmedabad to Mumbai.",
   "Is there a cancellation fee for my UPSRTC bus ticket from Noida to Shahjahanpur?",
   "It is not appearing",
   "Is my journey from Delhi to Belpahar on 30-12-2025 confirmed?",
   "Please find me the best bus options from Chennai to Ooty.",
   "I need to speak with your agent, please arrange that. I am traveling from Eluru to Krishnagiri on 27th January 2026 with 3 passengers and 4-5 medium bags. I want to confirm if there are any extra costs for my luggage requirements.",
   "I need an AC bus with a sleeper berth departing at 10 PM on 16 January 2026.",
   "Please confirm the pickup date and time for your trip from Chennai to Velankanni and back for 15 travelers in a Tempo.",
   "I would like to know more about the Alternate Trip feature.",
   "Show me available buses from Alandur, Chennai to Trichy.",
   "Please check the status of my booking as I cannot see it.",
   "What is the nearest bus stop to Majestic from Central Railway Station?",
   "I want to see only the Volvo Multi-Axle buses for my trip from Surat to Mumbai.",
   "What discounts and coupons are available for the IntrCity SmartBus from Belagavi to Mumbai?",
   "Will the driver stop if I have to take a break for lunch and all ",
   "What discounts and coupons are available for my bus journey from Bikaner to Ludhiana with 'Milan Travels'?",
   "I am trying to book a confirmed ticket from Pipraich to Mumbai, but the option shows that the ticket is not confirmed. It only shows a confirmed option. If I book the confirmed option from Pipraich to Gorakhpur and then to Bandra, will my ticket be confirmed for the entire journey?",
   "Is there a cancellation fee for the bus booking from Patna to Bhubaneswar with Dolphin Tours and Travels?",
   "I need to know if we can get a confirmed ticket for Yog Nagare Express from Vasai to Muzaffarnagar.",
   "Show me low price bus options from Pudukkottai to Bangalore on 21/10/2025.",
   "I'm using the MakeMyTrip app and making a 25% payment, but the seat lock option is not appearing for my journey from Bengaluru to Lucknow. Can you help me understand why this feature isn't available?",
   "What is the Free Cancellation add-on for my bus journey from Lucknow to Indore with 'Gajraj Travels'?",
   "I need to find a bus from Hyderabad to Kurnool for 2 passengers on 01-10-2025, with one passenger dropping off in Kurnool and the other in Nandyal, during the timing slot between 6 pm and 10 pm.",
   "I want to book my bus tickets for the Greenline bus from Kolkata to Puri on 04 February 2026.",
   "I want to book a bus ticket from Hyderabad Gachibowli to Chintalapudi.",
   "Suggest the cheapest bus travel options from Rohtak to Nainital for 3 travelers on a budget trip.",
   "I need help with my ride.",
   "I want to lock a seat in 2 AC class for my journey from Delhi to Kamakhya on 07-12-2025.",
   "I want to travel to Baidyanath Jyotirling from Lucknow to Jasidih on 24 January 2026.",
   "If I book the ride from Phagwara to Dharamshala on January 24, 2026, will it not get cancelled?",
   "Please find me the best AC bus service from Agra to Ayodhya.",
   "I'm travelling from Lucknow to Hapur on 12-09-2025. Please recommend transportation options for this trip.",
   "I want to travel with my pet from Bengaluru to Hyderabad by bus. Please find me suitable bus options that are pet-friendly.",
   "What are the details of my seat number for the Shree Pramukhraj Travels bus from Ahmedabad to Jamnagar?",
   "Please transfer me to customer service.",
   "What discounts and coupons are available for Tani Travels bus from Amravati to Pune?",
   "I need assistance with booking a travel ticket.",
   "My ticket was 5429 but I only received a refund of 4610",
   "What discounts and coupons are available for Dolphin tours and travels from Puri to Korba?",
   "Yes, I would like to know more about the booking process or any other details related to my travel from Kanpur to Mumbai.",
   "What are the penalty charges for cancelling my booking with Shirdi Xpress? I need to know the details since the bus driver is not answering my call.",
   "What are state tax charges",
   "What is the running status of the bus?",
   "I want to know more about the bus journey from Varanasi to Delhi with OurBus India Limited.",
   "Show me buses from Hyderabad to Bangalore with stoppages at Anandrao Circle and Electronic City.",
   "I am looking for Volvo bus options from Katra to Delhi for today, 24 January 2026.",
   "What is the alternate travel guarantee for my journey from Karnal to Mumbai?",
   "Please arrange the bus options from Periyakulam to Chennai Koyambedu in order of price from low to high.",
   "I would like to proceed with booking a bus from Coimbatore to Bengaluru for tomorrow, 13th January 2026.",
   "I need to find the available AC buses from Siliguri to Durgapur for the year 2024.",
   "Please provide the estimated cost for hiring a luxury coach for 50 people from Delhi to Dhanshree for the wedding on December 22, 2025.",
   "Will I get the 1800 free cancellation charge if I cancel the ticket from Delhi to Goa?",
   "I am unable to type in the slot provided for applying the offer for the APSRTC bus from Tirupati to Bangalore.",
   "What is the cancellation policy for the Journey with Rajwadi Travels Bus from Talala to Ahmedabad?",
   "Is the Dada Brothers bus from Hyderabad to Raipur (Chhattisgarh) a Primo bus?",
   "Show me buses from Noh to Gurgaon.",
   "What are the expiry details for the BUSTRAINPASS coupon for my journey from Jhansi (Uttar Pradesh) to Rewa?",
   "What do I need to do to get an immediate ticket from Varanasi to Ahmedabad?",
   "Is there a cancellation fee for my bus journey with Shankar Parwati Travels (yvts) from Bhagalpur to Jamshedpur?",
   "This is a unique setup from Chennai to Rameswaram. I need transportation recommendations for this route.",
   "I would like to make a reservation for a bus from Mantralayam to Bangalore on 5th October.",
   "I want to know about free cancellation options related to the Trip Guarantee.",
   "I prefer to travel by bus from Unjha to Ajmer. Can you provide the best bus options available for this route?",
   "What is the cancellation policy for the DNR Express bus from Chandrapur to Pune?",
   "What is the bus fare applicable for a 2-year-old kid?",
   "I am unable to book my ticket for October 17, 2025.",
   "What discounts and coupons are available for my bus journey from Kurukshetra to Manali with 'Bedi Travels'?",
   "What is the cancellation policy for the Uttarakhand Transport Corporation (UTC) bus from Dehradun to Delhi?",
   "What happens if my bus with Sanjay Travels from Mumbai to Nagpur is cancelled by the operator?",
   "What discounts and coupons are available for the bus with AJAY RAJ TRAVEL COMPANY from Neemuch (Madhya Pradesh) to Amritsar?",
   "I want to book a round trip bus from Nagpur to my current city (Mumbai) departing tomorrow.",
   "I want to stop at some sightseeing in prayagraj",
   "I want to see bus options from Madurai to Bangalore on February 28, 2026, for 1 person.",
   "What is the cost for Free Cancellation with Ashray Travels Benz bus from Pune to Kankavli?",
   "Show me the local bus routes in Guwahati.",
   "I want to book a bus ticket from Srikakulam to Hyderabad for the night of 24th September 2025.",
   "I want a local car for sightseeing in Ganpatiphule.",
   "I want to know if I have booked my ticket for tomorrow with a meal or without a meal.",
   "What discounts and coupons are available for the Classic Bus And Transport Private Limited from Solapur to Bangalore?",
   "What will be the bus ticket price from Pipli to Vaishno Devi?",
   "Show me bus tickets from Nagpur to Howrah.",
   "Show me buses from Varanasi to Delhi.",
   "What is the cancellation policy for the SVD Travels and Transport LLP bus from Delhi to Gorakhpur?",
   "What is the cancellation policy for the AaRa Travels bus from Tiruchirapalli to Chennai?",
   "I am looking for the cheapest AC bus from Vijayawada to Madhurawada.",
   "Show me tourist buses from Kollur to Mookambika Temple and back.",
   "I want to book 2 bus tickets from Bangalore to Belagavi with different names for male and female passengers.",
   "What discounts and coupons are available for Dubey's Travels bus from Bilaspur to Garwa Road?",
   "Provide information on the confirmation status of a confirmed ticket and the refund process for a 3x refund ticket.",
   "I need to book 4 AC bus tickets from Kolkata to Digha on 5/11/2025.",
   "What discounts and coupons are available for the Dhariwal Travels bus from Mumbai to Pithampur?",
   "I am looking for buses from Patna to Purnea.",
   "If the bus departs late, how much refund will I receive if I cancel my ticket during that period?",
   "Proceed with finalizing the booking for the bus ticket as requested.",
   "Which type of waiting list is likely to get confirmed faster, GNWL or RLWL? I want to confirm tickets for Vapi to Pali Marwar between 25 October to 29 October.",
   "Is my pet allowed on the Shri Krishna Travels bus from Kharar to Ludhiana?",
   "I wish to speak to your agent.",
   "I want to know about the coach options for travel from Hubli to Bengaluru on 07-01-2026.",
   "Is there a bathroom inside the 'Natraj Bus' for my journey from Jamshedpur to Varanasi?",
   "What discounts and coupons are available for my bus journey from Chamba (Himachal Pradesh) to Bilaspur, Himachal Pradesh with HRTC?",
   "Show the seat map for Ranadeep Travels bus from Hyderabad to Visakhapatnam.",
   "I would like to rent a self-drive car from Anjuna to Morjim for the dates 29/12/25 to 01/01/2026, with a pickup time between 11 am and 1 am.",
   "What is the cancellation policy for the G8 Express bus from Madurai to Thiruvananthapuram?",
   "I need to book an Uber from Deoria to Fun Mall in Lucknow for tomorrow at 9 AM.",
   "Show me the best coupons available for Swamy Ayyappa Travels bus from Pondicherry to Coimbatore.",
   "Show me all available bus options from Bengaluru to Goa for tonight (2026-02-12).",
   "Show me bus options from Patna, Bihar to Narwana, Haryana.",
   "I would like to know about the 25% payment option for ticket booking from Chennai to Kolkata.",
   "I need to find buses from Vijayawada bus stand to Hyderabad Airport that have washrooms.",
   "I want to travel from Ambala Cantt to a city in Punjab.",
   "My booking is confirmed. Please check why two times money was deducted from my account.",
   "I need assistance with ferry booking from my current location.",
   "What discounts and coupons are available for my bus journey from Goa to Raipur (Chhattisgarh) with 'Dada Brothers'?",
   "I would like to rent a bus from Bangalore to Kukke Subramanya.",
   "I don&#39;t need 500 KMs I want only 300 KMs can you provide me the updated fare",
   "Set Jaipur, Rajasthan as the destination for the bus from Kashipur, Uttarakhand.",
   "Yes, I would like to know how to apply the coupon codes during my booking for the IntrCity SmartBus from Jalandhar to Delhi.",
   "I am using Google Pay for my payment, but the MMTGPAY coupon is still not working. Can you help me resolve this issue for my journey from Bangalore to Kadapa?",
   "Is there a cancellation fee for the P K Travels bus from Bangalore to Tirur?",
   "Proceed with booking the airport limousine bus route 6007 from Incheon Airport to Courtyard Marriott Time Square Seoul.",
   "Is there a cancellation fee for the SHIVNARAYAN TRAVELS bus from Siliguri to Purulia?",
   "What are the available buses from Bangalore to Madurai on 26 December 2025?",
   "What is the cancellation policy for the Shyamoli Paribahan Pvt Ltd bus from Bangalore to Thiruvananthapuram?",
   "Please find alternative 4x4 rental vehicles for my trip from Delhi to Spiti Valley on November 9th, 2025, with a morning pickup.",
   "I want to add TripAssured for 2 seats.",
   "I need to find bus tickets and timings from Coimbatore to Ernakulam.",
   "I want to check the live location of bus number GJ-A-4031.",
   "Please log me into my account so I can access my bookings and preferences.",
   "What is the Main Flyover Starting point for the INDO CANADIAN® EXPRESS bus on November 7, 2025, departing from LPU main gate to Chandigarh?",
   "I want the driver to take a faster route but it has more miles. How do I indicate this preference  in my booking",
   "Show me the available buses from Jaipur to Nagpur on 16th October 2025.",
   "Is there a cancellation fee for the Akash Travels bus from Khatushyamji to Delhi?",
   "I am unable to find tickets for the buses from Hyderabad to Bhubaneswar.",
   "What is FC?",
   "I want tickets for 2 people from Delhi to Guwahati on December 4, 2025.",
   "I need to find a bus from Chandapura, Bengaluru to Koteshwara.",
   "Process the refund for the pre-booked vehicle as it is no longer needed.",
   "I want to pay a partial amount for my journey from Jammu to Rampur.",
   "Is an online waiting ticket valid?",
   "The fare shown on this page for the bus journey from Vadodara to Ajmer is ₹900. Can you confirm this fare and provide details about the bus options available for two travelers on 4th January 2026?",
   "I need detailed information about cars, including types, features, and pricing.",
   "Please assist me with the reservation from Hyderabad to Thiruvananthapuram.",
   "Please connect me with support regarding the Seat Lock feature issue in the MakeMyTrip app.",
   "The cards for bus options from Delhi to Hyderabad are not clickable.",
   "I want to book a ticket from Vijayawada to Howrah for the journey on 19-10-2025.",
   "Please check the status of the pending cash from my two completed trips, including EMMADI KEERTHANA.",
   "Mala udya sakali 7:00 vazta Mumbra yethe pohachaycha ahe. Krupaya Pune to Mumbra sathi transport options shodhayla madat kara.",
   "Ranjit Kumar.",
   "Please provide the details for a full bus booking with Maa Gayatri Travels from Dhanbad to Deoghar on 4 December for a total of 70 seats.",
   "I would like to visit Tiger Hill for sunrise during my trip from Bagdogra to Darjeeling on 05 Feb 2026 at 16:30.",
   "What discounts and coupons can I use with my ICICI credit card for my journey with TGSRTC from Tirupati to Hyderabad?",
   "Please retrieve the details of my previous canceled booking.",
   "I want to attach my car for today.",
   "Show me the availability of Primo buses from Delhi to Jaipur on 23 Jan (Fri).",
   "I don't have an Axis credit card, so AXISEMI coupon is not applicable. Can you give me details about other coupons available for my bus booking from Bhopal to Pune?",
   "What sightseeing options are available in Puri? I'm looking for recommendations for activities while traveling from Bhubaneswar to Puri.",
   "The customer support number provided is for airlines, not for bus queries. Can you give me the correct number?",
   "Will I get a confirmed ticket for my journey from Hulhundu to Renigunta on 30th December?",
   "Please provide a one-day itinerary for cab service in Shimla for 2 travelers on October 16, 2025, starting from Ibtc Shimla bus stop.",
   "I want to rent a 50-seater bus from Mysore to Bangalore on November 30th.",
   "Is there a cancellation fee for my bus booking with 'Krishna Travels' from Lucknow to Delhi?",
   "I am unable to book this ticket from Karnupur to Mumbai at this time. Can you help me with that?",
   "PLEASE CONFORM MY TICKET COPY",
   "I am unable to get trip guarantee for my journey from Pune to Hyderabad.",
   "I couldn't book the KSRTC (Kerala) bus from Thrissur to Kozhikode. Can you help me find available bus options for this route?",
   "Please provide the bus fare options from Aurangabad to Kainchi Dham.",
   "I would like to book 3 tickets from Chennai to Kumbakonam.",
   "I want to travel from Rajkot to Surat on 02 Feb 2026. Please recommend the best transportation options available for this route.",
   "I am unable to proceed to the next step after entering the ticket number for my bus from Tiruchirapalli to Coimbatore.",
   "I want to know about the cancellation policy for the GSRTC bus from Bhildi to Radhanpur, Gujarat.",
   "Is there any bus service from Kanchipuram to Udumalpet?",
   "What discounts and coupons are available for Mythri Tours And Travels bus from Hyderabad to Pune?",
   "Show me onward bus options from Pune.",
   "Show me all the available bus options for traveling from Hosur to Sathyabama University, Chennai.",
   "Show me more bus options for the route from Chandigarh to Gorakhpur.",
   "What discounts and coupons are available for KBS Luxury Bus from Coimbatore to Bangalore?",
   "What discounts and coupons are available for the GSRTC bus from Nashik to Saputara?",
   "I need 2 tickets from Tuni to Ranchi for 2 travelers.",
   "Show me bus options for transport in Mumbai.",
   "What discounts and coupons are available for my bus journey from Gorakhpur to Jaipur with 'Anshi Raj Shree Travels'?",
   "Why didn't the trip guarantee work?",
   "I need to find a bus trip from Delhi to Purulia.",
   "I forgot my password and need help resetting it.",
   "Show me buses from Pune Wakad to Bharuch for today, 28 August 2025.",
   "Is there a toilet available on the Golden Temple Express Volvo bus from Jalandhar to Delhi?",
   "I don&#39;t understand. ",
   "Please provide the driver details for my bus journey with Shri Krishna Travels from Dehradun to Jammu.",
   "Is there an option for free tickets for bus travel?",
   "I WANT TO DOWNLOAD TICKETS",
   "I need to book a bus ticket from Chennai to Bangalore on 24th January.",
   "Please provide the fare details for the RSRTC bus from Jaipur to Khatushyamji.",
   "I am looking for full sleeper buses from Hyderabad to Bangalore on 26th January, with a budget of ₹1500.",
   "Is there a cancellation fee for the bus booking with 'Dwarka Tours And Travels' from Dombivli to Chalisgaon?",
   "I want to book an AC sleeper bus from Whitefield, Bangalore to Sholinganallur, Chennai for today, 2025-10-06.",
   "Please check if I can book an MSRTC bus from Chembur to Dapoli Ratnagiri.",
   "The subscription service is very bad, as my ticket is not confirmed every time.",
   "The promo code is working for the Kerala Express from Nagpur to Jhansi, but it is not working for the AP Express on the same route.",
   "I need to file a complaint regarding my journey from Mumbai to Prayagraj.",
   "I need to find a bus from Dadar to Hinjewadi via Atal Setu Bridge.",
   "Why is my MakeMyTrip gift card not showing as a payment option when I try to book a bus?",
   "I want ticket confirmation for my journey from Chennai to Hyderabad.",
   "Please provide the driver details for the Sonia Travels bus from Mulamthurthy to Sulthan Bathery.",
   "I haven't checked for app updates or restarted the app yet. Can you help me with that?",
   "Show me bus options from Rameswaram to Pune.",
   "I would like to know about the bypass drop points for the bus from Dehradun to Meerut.",
   "What is the free cancellation policy for my bus booking with 'Shakmbhari Travels' from Delhi to Atraulia?",
   "I want to rent a vehicle for my local transportation needs.",
   "When will the 2X voucher be credited?",
   "I am looking for DNA CC bus services from Chennai to Nagercoil.",
   "What discounts and coupons are available for the WBTC (CTC) KOLKATA - KRISNANAGAR - MAYAPUR (AC- VOLVO) Banglashree Express bus from Kolkata to Mayapur ISKCON?",
   "What is the travel pass offer for the Assam State Transport Corporation (ASTC) bus from Guwahati to Tezpur? It's not showing up.",
   "Provide information about Zingbus Max, including routes, schedules, and booking details.",
   "Track bus service number 1659 from Ongole to Lb Nagar.",
   "I need a bus from Noida to Mathura at 4:00 PM today.",
   "Tell me about the amenities available in the 1st class AC of the VRDL BDTS Express.",
   "This is regarding refund I have been calling for past week connect me to a representative",
   "What discounts and coupons are available for the Northern Travels bus from Mumbai to Goa?",
   "What is the cancellation policy for the Anand Travels bus from Kundapur to Mumbai?",
   "Show me private operators for Volvo buses from Bengaluru to Surat that depart after 10 PM on 23 Jan.",
   "What is the cancellation policy for the Journey with Maharani Travels Bus from Delhi to Jaipur?",
   "Is there a cancellation fee for my bus booking with Bhaiya Travels (Multani Sona Travels) from Ashta (Madhya Pradesh) to Varanasi?",
   "Show me the cheapest rental car options available in Goa for 3 days, preferably a compact and budget-friendly option.",
   "Is there a cancellation fee for my bus booking with 'National travels' from Bangalore to Goa?",
   "Please contact me",
   "What are the chances of my ticket being confirmed from waiting list for my journey from Guntur to Chennai on 21 January 2026?",
   "Show only Shivneri buses.",
   "Is there a cancellation fee for Tapti Ganga Travels? I want to know the penalty charges upon cancellation.",
   "If the ticket is 270, why am I not getting a 50% discount?",
   "What is the cancellation policy for the zingbus Maxx from Sullurupeta to Hyderabad?",
   "I need the bus details for traveling from Nagpur to Hyderabad. I'm aware of the cancellation policy.",
   "Why am I unable to book tickets using my Bajaj card?",
   "I want to book 2 tickets from Mumbai to Prayagraj (Allahabad) on 24-11-2025 for 2 travelers.",
   "Show me Sea Bird buses from Bangalore to Goa.",
   "What is the route for the UPSRTC bus from Lucknow to Tundla?",
   "Is there a cancellation fee for the Zingbus Plus from Delhi to Kasol?",
   "If the driver cancels, how will I receive the cancellation information?",
   "Provide the user with the contact details for customer care for assistance regarding their refund status.",
   "What discounts and coupons are available for the bus from Gurugram (Gurgaon) to Rishikesh with Laxmi Holidays Pvt Ltd?",
   "I want to book a bus with RSRTC from Dhanera to Barmer.",
   "I want to plan a round trip from Electronic City, Bangalore to Dharmasthala and Kukki, covering nearby famous places, and return to Bangalore.",
   "What are the bus timings from Nagpur to Kolhapur?",
   "What are the bus options from Udupi to Mumbai for 1st November? Please provide details on timings, duration, and fares.",
   "Ok travelling time till Adiyogi statue approx",
   "What is Free Cancellation for my bus booking from Coimbatore to Madurai?",
   "What is the end date for the Travel Ka Murth sale?",
   "Please provide details about your refund inquiry so I can assist you better.",
   "I want to know about any special discounts available for my journey with MAHA BUS from Vijaywada to Vizianagaram.",
   "Show me bus or train options for traveling from Phuket to Krabi on 7.11.25.",
   "Please arrange a call back regarding my query about the MMT trip guarantee voucher.",
   "I want to find bus options for traveling from Sonipat to Sector 85, Gurugram.",
   "I want to know about bus services in Uttar Pradesh.",
   "I want to know the nearest stop for DLF IT Park on the 'Sri SMS Travels' bus route from Thoothukudi to Chennai.",
   "No, I don't want to proceed with Loksewa Travels from Indore to Jabalpur.",
   "The ticket booking option for the bus from Ayoor to Perumbavoor is not complete. Can you help me finalize the booking for this route?",
   "When can I book tickets from Hatia to Badnera for 24 November 2025?",
   "Please apply my promo code for the HRTC Bus journey from Delhi to Chandigarh.",
   "I am not getting the information clearly. Please connect me to customer care for assistance regarding my booking issue.",
   "Where can I apply my gift card for my bus booking with 'Sitara Travels' from Rajahmundry to Hyderabad?",
   "I would like general customer care information regarding my travel bookings from Hyderabad to Tiruppur.",
   "Show me cheap bus options from Bangalore to Gokarna for 23rd August 2025.",
   "I want to download my bus ticket.",
   "Please book my return ticket on the FRESHBUS from Bangalore to Chennai.",
   "I am thinking of booking a ticket for November 7th from Gorakhpur to Kushinagar. I want to see if the trip guarantee option is available for this ticket, but when I click on it, it is not showing the trip guarantee. Can you tell me if there is any issue with the trip guarantee for tickets from Gorakhpur to Kushinagar?",
   "I'm looking for the best luxury bus options for traveling from Ballia to Delhi.",
   "Is there an offer for first-time bus bookings?",
   "Please provide any available promotional codes or offers for a discount on the ticket price for the bus journey from Visakhapatnam to Bengaluru.",
   "I want to travel from Katra to Ahmedabad.",
   "Is there a cancellation fee for my bus booking with 'PP Travels' from Delhi to Khatushyamji?",
   "What is the cost for Free Cancellation with A1 Travels bus from Thiruvananthapuram to Bangalore?",
   "Is the KGN INDIA bus from Bangalore to Chennai on time? I want to know about its punctuality.",
   "I'm having trouble redeeming the coupon code GPAYMMT10.",
   "Mujhe chaubis ki raat ko Delhi Kashmiri Gate se Manali tak bus ki ticket chahiye.",
   "I want to reach Aurangabad by 10 AM on 06 February 2026. Please find me bus options from Pune to Aurangabad that arrive by that time.",
   "What is the cost for free cancellation for Sharma travels bus from Nokha to Bhilwara?",
   "When will driver be assigned",
   "Please provide the bus PNR number so I can check the details for you.",
   "Why is the 25% seat lock option not showing for my journey from Jodhpur to Jharsuguda?",
   "I would like to book a bus from Hubli to Pune.",
   "If I book a return bus ticket, how much discount will I get?",
   "Is there a seat available for ₹300 with extra legroom on the 'INDO CANADIAN EXPRESS (Luxury Intercity Service)' bus from Amritsar to Ludhiana?",
   "What is state tax? It says not included ?",
   "What is the cost for Free Cancellation for the PRM Roadways bus from Chennai to Palakkad?",
   "What are the penalty charges upon cancellation for my bus tickets from Killari to Pune?",
   "I need the contact number for the bus services from Tirupati to Rameshwaram.",
   "What is my nearest bus stop?",
   "pykara falls",
   "When will I receive the driver details for the Journey with Air Indiaa Travels bus from Karur to Mettupalayam?",
   "Send me bus details for traveling from Hyderabad to Tiruvannamalai.",
   "Please provide information on web check-in procedures for your upcoming travel.",
   "Will my ticket from Lucknow to Bhaluwahi be confirmed?",
   "I want to book a ticket for the Adi Gkp Exp (19489) from Ahmedabad to Maihar on 17th October 2025.",
   "I want to know the seat layout for the GK Travels bus from Pilani to Chandigarh.",
   "I wanna cancel ",
   "I want to see the exact route for bus services.",
   "I have not received my trip guarantee premium.",
   "So we can spend the entire amount at once. If we have ₹10,000, we need to spend all ₹10,000 in one go.",
   "What is the cancellation policy for the HRTC bus from Chandigarh to Dharamshala, Himachal Pradesh?",
   "I want to travel to Delhi from Lucknow on 11-08-2025.",
   "I am looking for van services in Sariska.",
   "I need 5 tickets for my travel.",
   "Show me bus options from Bilaspur, Chhattisgarh to Puri for December 17th, 2025.",
   "Show me more options for bike rentals in Goa.",
   "I need to book a front seat on the Sri Sugam Bus from Chennai to Tiruvannamalai, which is priced at 342 Rs. However, I am facing issues as it shows that the seat is not available when I try to book it.",
   "I prefer Non-AC sleeper buses for my journey from Bangalore to Thalassery on 24th January 2026. Please show me both Non-AC and AC options.",
   "If I reach at 11.30 on 6 feb then how much charges ",
   "Yes, I need assistance with understanding how to book my ticket using the voucher for my journey from Jodhpur to Pune.",
   "Which vouchers can I use to get a lower price on my ticket from Sri Kalahasti to Vizianagaram?",
   "Please report the bus cancellation issue to the relevant transport authority or customer service for assistance.",
   "My pickup point for the Aitiana Airwings bus from Kolkata to Siliguri is airport gate 1. I need to travel from Kolkata to Siliguri by bus.",
   "What are the confirmed travel options from Delhi to Lucknow?",
   "I want to book a bus from Lucknow to Noida.",
   "I want to book a bus from Ahmedabad to Malad with toilet amenities.",
   "What are the penalty charges for cancelling my booking on the Sugama Tourist bus from Bangalore to Savanur?",
   "What happens if I cancel a ticket for which I have taken Trip Guarantee?",
   "I want to travel by bus from Sehwan, Bihar to Patna, Bihar on 11th January 2026 without booking online. Can I reach the bus station half an hour before the scheduled departure, get a seat directly, and pay there?",
   "Need adhar link",
   "What is the cancellation policy for the APSRTC bus from Nellore to Mydukur?",
   "Why am I not receiving the OTP on my email?",
   "Please provide information about the TDR file and its purpose in travel bookings.",
   "I want to book 7 tickets for the journey from Kolhapur to Hospet on 12 January.",
   "Process the refund request for booking NCI64463800383382635 for the amount of 1383 INR.",
   "What are the trip guarantee charges for my journey from Mumbai to Delhi?",
   "Is there a cancellation fee for my bus ticket from Hyderabad to Visakhapatnam with 'TGSRTC'?",
   "I would like to know if there is a coupon code available for first-time bookings.",
   "What is the cancellation policy for the India Tours & Travels (GetBookCab) bus from Gurugram (Gurgaon) to Mussoorie?",
   "What is the rating for KAALAI ROADLINKS (KRL) bus from Alapuzha to Bangalore?",
   "I need a bus ticket for an AC sleeper bus from Mumbai to Bangalore for under ₹2,000.",
   "raise tikcet",
   "What is the cancellation policy for the Bajpai Travels bus from Delhi to Shahjahanpur?",
   "When will I receive the driver details for my bus journey with Naik Tours And Travels from Panvel to Goa?",
   "I have not received my ticket for the journey from Jamnagar to Ahmedabad.",
   "I booked an onward bus from Madurai to Chennai.",
   "Yes, I need assistance with my booking from Surat to Delhi.",
   "Please call me on my mobile number 98415 65165 and assist me with the cancellation process.",
   "I am looking for KSRTC bus options.",
   "What discounts and coupons are available for the Manish Travel bus from Pune to Udupi?",
   "Use Jaipur, Rajasthan as the source for the bus from Jaipur to Dharamshala.",
   "I want to break my journey from Kochi to Kolkata. Please find me transportation options that allow for a journey break.",
   "Show me the cheapest bus options from Ambajogai to Pune.",
   "Is there a trip guarantee available for couples in my account?",
   "I would like to rent a car from Atibele to Varkala, picking it up on the night of January 14 at 9 PM.",
   "When did the Trip Guarantee feature change to Alternate Trip?",
   "What is an alternate trip from Kanpur to Deoria? I'm looking for different options or routes.",
   "Please connect me to customer support regarding APSRTC ticket policies, specifically about why double fare is showing for female tickets that are supposed to be free.",
   "I need to book a bus ticket from Bhubaneswar to Kolkata.",
   "I would like to know the morning bus timings from Mangaluru to Mysore.",
   "I want to book a seat beside my friend in U2, which is not a window seat, for the bus journey from Mysore to Pondicherry.",
   "When will I get the driver details for the Journey with Patel Eagle Travels bus from Rajkot (Gujarat) to Nathdwara?",
   "What discounts and coupons are available for my bus journey from Bhubaneswar to Jamshedpur with 'Dolphin tours and travels'?",
   "What discounts and coupons are available for my journey on the IntrCity SmartBus from Indore to Mumbai?",
   "I want to book a KSRTC bus from Majestic, Bengaluru to Haveri, Karnataka.",
   "I want to book a car and driver in Jaipur for exploring the city from November 1st to November 3rd.",
   "I want to see the buses from Ludhiana to Delhi on the 25th of January 2026.",
   "When will I receive the driver details for the Journey with Akash Travels bus from Delhi to Jaipur?",
   "Total amount",
   "Please suggest suitable bus options for traveling from Vadodara to Jambusar Bypass, Bharuch on 30/01/2026 after 3 pm for 3 passengers.",
   "If I book a ticket from Delhi to Muzaffarpur, when will I receive the confirmed ticket?",
   "What happens if my bus with Vaishali Expresso Pvt. Ltd. from Paraspur (Uttar Pradesh) to Delhi is cancelled by the operator?",
   "What is the refund amount I will receive if I choose Free Cancellation for the bus from Bangalore to Mangaluru?",
   "What is the route of the RS Yadav Smart Bus from Delhi to Raipur, Rajasthan?",
   "I want to track my bus from Mettur to Chennai.",
   "Which direct buses are available from Bangalore to Uttarakhand on the 25th of February 2026?",
   "Why is it allowed to book a female passenger seat next to another female passenger on the IntrCity SmartBus from Mumbai to Indore?",
   "I would like to know about the voucher for my bus booking from Vadodara to Pune.",
   "I don't want to know how to apply the coupons for my journey from Munnar to Cochin.",
   "Is there a cancellation fee for the Goldline Super Deluxe bus from Gurugram to Jaipur?",
   "I need to book round-trip bus tickets.",
   "I am not booking my tickets for the APSRTC bus from Vijayawada to Srisailam.",
   "I understand that payment for the bus ticket from Kollam to Munnar must be completed before boarding.",
   "What is the first pickup point for the IntrCity SmartBus service from Bangalore to Chennai?",
   "What is the rent for a car for my trip from Panvel to MTDC Bhandardara on 2nd September at 10 AM?",
   "What discounts and coupons are available for the bus with Manish Travels Private Limited from Bangalore to Karad?",
   "Please tell me about travel options from Jaipur to Nathdwara.",
   "What is the cost for free cancellation for Anand Travels bus from Dharwad to Mumbai?",
   "I am looking for single seat buses from Pune to Mumbai.",
   "Please show me other bus options for my journey from Dindigul to Chennai.",
   "Why is my 2X voucher not acceptable for the same route?",
   "What discounts and coupons are available for Sagar Bus Transport from Ludhiana to Malout?",
   "Show me the available AM bus options from Ajmer to Jaipur on January 9, 2026, focusing on AC class.",
   "I would like to know more about the refund process and any other policies related to the Kumar Coach (Shubham) bus from Ranchi to Allahabad.",
   "Is there a toilet on the 'Ram Dalal Holidays Pvt Ltd' premium bus from Delhi to Ujjain?",
   "I want to know how to write a review for my recent travel experience.",
   "Is there any travel voucher available in my account for my upcoming booking from Haridwar to Patna on 23-10-2025?",
   "What are the cancellation charges for the GoX service from Mumbai?",
   "I want to book a new bus from Jammu to Chandigarh.",
   "I need to find a bus from Chennai to Tiruchendur on the morning of 10 Nov, preferably at 8 AM or 9 AM.",
   "Show me the available bus options from Vadodara to Bechraji.",
   "I need a bus from Chennai to Madurai on 19th October 2026.",
   "I am unable to confirm my bus booking, so I want to talk to customer support.",
   "I'm unable to book because the app is showing an invalid user ID.",
   "Is the trip from Balaghat to Kolkata on 04-10-2025 guaranteed?",
   "Is there a cancellation fee for my bus booking with 'Jyotirling Krupa Travels' from Satara to Thane?",
   "Please provide the route details of the Maharaja Express.",
   "I need to book 8 seats on the OSRTC bus from Kolkata to Puri. Please check the seatmap for specific seat options and availability.",
   "Why is the payment being made late?",
   "What is the premium amount for Free Cancellation (FC) for my trip from Bangalore to Kottayam?",
   "What are the ticket cancellation charges for travel from Kalyan to Kurduwadi?",
   "Why am I unable to book the bus from Tiruchirappalli to Kozhikode now?",
   "Please delete my entire booking history.",
   "I want to book a bus from Poonamallee, Chennai to either RN or Arcade in the afternoon.",
   "Please show me the alternate travel options from Chandrapura, Jharkhand to Puri Junction, Odisha on 20th March.",
   "Is there a cancellation fee for the 'Easy Ride' bus from Howrah to Siliguri?",
   "What are the available coupons for my bus booking with RSRTC from Jaipur to Malpura?",
   "Please connect me with customer care regarding my booking from Jaipur (Rajasthan) to Delhi on 2026-02-05.",
   "Please confirm my booking with SR Tourist for travel from Siruguppa to Bangalore.",
   "What is the cancellation policy for the Assam State Transport Corporation (ASTC) bus from Tezpur to Tinsukia?",
   "I want to add food to my ticket from Sikar to Mumbai.",
   "What bus options are available for Saturday afternoon?",
   "Please kindly give me the customer support number for Jay Bajrang Travels for my upcoming trip from Adalaj to Hyderabad.",
   "No problem I can look for other options ola, uber,24, svari",
   "Show me the free buses in APSRTC to travel from Kakinada to Vijayawada.",
   "Please provide the contact number for Mahadev Travels for my journey from Mumbai to Ajmer.",
   "What discounts and coupons are available for the GSRTC bus from Gondal to Bhuj?",
   "why showing ticket awaited ticketing",
   "The bus operator is not allowing me to choose a unisex seat for my journey from Kannur (Kerala) to Bangalore. Can you help me resolve this issue?",
   "When will I receive information about the penalty charges upon cancellation for my trip from Hubli to Mysore?",
   "Why is free cancellation not showing for APSRTC?",
   "I want to travel from Delhi to Khatoo Shyam Temple in Rajasthan.",
   "If I cancel a trip guarantee ticket, will I receive a refund?",
   "I am returning from Udupi to Hubli and would like to find available buses.",
   "I have not checked for any error messages or issues with my payment method while trying to book a bus from Bangalore to Tarangambadi. Please help me resolve this issue.",
   "What discounts and coupons are available for the Express Line bus from Bangalore to Mumbai?",
   "Yes, I want to claim a refund upon ticket cancellation. Please assist me with the process.",
   "Is my ticket for the CITIZEN TRAVELS bus from Aurangabad to Indore confirmed?",
   "I want to find bus services from Korba, Chhattisgarh to Narayanpur district in Chhattisgarh.",
   "I want to rent a bus from February 5 to February 15. Please provide the source and destination locations.",
   "I want to travel from Delhi to Leh by bus. Please provide details about the bus options, including cost and travel time.",
   "What discounts and coupons are available for my bus journey from Mumbai to Mahabaleshwar with 'Neeta tours and travels'?",
   "I need to find bus transportation options from Pune to Amravati.",
   "I need a bus from Tin Factory to Jubilee Bus Station JBS between 1-2 pm.",
   "What discounts and coupons are available for the TGSRTC bus from Hyderabad to Sathupally?",
   "Why is it showing 3x if it is not applying?",
   "I need to find a bus from Bijapur to Belagavi via Gokak on 21 September 2025.",
   "Why can't I add coupons for the Journey with KSRTC (Kerala) Bus from Mysore to Thalassery?",
   "What discounts and coupons are available for the Laxmi holidays bus from Ayodhya to Delhi?",
   "I would like to know the rating for bus booking.",
   "What are the chances of getting a confirmed ticket from Guna to Haridwar on 24-12-2025?",
   "What is the departure time of the Vande Bharat Express (22310) from Jangipur Road to Kolkata?",
   "What discounts and coupons are available for my bus journey from Jaipur (Rajasthan) to Delhi on 'NueGo'?",
   "What is the cancellation policy for the IntrCity SmartBus from Vijayawada to Chennai?",
   "What are the penalty charges for cancelling the 'KBS Luxury Bus' from Bangalore to Changanacherry?",
   "I want to add Trip Guarantee for my journey from Phaphund to Delhi.",
   "I need to find an AC sleeper bus from Hubli to Bangalore on 30th November (2025-11-30) with a washroom facility.",
   "What is the bus driver number for Laxmi Holidays Pvt Ltd from Delhi to Amritsar?",
   "Mujhe na 17 October ko Chandigarh Junction se Saharsa Junction tak travel karna hai lekin ticket confirm nahi mil rahi SL ya 3E class mein. Aap kuchh alternate ways suggest kar sakte hain?",
   "Please proceed with the cancellation of the booked ticket and check if it is refundable.",
   "Please show me the indirect journey options for traveling from Hyderabad to Guwahati on September 19, 2025, returning on September 24, 2025.",
   "I would like to know about my refund voucher.",
   "I noticed in MakeMyTrip that there's a benefit for Primo bus bookings where I get a free ride after a certain number of bookings. Why can't I see this information?",
   "Show me the available bus options from Lucknow to Prayagraj.",
   "I would like to proceed with the bus option from Palani to Bangalore.",
   "I want to web checkin",
   "What is the cost for Free Cancellation with Fareeda Travels bus from Gooty to Visakhapatnam?",
   "What is the cancellation policy for the DNR Express bus from Hyderabad to Nagpur?",
   "Show me bus options from Kolkata to Neptune.",
   "Provide details about GNWL, including its meaning and significance in the context of travel bookings.",
   "I need to find a bus with a toilet for travel from Chennai to Vellaankani.",
   "I need detailed information about the Shyamoli bus service, including routes, timings, and booking options.",
   "I want to book a sleeper class ticket from Vijayawada to Tirupati on 25 August 2025.",
   "When I enter my username to verify the OTP, I am not receiving the OTP for my email and mobile.",
   "I would like to retrieve my booking details.",
   "I have not received my ticket in the mail. Can you please check the status of my ticket and provide an update?",
   "What discounts and coupons are available for the JAS TRAVELS bus from Hyderabad to Kurnool?",
   "I want get my full refund",
   "What discounts and coupons are available for the Mettur Super Services bus from Salem to Pondicherry?",
   "Please provide live bus tracking information.",
   "I need Yolo bus tracking information from Hyderabad to Nellore.",
   "My mother and father want to travel from Vizag to Secunderabad. Please provide transportation options for 2 travelers.",
   "Stop neem karoli Kaun add karega iska kya extra charges honge?",
   "Please create my account using my IRTC ID.",
   "Is there a cancellation fee for the R.S.Sodha Travels bus from Jaipur to Jaisalmer?",
   "Please add another boarding station for my journey from Kannur to Bikaner.",
   "Show me direct buses from the nearest point to Rajasthan Technical University to Delhi.",
   "I would like to book a vehicle for pick and drop in Dubai.",
   "Mention here all Coupons",
   "Is the NueGo bus from Delhi to Jaipur electric?",
   "Phir mera Pisa ka ky ho ga agar tikat book nhai hu to? Mujhe yeh jaan na hai ki agar mera ticket confirm nahi hua to mere trip ke liye kya implications honge.",
   "Pick-up and drop also",
   "What happens if my bus from Rajkot (Gujarat) to Ahmedabad is cancelled by the operator?",
   "I am looking for Hans Travels bus services.",
   "I cannot see the option for gift cards while booking a bus.",
   "What is the refund amount if I choose Free Cancellation for my Laxmi holidays bus from Katra (Jammu and Kashmir) to Delhi?",
   "Provide detailed information about Zingbus, including routes, booking process, and services offered.",
   "What time does the bus from Jodhpur to Chandigarh by Vijay Tour and Travels arrive?",
   "I am unable to complete my booking. After I book, will you provide customer support?",
   "What are the penalty charges for cancelling the NueGo bus from Perambalur to Chennai?",
   "I want to know about bus services from Chhapra, Bihar to Raxaul.",
   "Yes, I have service issues with the bus.",
   "I would like to see the available female-reserved or single seats for booking on the IntrCity SmartBus from Chennai to Bangalore. I know there is a female single seat currently available on the bus.",
   "What discounts and coupons are available for my bus journey from Pune to Hyderabad on the 'zingbus plus' service?",
   "I would like to know more about the features of Volvo and Primo buses.",
   "Show me additional bus options for travel from Mathura to Khatu.",
   "What is the cost for Free Cancellation for the PRM Roadways bus from Ravulapalem to Tada (Andhra Pradesh)?",
   "What discounts and coupons are available for my bus journey from Gadag to Hyderabad with 'Abhay Tours and Travels'?",
   "I want to understand the discount coupon that was displayed on the first page.",
   "I am planning to travel from Chennai to Varkala with my friends. There are 3 travelers in total.",
   "I would like to proceed with the 'Enclave' lounge for my travel from Delhi to Guwahati.",
   "I want to know about the minimum amount required for pay later options.",
   "Why can't I book a ticket for women on the KSRTC bus from Thiruvananthapuram to Kottayam?",
   "Please connect me to an agent for assistance regarding my booking.",
   "I want to track my bus from Wayanad to Bangalore.",
   "Please provide details about the special features of Primo buses and how they differ from other bus options for a family journey from Delhi to Jaipur.",
   "Show me bus options for my journey from Delhi to Maninadham.",
   "I want to know about the cancellation policy for the GSRTC bus from Bhuj to Ahmedabad.",
   "What is the offer code for Vishwa Travels bus from Latur to Pune?",
   "I want to travel from Chennai to Tiruvannamalai by bus on March 27.",
   "Is there a cancellation fee for my bus booking with 'Jai Vishnu Travels' from Palladam to Singampuneri?",
   "Please connect me to an agent regarding the behavior issue I am facing with the bus.",
   "I cannot add this.",
   "I want to travel from Visakhapatnam to Secunderabad on 08-10-2025 and need 2 tickets.",
   "Is there any ticket available for travel from Dhaban to Dimapur?",
   "I am looking to book a Sleeper class for my journey from Mumbai to Salempur, but the 'Lock Seat' option is not showing.",
   "The voucher you provided is not working.",
   "What is the free cancellation policy for my bus booking from Kanpur (Uttar Pradesh) to Haridwar with 'Samay Shatabdi Travels Pvt Ltd'?",
   "Why is the trip guarantee not being shown to me for my Delhi to Kanpur trip?",
   "I would like to know more about the seating arrangements and restrictions on the Tippusultan Travels bus from Chennai to Kozhikode.",
   "What is the number of the bus driver for my bus journey from Nagda (Madhya Pradesh) to Indore on the 'Ravi Multani Sona' bus?",
   "I want to know about the cancellation policy for the bus operated by 'Aastha Tourist and Logistics' from Mumbai to Nagpur.",
   "Which year model",
   "I am unable to log in as it is asking for a new password.",
   "I prefer a bus from Bhimavaram to Hyderabad on Sunday night after 9:00 PM.",
   "I want to visit Ajanta Caves on 18th February 2026 after visiting Shri Grishneshwar Jyothir Ling and having darshan. Will I need to pay extra for this?",
   "Is there a cancellation fee for my bus ticket from Bangalore to Sindhanur with VRL Travels?",
   "I need to cancel my ticket. Please provide the steps and any required information for the cancellation process.",
   "I am not able to apply for the trip guarantee for my booking.",
   "Please guide me on how to clear my booking history.",
   "What is the cancellation policy for the Journey with Ram Dalal Holidays Pvt Ltd bus from Delhi to Khatushyamji?",
   "Is there a cancellation fee for the BABA GHUISARNATH TRAVELS bus from Raebareli to Gurugram (Gurgaon)?",
   "I would like to speak to customer care regarding my recent booking.",
   "I am looking for Rajahamsa bus services.",
   "Please arrange a call for me to discuss the refund status for my booking, as I have not received the refund yet.",
   "I would like to book a bus ticket from Bangalore to Namakkal after 9:00 AM on November 17, 2025.",
   "What is the free cancellation policy for Royal Travels?",
   "What discounts and coupons are available for the Vihari Travels bus from Hyderabad to Kandukuru?",
   "Since there are no train services available from Valsad, Gujarat to Goa, please explore bus options for my trip from Valsad to Goa from November 5th to November 9th, 2025.",
   "I need to use the same voucher VOMTRAIN3WE78XM5Z for a bus booking with Maa Sharad Bus Service from Omkareshwar to Indore at 21:00 on August 5.",
   "What is the cost for Free Cancellation on the Express Line bus from Durgapur to Siliguri?",
   "I would like a coupon for booking.",
   "I need to book an AC sleeper bus from Borivali to Vadodara that is safe for ladies for the evening of 23 January.",
   "What is the free cancellation policy for my bus journey from Bangalore to Rameswaram with VKV Travels?",
   "What is the cancellation policy for Lokenath Bus Service (CityLink) from Mumbai to Indore?",
   "What are the penalty charges for cancelling the RCT SmartBus from Gurugram (Gurgaon) to Ujjain?",
   "I want to book 3 tickets for the Vande Bharat Express from Chandigarh to Gurgaon on 30-12-2025, but I'm having trouble completing the booking.",
   "I don't want to check the options. Please proceed with the bus selection from Indore to Khandwa.",
   "I am looking to rent a self-drive car in Thrissur.",
   "Please find available private car options for a trip from Pune to Hampi on November 1, 2025, departing at 5:00 AM for 6 travelers.",
   "Where can I get down for my journey from Pune to Purna?",
   "I need a rental car from Aligarh to Delhi on 19th October, to be picked up at 7 a.m. without a driver.",
   "I want a bus ticket from Delhi to Pathankot with FlixBus.",
   "Please take me to the payment gateway for the Leafy Bus from Dehradun to Delhi.",
   "I would like to rent a car from Milan to Munich with pickup on 13th April at 11 AM.",
   "What discounts and coupons are available for the B.R. Travels bus from Ujjain to Nagpur?",
   "Show me bus options for traveling from Indore to Omkareshwar Mandir.",
   "Please use my current location in Chennai to show relevant options for traveling to Pathanapuram.",
   "What is the cancellation policy for the National travels ntsb bus from Mumbai to Bangalore?",
   "Show me bus options for traveling from Thane to Shirdi.",
   "I want to see bus options available today, 17 January 2026, in Malayalam.",
   "I want to know about Rajasthan government bus services.",
   "I want to know if I can board the SBSTC bus at Chaulkhola even though my ticket is booked from Digha, since the bus will start from Digha and Chaulkhola is on the way.",
   "Is there a cancellation fee for the Express Line bus from Kolkata to Varanasi?",
   "Why are the boarding options not showing for my journey from Katihar to Kolkata on 14-10-2025?",
   "What is the cancellation policy for the Oneness Tours And Travels bus from Changanacherry to Bangalore?",
   "Please proceed to book my journey with Safar Express from Delhi to Ujjain using the available discounts and coupons.",
   "I am trying to book a bus with Madurai Pandian Travels from Perambalur to Chennai, but it is asking for at least one traveller's details.",
   "I need to find a bus ticket from Pune to Nagpur.",
   "Please find me pet-friendly bus options for traveling from Hyderabad to Goa.",
   "Request the necessary booking details to proceed with the cancellation process.",
   "What are the cancellation charges for my travel bookings?",
   "When are the tickets eligible for the Trip Guarantee refund?",
   "I want to book a bus for rent for my marriage from Gorakhpur to Delhi.",
   "What is TripAssured for bus? I'm looking for details about this service as it relates to my travel from Hyderabad to Bangalore.",
   "What are the available add-ons for booking?",
   "I am looking for King India bus services.",
   "Is there a cancellation fee for my bus booking with 'Devraj Travels' from Sikar to Jaipur?",
   "What discounts and coupons are available for my bus journey from Latur to Kolhapur with 'Vaibhav Travels'?",
   "I want to book a bus from Chennai to Hyderabad and return.",
   "I need to book a bus ticket from Gulbarga to Bangalore on 17th August.",
   "Is the booking for the IntrCity SmartBus from Chennai to Hyderabad for today?",
   "I need to book three seats from Bhopal to Jalandhar on 14 March 2026.",
   "I want to book an MSRTC bus from Pune to Chatrapati Sambhajinagar.",
   "Yes, I would like to opt for the Free Cancellation add-on for my bus trip from Bangalore to Goa on 18-03-2026.",
   "No, I do not want to proceed with Ram Dalal Holidays Pvt Ltd bus from Surajgarh to Jaipur.",
   "No, I don't need more information about the Trip Guarantee.",
   "I need a discount for the Naveen Tours and Travels bus from Bangalore to Bhubaneswar.",
   "This error is happening again and again. Nothing is working. Please connect me to customer support so I can speak to them and make the booking.",
   "I am unable to book tickets from Jabalpur to Katra.",
   "Is there a cancellation fee for the 'PTC-SkyBus' bus from Ujjain to Kanpur (Uttar Pradesh)?",
   "Please assist the user with the cancellation of their trip by the driver and provide options for rescheduling or alternative arrangements.",
   "I want to know about the cancellation policy for the RSRTC bus from Ringas to Jaipur.",
   "I need help. Can you connect me with a customer support executive?",
   "I am looking for evening Volvo bus options from Haldwani, Uttarakhand to Delhi on 23rd October 2025.",
   "I need trip guarantee tickets from Jaipur to Surat for 3 females and 2 children.",
   "I want to see bus options from Aruppukottai to Hosur for today.",
   "Is there a cancellation fee for the Maan Express and Cargo bus from Bathinda to Ringas?",
   "Please book a bus ticket from Jammu to Sonipat.",
   "Please confirm the pickup from Cochin for my trip to Trivandrum from 16th to 21st November 2025.",
   "Please provide details about the KSRTC Airawat bus from Bangalore to Mangalore, including schedule, availability, and amenities.",
   "I want to cancel my bus booking as I didn't receive it.",
   "Please provide a list of morning buses from Chennai to Pattukkottai on 20 October 2025, including their departure times and fares.",
   "I would like to book a bus from Bengaluru to Kampli on 26th, 27th, or 28th September 2025.",
   "I want to book a confirmed ticket from Mumbai to Mughal Sarai.",
   "I am not receiving the pop-up for part payment.",
   "Yes, I would like to know how to apply for the insurance during my booking for the bus journey with 'New Pal Travels' from Delhi to Amritsar. I want to understand the process for both the ₹15 and ₹18 insurance options.",
   "Search for APSRTC bus options from Nellore to Pamur on October 11, 2025.",
   "I am not seeing the meal option available during the booking process for my journey from Kolkata to Dhanbad on the VANDE BHARAT EXP in AC Chair Car (CC) class. Can you help me find out why meal booking options are not available?",
   "What is the departure time for the KSRTC bus from Tirur to Thrissur?",
   "Myra as a AI you are stupid.",
   "I prefer the bus option for my journey from Hyderabad to Vijayawada. Please provide me with the best low-cost bus options available.",
   "Show me available bus options from Bhandara to Pune.",
   "I am looking for Shivneri bus options from Maitri Park to Pune.",
   "Yes, please connect me with a live agent.",
   "The next button is not working on the FlixBus booking review page for my bus journey from Chandigarh to Delhi. Can you help me resolve this issue?",
   "I want to book 5 tickets through this ID. How can I?",
   "I want to know about the cancellation policy for the bus operated by 'Chouhan Travels' from Indore to Mumbai.",
   "Please connect me to a live agent to raise a complaint.",
   "I need a bus from Hyderabad to Reddigudem on 20th December.",
   "Please provide the current location of the bus.",
   "I want to know about the cancellation policy for the bus operated by 'S R Travels' from Bagalkot to Mumbai.",
   "What is the cancellation policy for the PTC-SkyBus from Lucknow to Nainital?",
   "I want to book a sleeper Vande Bharat from Howrah to Guwahati.",
   "I prefer to start my journey at night. Please find me a Non-AC bus from Chennai to Vaideeswaran Koil on 28 January 2026, with a seater preference.",
   "What are the chances of getting a confirmed ticket for waiting list number 7 from Moradabad to Kolkata?",
   "I'm trying to book tickets from Hyderabad to Mumbai for 26-08-2025, but it's showing 'Oops something went wrong'. Can you help me with this issue?",
   "I would like to know the refund amount if I opt for the Free Cancellation add-on for my bus trip from Madurai to Mysore on 17-01-2026.",
   "I don't want to see the 25% pay option.",
   "What username should I enter for ticket booking or how can I create one?",
   "Is a ticket available from Indore to Lonavala on 26-12-2025?",
   "Please provide information on where the refund amount will be received if a booking is canceled on this portal.",
   "Please provide me with the customer care number for assistance with my voucher issue.",
   "Please confirm my ticket from Nandgaon to Dinapur Nizamat for 22-10-2025.",
   "I want to book a wait-listed ticket with a preference for a specific seat only.",
   "Please arrange a call for assistance regarding my bookings from Jaipur to Dholpur.",
   "I want to book a bus from Haridwar to Tungnath, Uttarakhand for my trip on November 11, 2025. I'm traveling solo and would like to know the available options within my budget of ₹5,000 to ₹10,000.",
   "I don't want to share my location. Can you find me any bus stops near Delhi that go to Sarai Kale, Kotputli?",
   "Show me available buses from Delhi to Mumbai for tomorrow, 29 November 2025.",
   "Please help me with booking a ticket from Jaipur to Mumbai.",
   "What discounts and coupons are available for my bus journey with SRI SVR travels from Asifabad (Telangana) to Hyderabad?",
   "Please find alternative bus options from Delhi to Kanpur Nagar since U.P. Roadways is unavailable.",
   "Show me bus options from Milton Keynes to Northampton on 10th December.",
   "I need to find transportation options from Mumbai to Solapur.",
   "I want to travel by bus from Pune to Akluj.",
   "What is total toll and state tax",
   "Please check the booking status for the ticket I booked and provide the confirmation details.",
   "Where can I get the coupon for the TGSRTC bus from Hyderabad to Srisailam?",
   "Is there a cancellation fee for the APSRTC bus from Aswaraopeta to Hyderabad?",
   "Yes, I would like to proceed with my travel plans from Bangalore to Puttur, Andhra Pradesh.",
   "What discounts and coupons are available for Amar Jyoti Travels bus from Khandwa to Indore?",
   "Show me more transport options for traveling from Bangalore to Hampi.",
   "Is there a cancellation fee for the bus booking with 'Laxmi holidays' from Dehradun to Jammu (J and K)?",
   "I would like to book a trip from Jalna to Thane.",
   "What is the cancellation policy for Bus9 Tours And Travels from Anantapur to Guntur?",
   "If I return at 2:00 AM on 11-02-2026, do I have to pay the complete fare for the next day?",
   "I need to find a rental car from New Jalpaiguri station on 7 November 2025.",
   "I am looking for KSRTC Ayurveda bus booking from Mangalore to Mysore.",
   "What is the Free Cancellation policy for my Paul Travels bus ticket from Ottanchathiram to Tirunelveli?",
   "What discounts and coupons are available for Hans Travels (I) Private Limited for travel from Raipur (Chhattisgarh) to Sambalpur?",
   "Where can I find the Trip Guarantee option for my ticket from Chennai to Rameshwaram?",
   "Will this ticket from Jawaharnagar to Patna be confirmed?",
   "Show me bus options from Ernakulam to Trivandrum.",
   "What does coupon code mean? I want to understand the meaning of coupon codes, especially in relation to the ones I have for booking with Ashirwad Travels.",
   "I want to book a bus ticket from Delhi to Kasol.",
   "I need to find bus options for traveling from Delhi to Jammu.",
   "What does 'partial' mean in the context of the cancellation policy for the bus from Delhi to Lucknow?",
   "Is there a cancellation fee for my bus booking with 'MOR (More) Tours and Travels' from Muramalla to Hyderabad?",
   "Is there bus tracking available for the APSRTC service?",
   "What discounts and coupons are available for Deltin Travels Pvt Ltd bus from Kathua to Delhi?",
   "Will my seat be confirmed or not?",
   "I want to start AC bus services from Delhi to Sirsa and Allahabad.",
   "What is the cancellation policy for the UPSRTC bus from Delhi to Rampur (Uttar Pradesh)?",
   "I want to book a GSRTC bus ticket from Ahmedabad to Rajpipla.",
   "What is the free cancellation policy for the National travels bus from Bangalore to Surat?",
   "What discounts and coupons are available for the Citizen Tours and Travels bus from Mumbai to Hyderabad?",
   "I would like to book a private minibus for 12 travelers from Ahmedabad to Jaisalmer, with pickup on October 18th and returning on October 22nd.",
   "Is there a cancellation fee for the Express Line bus from Kolkata to Digha?",
   "Please find available bus options for my trip from Visakhapatnam to Parlakhemundi, Odisha, and provide details on travel necessities.",
   "What is the cancellation policy for the Swagat Travels bus from Dechu to Jaipur?",
   "What discounts and coupons are available for the Greenline bus from Bhubaneswar to Kolkata?",
   "What discounts and coupons are available for my bus journey from Lucknow to Khatushyamji with 'SHREE SHAKTI TRAVELS AND CARGO'?",
   "I would like to know about the cancellation policy without the Free Cancellation add-on for my bus booking from Vadodara to Nathdwara on 26-01-2026.",
   "I want to book a Zing Bus Maxx from Dharamshala to Delhi for 12th July.",
   "I am looking for buses from Jhunjhunun to Khatu Shyamji.",
   "What is the cancellation policy for Sai Dasari Travels bus from Vijayawada to Hyderabad?",
   "I want to travel by bus at night, around 2 or 3 AM on January 17, 2026.",
   "Please find me buses from Madurai to Chennai for tomorrow, ensuring they have toilet facilities.",
   "We are two travellers ",
   "Is my ticket WL 26 eligible for a 3x refund if it is not confirmed and I am still waiting until the travel date?",
   "I want to know about the cancellation policy for the 'SNR Paribahan' bus from Kolkata to Siliguri.",
   "Provide the user with the steps to download their ticket after booking.",
   "I am planning a trip to Varanasi from the 1st week of March 2026, specifically between February 16 and February 22, 2026, starting from Asansol.",
   "What is the rating for KGN Tours and Travels bus service from Mumbai to Hyderabad?",
   "What is the cancellation policy for Barsana Travels bus from Kanpur, Uttar Pradesh to Raipur, Rajasthan?",
   "Which login should I use?",
   "What is the trip guarantee for my journey from Gwalior to Chalisgaon?",
   "May I know the route map for Ongole?",
   "I would like to check for bus options from Alwar, Rajasthan to Auriya, Uttar Pradesh for 28th November 2025.",
   "We are planning to book 3 tickets from Delhi to Shoranur, but one person is uncertain about traveling. Can we cancel or refund just that one ticket later if needed?",
   "It&#39;s already a month and I have not yet got my refund. I need to check with you all what&#39;s happening. Please connect me to the live customer care.",
   "Is there an alternate plan for my travel from Delhi to Kozhikode on 25-10-2025?",
   "Is there a cancellation fee for the bus booking from Delhi to Rishikesh with 'Laxmi Holidays Pvt Ltd'?",
   "Please provide the bus costs from Bhubaneswar to Nellore on 8th February after 2:00 PM.",
   "Show me the bus options from Kochi to Pondicherry for tomorrow, September 8, 2025.",
   "Why am I not receiving an alternate trip plan for my journey from Hyderabad to Ratlam?",
   "I need assistance from an agent, but no one can contact me.",
   "I can’t seem to see the qr for my lounge access",
   "Please find additional budget-friendly transport options for 6 travelers traveling from Mysore to Chikkamagalur on October 2nd at 11:30 PM.",
   "Please find me a bus ticket from Bangalore to Agumbe.",
   "What are the bus timings from Trivandrum to Kumali?",
   "Inquire about the status of the refund issuance for the user.",
   "Yes, I would like to know about the travel time, facilities, or other details regarding my journey on the GOA EXPRESS from Pune to Goa.",
   "What is the cancellation policy for the Sri KVR Travels bus from Vijayawada to Visakhapatnam?",
   "I will use driver for up and down only not for sightseeing ",
   "Where can I find the download location for my ticket?",
   "I'm looking for bus options from Swargate Pune to a location near Mumbai on 12th October.",
   "Will the car come with carrier? ",
   "I want to book a bus from Banaras to Gorakhpur.",
   "Is there a cancellation fee for the Delta Transports Pvt Ltd bus from Hyderabad to Ernakulam?",
   "What is the cancellation policy for the City Land Travels bus from Delhi to Shimla?",
   "I need to know about offers and coupons for bus bookings with TSRTC.",
   "Please assist me with the cancellation of my bus booking and provide options for alternative travel arrangements.",
   "Please check the status of my refund with reference number 'gotit'.",
   "I am unable to create an account on IRTC.",
   "I am unable to enter the promo code for the GSRTC bus from Anand to Rajkot (Gujarat).",
   "I want to talk to a customer support agent.",
   "I want to book 1 seat with free cancellation for the Durgamba Motors Route No. 54D bus from Shivamogga to Surathkal.",
   "What is the cost for Free Cancellation for the S R Travels bus from Vijayapura to Hyderabad?",
   "I want to know about the 10:30 PM night bus from Pondicherry to Tirupur at the Old Bus Stand.",
   "What is the coupon code?",
   "What is the cancellation policy for the VRL Travels bus from Mumbai to Vijayapura?",
   "What is the free cancellation policy for 'PTC-SkyBus' from Lucknow to Nainital?",
   "What is the variance in the departure time for the Goldline Super Deluxe bus from Delhi to Jaipur?",
   "What is the timetable for the Msrtc Shivshahi bus from Kalyan to Alephata?",
   "I am unable to register for a login ID because the email ID already exists in IRTC.",
   "Okay.",
   "Require wheelchair assistance",
   "I have tried reaching customer support.",
   "I want to book a bus from Coimbatore to Trichy on 21 November 2025.",
   "What discounts and coupons are available for KMS Travels bus from Bangalore to Coimbatore?",
   "I cannot book before talking to a himam",
   "What is the bus fare from Samalkot to Srisailam?",
   "Provide information on how to raise a complaint regarding travel services.",
   "I see that there is a zero cancellation policy for the bus journey from Goa to Mumbai if cancelled within 6 hours. Can you provide more details about this policy?",
   "What is the refund amount if I choose Free Cancellation for the SHARMA TRANSPORTS bus from Pune to Bangalore?",
   "Is a toilet available on the bus from Lucknow to Delhi operated by 'Laxmi holidays'?",
   "What are the penalty charges for cancelling my booking with Kallada Travels (Suresh Kallada) for the bus journey from Thiruvananthapuram to Bangalore?",
   "Provide live tracking details for non-stop buses from Hyderabad to Visakhapatnam.",
   "Why is the premium amount not being charged while booking my trip from Dighwara to Mumbai on 12 February 2026?",
   "Trip guraannty",
   "I need to travel from Sakoli to Pune on 31 December 2025 by bus.",
   "I need to book round-trip bus tickets from Khammam to Bengaluru.",
   "Is the 'Bluecity Bus' from Ujjain to Lucknow a Primo bus?",
   "Will I get a refund of three times if my ticket does not get confirmed due to the fare?",
   "Is my FRESHBUS from Bangalore to Chennai punctual?",
   "I booked 3 ticket but give an alternate number because i booked the tickets for anyone else so i should I cancel",
   "Track the bus from Sindhi Camp, Jaipur to Lucknow on 19 December.",
   "Show me more details about the bus options for traveling from Shirdi to Ajanta Caves.",
   "I need to connect with an agent for assistance.",
   "I'm looking for bus travel options from Anekal to Hyderabad.",
   "I want to book a bus from Mumbai to Nagpur for today, 23 January 2026.",
   "We are three travelers living in Palam, New Delhi, and we need to travel to Agra on the morning of 15th August (Friday) and return on the evening of 17th August around 6 or 7 PM.",
   "My voucher code is not being accepted. What should I do?",
   "I need to book a ticket from Chhapra to Kolkata for tomorrow, 4th December 2025.",
   "I found a confirmed option with available tickets, but when I click to book, it shows as waiting. Can you help me with this issue?",
   "Is cancellation available for the IntrCity SmartBus from Hyderabad to Rajahmundry?",
   "Recommend a bus service from Kodaikanal Road railway station to Kodaikanal, including timings, fare, and booking options.",
   "Show me bus options from Chennai to Coimbatore on October 10.",
   "I want to travel from Howrah to Bengaluru on the 26th of this month.",
   "We need to travel from Bengaluru to Puducherry on 2nd of January 2026 for 3 travelers.",
   "What do you mean by that? I'm seeking clarification on your previous response.",
   "I need a bus from Kudlu Gate to Hubli that is reserved for women.",
   "What discounts and coupons are available for my bus journey from Hyderabad to Kodad with APSRTC?",
   "I want to know about the cancellation policy for the bus operated by NETWORK TRAVELS from Guwahati to Itanagar (Arunachal Pradesh).",
   "Show me all available bus options from Gorakhpur to Lucknow on 28 October 2025, including departure times, travel duration, fare, and ratings, and highlight any changes from the previous list (e.g., SRR Holiday bus not showing).",
   "What is the age limit for children traveling with ShreeKumar Travels from Chitradurga to Mantralayam?",
   "What is the location of Suram bus stop in relation to the bus service from Gokavaram to Hyderabad with Sri Sai Anjana Tours and Travels?",
   "Show me the best coupons available for Sri Tulasi Tours and Travels bus from Vijayanagaram (Andhra Pradesh) to Bangalore.",
   "I want to know about SBST bus options from Bankura to Siuri.",
   "What happened to my refund",
   "What are the cancellation charges for a first-time user if my ticket fare is ₹450?",
   "I need information about buses from Khizrabad, Yamunanagar to Shimla.",
   "Will I get a refund if I book my ticket from Patna to Dimapur using the Alternate Trip option and my wait‑listed ticket is not confirmed?",
   "I want to book a bus from Kota to Delhi on 10 January 2026.",
   "Is there a cancellation fee for the Maaruti Travels bus from Palakkad to Bangalore?",
   "Please assist me with Aadhar authentication.",
   "I want to talk to a customer service advisor regarding my booking from Manali to Chandigarh. My booking is not showing in the MakeMyTrip app, and I have a booking ID if you need it.",
   "Yes, I would like to know more about the fare breakup for my bus journey from Kodad to Hyderabad.",
   "Please proceed with booking a car from Visakhapatnam to Anakapalle for my pickup date of 15-10-2023 at 10:00 AM.",
   "What is the cancellation policy for Kukkeshree Travels bus from Devadurga to Bangalore?",
   "I need to search for a bus from Bangalore to Varkala.",
   "Is there a cancellation fee for the Poonia Travels bus from Delhi to Hanumangarh?",
   "Which bus stop is closer to the FlixBus from Delhi to Haldwani, from Uttar Nagar East?",
   "What happens if I pay the full amount before 29th October 2025?",
   "I want to travel from Nagpur to Kolhapur.",
   "No, I do not want to proceed with Deepak Tour and Travels for transportation from Mehandipur Balaji Mandir to Delhi.",
   "Show me the highest price and booking options for buses from Ahmedabad to Nathdwara on 27 August 2025.",
   "I would like to speak to a customer care representative regarding my booking for a lower berth seat on the bus from Mettupalayam to Bangalore. I am a solo female traveler and need assistance with the gender restrictions and available seating options.",
   "Where is the Kia Quick Pick and Drop Parking located?",
   "What will be the cancellation charge if I cancel my confirmed ticket from Kolkata to Lucknow?",
   "What is my ID number?",
   "What is the cancellation policy for the Sri Vaari Travels bus from Bangalore to Pondicherry?",
   "Which buses are available from Vadodara to Bhuj?",
   "I want to travel from Moga to IGI Airport and I have heard that Vinod Bus Service is good.",
   "I want to speak to an executive now.",
   "Since you have 4 people traveling in an AC luxury 2+2 bus from Ernakulam to Kollur, you should book 4 seats for your journey.",
   "I want to book a TNSTC government bus from Bangalore Majestic to Vellore on 07 February 2026, excluding private buses like RKK or Freshbus.",
   "Investigate why Mishra buses from Sagar to Indore are not visible to the user while others can see them.",
   "I prefer a sleeper seat for the bus from Latur to Solapur on 14th January.",
   "What discounts and coupons are available for Neem Travels bus from Chennai to Kulasekaram?",
   "Please download my booking details.",
   "No I haven’t received my refund",
   "MMTTG not able to apply this coupon for my booking from Delhi to Kolkata. Please help me resolve this issue.",
   "I need 3 tickets.",
   "I want to book a bus from Delhi to Shimla, departing from ISBT.",
   "What time does the Chhapra Express start on 19th November 2025 from Mumbai to Jaunpur?",
   "Show me rental options for the i10 Grand Asta in Pune from January 20th to January 25th.",
   "Is there a cancellation fee for the FlixBus from Chandigarh to Manali?",
   "Which coupon code should I enter for booking tickets from Akola to Pune for 3 travelers within a budget of ₹250?",
   "Please book another ticket for my seat on the Journey with LUCKY TRAVELS Bus from Nellore to Vijayawada.",
   "I believe you are mistaken. The part payment option was never visible on the MakeMyTrip app. I tried it and they only have a full payment option. It seems that after I selected full payment for a booking, the part payment option was removed from my account. Can you please clarify this situation?",
   "I want to book a sleep bus from Gachibowli, Hyderabad to Vijayawada, departing at 10:00 PM on 16 November 2025.",
   "I have a coupon code for RSRTC Smart, the number is 51170000009293. How can I apply it to my booking from Kota to Jaipur by bus?",
   "Show me other bus options from Ernakulam to Chennai.",
   "I want to travel from Pune to Patna. Are there any transportation options available?",
   "I want to travel from Bhubaneswar to Koraput by bus on the evening of 31st August 2025.",
   "Please connect me to customer support regarding ticket confirmation and free cancellation charges.",
   "I want 12 PM buses from Bangalore to Chennai.",
   "Mtlb Vadodara se Kathgodam ki ticket book kar raha hoon, lekin vo confirm nahi hui. Kya main isse 3X refund ka fayda Ahmedabad se Delhi ki bus ticket ke liye le sakta hoon?",
   "Is there a cancellation fee for the Maan Express and Cargo bus from Bathinda to Reengus?",
   "I need to find the fastest bus transport from Kochi, Kerala to Vijayapura, Karnataka.",
   "What about my destination and who requires payment?",
   "Provide information on KSRTC buses from Adoor to Kottayam Medical College, including schedules, duration, and fares.",
   "I am looking for KSRTC bus options from Bangalore to Thripurhi.",
   "No, I do not want to proceed with Maharani Travels from Delhi to Khatushyamji.",
   "Mmt main paisa wapis kaise milega?",
   "What is the contact number for Shree Shivalay Travels bus from Bableshwar to Pune?",
   "I need more help regarding the 'Seat Lock' option for booking tickets from Firozabad to Guwahati in the MakeMyTrip app. Can you check if this option is available?",
   "Tell the status",
   "What is the refund amount I will receive if I choose Free Cancellation for my bus booking with Dolphin tours and travels from Bhubaneswar to Patna?",
   "Show me the female seats available on the KBS Luxury Bus from Chennai to Bangalore as I am a solo female traveler.",
   "When can I expect to receive information about the charges for the caravan rental?",
   "If two people come, will the bus fare be ₹1,50,000? I need to confirm the bus fare for two travelers from Vadodara to Ajmer on 4th January 2026, as I was informed that the fare is ₹1500 for both.",
   "Will the Tegra Express bus arrive in Muzaffarpur from Delhi?",
   "What is the refund amount I will receive if I choose Free Cancellation for the Svkdt travels bus from Visakhapatnam to Hyderabad?",
   "What discounts and coupons are available for CVR Travels bus from Bangalore to Bhubaneswar?",
   "Show me the steps to add Alternate Trip (Trip Guarantee) during the booking process from Chottanikara to Chennai.",
   "Is there a cancellation fee for the 'Prasanna - Purple Bus' from Kolhapur to Hyderabad?",
   "What is the cancellation policy for the IRA TRANSPORTS bus from Karimnagar to Bangalore?",
   "Is there a 30% discount available for the first booking?",
   "I need to find bus options for traveling from Bengaluru to Channarayapatna on August 24, 2025.",
   "I am looking for buses from Mumbai to Shivnari.",
   "I want to know the arrival time in Khajuraho if I start my journey from Bhopal at 8:30 AM on February 26, 2026.",
   "Process a refund request for booking reference JCRW8H.",
   "I want to know about good government bus options for traveling from Bangalore to Tirupati.",
   "I need to find a ticket from Manwat Road to Vasco da Gama, Goa.",
   "I don't have a debit card either. Can you provide me with an offer code that doesn't require a card?",
   "Show me bus options from Patna to Vapi for travel on 3rd or 4th December.",
   "If I book this ticket from Vadodara to Ajmer for 21-10-2025, will it be confirmed?",
   "What happens if i use digi yatra",
   "I want to change the date of my bus from Nashik to Latur on 29 August 2025.",
   "I need to find a bus from Kolkata to Digha.",
   "Please find any available bus options from Jodhpur to Varanasi.",
   "I want to know about today's ticket availability from Nagpur to Surat.",
   "What discounts and coupons are available for my bus journey from Dehradun to Chandigarh with 'NueGo'?",
   "I want to know about the cancellation policy for the bus operated by 'Saini Travels Pvt. Ltd.' from Nagpur to Ujjain.",
   "Which bus service from Manali to Delhi offers the best rest stop with clean facilities?",
   "If I book a ticket from Mangalore to Kalyan on a trip guarantee basis, will I get a 100% confirmed ticket?",
   "What time do the buses from Jammu to Kishtwar operate on 04 August 2025?",
   "What time do buses leave from Bangalore to Chennai today?",
   "What is the cancellation policy for the Shyamoli Paribahan Pvt Ltd bus from Bangalore to Ernakulam?",
   "What is the cancellation policy for Sri Tulasi Tours and Travels bus from Hyderabad to Bhubaneswar?",
   "I want to book a bus from Bangkok DMK airport to Pattaya.",
   "Is there a cancellation fee for the bus with Ram Dalal Holidays Pvt Ltd from Katra (Jammu and Kashmir) to Chandigarh?",
   "I would like to proceed with booking bus tickets from Mangalore Pampwell to Bangalore Mekhri Circle.",
   "Please find bus options available to travel from Kolkata to Sher Bengal River Resort, Kolaghat on 30th November 2025.",
   "Why is the ticket not being booked for the Ashirwad Travels bus from Hyderabad to Bilaspur (Chhattisgarh)? I need to know the reason for the booking issue.",
   "What discounts and coupons are available for the Dolphin travel house bus from Mumbai to Pune?",
   "Show me buses from Udakisunhanj to Patna.",
   "Is it allowed to travel with 2+1 children on 'BHAGWATI TRAVELS' from Mumbai to Surat?",
   "Show me the details for the bus option from Hyderabad to Tirupati.",
   "They are not connecting with me",
   "I want to book a ticket for today for the journey from Noida to Allahabad with KVS Holidays Bus.",
   "I want to book 2 tickets from Hyderabad to Manmad for 18 November.",
   "I can't apply the return trip deal for the Journey with SRS TRAVELS Bus from Udupi to Bangalore. Please assist me in resolving this issue.",
   "Journey hours ",
   "Why is my ticket not booking for Sri Kumaran Travels from Chennai to Madurai?",
   "I need assistance with ticket booking for cancer patients traveling from Muzaffarpur to Varanasi on September 28, 2025.",
   "Please provide the details of my last booking.",
   "Request the status of the refund for the cancelled booking with reference number NF1KS6U9VFAOYU085321.",
   "I want to use the MMTBLACK promo code for a 200 rupees discount.",
   "Is there a cancellation fee for the Ashok Bus Service from Delhi to Faizabad?",
   "I want to know about the cancellation policy for the bus operated by Tippusultan Travels from Perinthalmanna to Chennai.",
   "I want to rent a car from New Jalpaiguri to Siliguri for my honeymoon.",
   "What is the luggage rule for buses?",
   "I need to find a bus from Namsai to Itanagar that can carry my bike.",
   "Is there a cancellation fee for my bus ticket from Balehonnur to Bangalore with 'Sugama Tourist'?",
   "I do not have a GST number and need assistance regarding my travel from Firozpur to Varanasi.",
   "What is the cancellation policy for the Ram Dalal Holidays Pvt Ltd bus from Rupnagar to Delhi?",
   "Why is the 'next' button not working on the bus review page for my journey from Vrindavan to Ayodhya on the 'RS Yadav Smart Bus'?",
   "I want to travel to Bhubaneswar by bus from Kolkata.",
   "I want to book a ticket today from Jalandhar to Mathura with Shri Krishna Travels.",
   "you suggest me the places ",
   "I have a question about the age of kids for the Journey with KBS Sree Garuda Bus from Cuddalore to Hosur.",
   "I would like tips on preparing my pet for travel from Pune on September 12, 2025. Please include advice on ensuring my pet's comfort and safety during the journey.",
   "Provide detailed information on booking a battery-operated car at Delhi station platform number 3 for 2:30 PM.",
   "ok thanks ",
   "Proceed with booking the Gujrat Mail for my parents from Mumbai Borivali to Ahmedabad on the night of 25th October 2025, ensuring the tickets are under the trip guarantee.",
   "What are the other charges for Rathimeena Travels A bus from Kumbakonam to Chennai?",
   "Suggest me any steps to travel from Goa to Ballarpur.",
   "What is the ticket fare for bus booking?",
   "I will send you my booking ID.",
   "I need the ticket details for a bus from Veraval to Mahuva for 1 traveler. I don't want to know about other policies or details for my journey.",
   "I received a reservation confirmation invoice with booking and invoice details that do not belong to me. Please guide me on how to resolve this issue and what steps I should take to correct it.",
   "I want to know about buses from Bangalore to Kerala that provide courier service.",
   "What is the cost for Free Cancellation with Shatabdi Travels bus from Dehradun to Kanpur?",
   "Update to business class",
   "Is a GNWL status of 18 considered good?",
   "Is there a monthly limit for the Travel Guarantee plan? I want to know if the 3X plan is limited to only 5 tickets monthly.",
   "I need to attach my car to MakeMyTrip as a driver.",
   "I want to know about bus options to visit Somnath, Dwarka, and other tourist places from Adipur. Please provide me with the best bus options available for this journey.",
   "Is there any extra charge for Free Cancellation on my bus booking from Indore to Jaipur, Rajasthan?",
   "What is the fare for buses from Dharamshala to Delhi today, 04 January 2026?",
   "I want to know the cancellation and modification charges for this booking",
   "What discounts and coupons are available for the Bhakti World Travels Blue Bird bus from Udgir to Pune?",
   "If my bus is cancelled by the operator and I opted for Trip Assured, how much compensation will I receive?",
   "Please assist me in booking a wheelchair assistant for my upcoming travel.",
   "Is there a door to close for booking the seats on the bus from Muzaffarpur to Ayodhya for 2 travelers? We are looking to book 2 seats on the Samay Shatabdi Travels bus.",
   "What discounts and coupons are available for the APSRTC bus from Hindupur to Vijayawada?",
   "I want to create a new ticket from Jasidih to Kamtaul.",
   "Yes, I would like to know how to apply the available coupons during my booking with Shree Mokambika Travels for my journey from Kundapur to Mumbai.",
   "Track buses on the Amritsar to Chandigarh route for the date 23-01-2026.",
   "I want to find the best bus options for traveling from Chennai to Vellore.",
   "Please provide me with details of my booking history.",
   "When later",
   "I am unable to book a ticket for the bus. The ticket is not allowed, and I received a message saying, 'Sorry! We could not process your query. Please try again later.'",
   "Why is the bus not going to Vijayawada? I need details about the bus from Mysore to Vijayawada on 2025-11-22.",
   "I want to travel from Srinagar to New Delhi on the lowest budget on January 24, 2026.",
   "Is there a cancellation fee for my bus booking with 'PRINCE TRAVELS' from Delhi to Amritsar?",
   "I mentioned 'Prtc', but it seems to be an invalid destination. Can you help me find a valid destination or provide options based on my preferences?",
   "Will I receive confirmation for this ticket, or can it be canceled at the last moment?",
   "Is there a cancellation fee for my bus booking with 'Neelkanth Travels' from Aurangabad to Nashik?",
   "I need customer support regarding my booking issue.",
   "Please find alternative bus travel options from IIT Tirupati to Ooty for 17th October 2025, as the user is looking for different transportation methods.",
   "My 3x trip guarantee coupon is not working for my travel from Chhindwara to Bhatinda.",
   "What is the range for local sightseeing in Mahabaleshwar from Navi Mumbai on February 13th to February 14th, 2026?",
   "What discounts and coupons are available for the Bihar state road transport corporation (BSRTC) bus from Patna to Bettiah?",
   "Provide detailed information about the Synbuzz App for travel from Chennai to Chidambaram.",
   "What discounts and coupons are available for JOLLY BUS SERVICES from Bangalore to Goa?",
   "Mujhe 4600 ka coupan mila th ",
   "I'm experiencing a glitch on the KKaveri Travels review page; it's not directing me to the payment page even though all the details are correct.",
   "What discounts and coupons are available for the KSRTC (Kerala) bus from Thodupuzha to Thrissur?",
   "Please provide some alternative travel options to reach Gangasagar from Dharmatala, considering that there are currently no bus services available.",
   "What are the confirmed options for travel from Kharagpur to Mysore?",
   "I want to search for sleeper buses from Chikhli, Buldhana, Maharashtra to Bandra, Mumbai on 18th January 2026.",
   "What is the cost for Free Cancellation with GST Travels bus from Kanigiri to Hyderabad?",
   "Why is my discount code not working?",
   "I want to know the total payment required for a sleeper class ticket from Hyderabad to Muzaffarpur on 16 February 2026.",
   "I want to plan a day trip by bus from Lucknow to Vrindavan on January 2, 2026.",
   "What is the cancellation policy for the GO BUS from Hyderabad to Eluru?",
   "What discounts and coupons are available for my bus journey with SRS TRAVELS from Mudhol to Bangalore?",
   "Please provide the bus stops for Venkateswara Travels between Bangalore and Tiruppur.",
   "While making the payment, the price breakdown and the final amount for the Trip Guarantee is showing only ₹1500. Does this mean that only one ticket will be covered under the Trip Guarantee? I am booking 5 tickets together through a trip guarantee option, and I want to know if all tickets will be covered under the trip guarantee or only one ticket.",
   "I need to find bus packages for my trip from Bangalore to Tirupati.",
   "I need to find bus travel options from Hyderabad to Odisha.",
   "Is there a bus stop at Samara Gurudwara in Ludhiana for the INDO CANADIAN® EXPRESS?",
   "Please provide the reviews and rating details for the best-rated bus operating from Nagpur to Indore on Sunday.",
   "I'm having trouble booking a ticket from Bengaluru to Guwahati with a 25% discount. Can you help me with this?",
   "I would like to make a booking with MSRTC for my travel plans.",
   "Please continue with the current date for the bus journey from IGI Airport to Phagwara on 31 January 2026.",
   "Where can I get tickets for 'PPM Travels' from Akola (Buldhana) to Nashik?",
   "We want to visit Kodaikanal and return to Madurai within 1 day on 7th February. Please provide an itinerary that includes transportation options and places to visit.",
   "I am looking for OSRTC buses from Sonepur to Cuttack.",
   "What discounts and coupons are available for my Sarayu Travels bus from Palasa to Hyderabad?",
   "Is there a cancellation fee for the B.R. Travels bus from Jaipur (Rajasthan) to Bhopal?",
   "I want to book a Shikara ride in Alleppey.",
   "I would like to know how to book my ticket with the Alternate Trip (Trip Guarantee) feature for my journey from Bhuj to Mumbai.",
   "Is there an AC bus available for the journey from Mumbai to Katradevi?",
   "What is the refund amount if I choose Free Cancellation for my bus booking with Laxmi holidays from Kurukshetra to Jalandhar?",
   "I cannot use the MMTGPAY coupon.",
   "Will I get a personal three times refund under the Trip Guarantee?",
   "What is the cancellation policy for the Journey with UPSRTC Bus from Bareilly to Lucknow?",
   "Please assist me with my booking refund issue, as my booking was not refunded.",
   "What discounts and coupons are available for the HRTC bus from Dharamshala (Himachal Pradesh) to Delhi?",
   "Show me direct buses from Karur bus stand to PSG Tech in Coimbatore.",
   "What discounts and coupons are available for my bus journey from Karwar to Mysore on the 'Sugama Tourist' bus?",
   "We are 3 adults and 2 kids so what will be total fare for one side gurgaon to mathura",
   "Why is the code MMTDEAL not working for my booking?",
   "Provide information regarding the trip guarantee related to the user's booking.",
   "Is Toilet available on the zingbus Maxx for my journey from Delhi to Manali?",
   "What is the ticket price from Bhubaneswar to Chilikidara?",
   "I want to know about APST bus options from Guwahati to Itanagar.",
   "I am looking for buses from Vit Chittoor bus stand to Majestic, Bangalore.",
   "Please help me find alternative transportation options in Bhutan.",
   "Please check the status of my refund request and provide an update on why it hasn't been sent yet.",
   "Yes, I would like to know more about the Primo bus service from Jammu to Delhi.",
   "What is the cancellation policy for the APSRTC bus from Bangalore to Tirupati?",
   "What is the cancellation policy for Shri Abinesh Roadways bus from Bangalore to Mysore?",
   "What is Free Cancellation for the Mahalaxmi Travels bus from Kathgodam to Uttar Pradesh? How much do I pay to get Free Cancellation?",
   "I want to book a bus from Pune railway station to Chhatrapati Sambhajinagar.",
   "What is the cancellation policy for the White Gold Travels bus from Kozhikode to Kilimanoor?",
   "What are the penalty charges for cancelling my booking on the 'Greenline' bus from Kolkata to Bhubaneswar?",
   "Is there a bus available from Nagercoil to Vella Kani Church?",
   "What is the cancellation policy for Sai travels Chembur bus from Mumbai to Shirdi?",
   "What is the cancellation policy for the PTC-SkyBus from Lucknow to Indore?",
   "Please confirm my ticket from Bengaluru to Mangalore for 17-10-2025.",
   "Show me bus options for traveling from Mumbai, Andheri East to Tulja Bhavani Temple.",
   "What are the bus charges from Kathua to Amritsar?",
   "Will the UPSRTC bus leave on time at 8:12 AM from Lucknow to Hardoi? It takes 6 hours to reach Hardoi, so why is the bus leaving so early?",
   "I got a coupon from MMT worth ₹3800, and I'm using ₹2400 for one ticket. Can I use the remaining amount for a different ticket on MMY?",
   "Show me bus options from Moradabad to Gorakhpur.",
   "I need to complete the booking for the last awaiting bus from Mettur to Mettur.",
   "What discounts and coupons are available for my bus journey with National Travels from Udumalpet to Chennai?",
   "I want to change my destination from Srisailam to Chennai for my journey from Hyderabad, and I need to add a stop in Pondicherry.",
   "I want to travel from Noida Sector 66 to Jalalpur Ambedkar.",
   "I want to travel from Kanpur bus stand to Agra ISBT to visit the Taj Mahal.",
   "Will trip guarantee confirm my ticket?",
   "Is the MMTGPAY coupon offer sold out for the Krishna Enterprises bus from Amalner (Jalgaon) to Pune tomorrow between 6 PM to 9 PM?",
   "Will I receive a refund upon cancellation for the Ashok Travels bus from Noida to Shahjahanpur?",
   "Please provide guidance on how to redeem my voucher.",
   "I am looking for cheap and best bus services from Mangalore to Whitefield, Bangalore.",
   "I am unable to use an e-voucher from MakeMyTrip. I've checked the terms and conditions, but I'm still facing issues.",
   "I want to book a bus from Piduguralla to Hyderabad.",
   "What is the cancellation policy for JSR Bus Tours & Travels from Nekarikallu (Andhra Pradesh) to Hyderabad?",
   "Is there a cancellation fee for KNT Travels bus from Bangalore to Coimbatore?",
   "What is the arrival time of the sleeper bus from Pune to Chandigarh?",
   "What is the cancellation policy for the ADTC tour and Travels bus from Amritsar to Delhi?",
   "Is there a 100% refund policy available for the SRI VINAYAKA TOURS AND TRAVELS bus from Madikeri to Bangalore?",
   "What discounts and coupons are available for PALSLNT Travels from Chennai to Madurai?",
   "I want to know about the travel guarantee option for my ticket on 06 September.",
   "I'm looking for alternative bus stops from Veraval to Mumbai for my journey.",
   "I'm unable to redeem my gift card number 1001131149372302 for my bus booking tomorrow. I only see the option for an Amazon gift card.",
   "Is Free Cancellation available for my bus journey from Delhi to Ujjain?",
   "Is there a 6-year-old ticket or free travel available for my journey from Chennai to Katpadi on 12 February 2026?",
   "I need to book a car service from Kolhapur to Akkalkot and then from Akkalkot to Solapur on 24/10/25.",
   "luggage",
   "I want to book a ticket for the Ltt Cbe Express (11013) from Bengaluru to Karur on 2025-09-02.",
   "I want to visit Mysore and stay one night there during my trip to Coorg from Bangalore.",
   "Is there a cancellation fee for the bus with Shri Krishna Travels from Lucknow to Khatushyamji?",
   "Kya 3X refund ya wallet mein credited refund bookings par lagu hote hain jo is process se kiye gaye hain? Mera ticket Howrah se Raipur ke liye hai aur main refund process ke bare mein jaanana chahta hoon.",
   "Please assist me in canceling my tickets for Goa and Mumbai.",
   "My user ID is shishira§2004.",
   "What is the cancellation policy for the Journey with SL Travels Bus from Kadapa to Vijayawada?",
   "I want to travel by bus from Kolkata to Udaipur.",
   "What are the washroom facilities available on the bus?",
   "I need information about mini buses from Ananthapur to Wayanad.",
   "Is there a cancellation fee for the UPSRTC bus from Gorakhpur (Uttar Pradesh) to Azamgarh?",
   "Provide detailed information about Vande Bharat sleeper class transportation, including features, amenities, and any other relevant details.",
   "I would like to know more about ticket booking options and waiting list statuses.",
   "Track the bus from Hyderabad to Karad.",
   "I can't use my trip guarantee amount for my travel plans. Can you help me understand why?",
   "Please find me direct bus options from Allahabad to Ayodhya.",
   "I have not received the refund",
   "I want to know if my ticket from Jaipur to Bareilly is in waiting or confirmed before making the payment.",
   "I want to lock the 25% booking for my Sleeper Class ticket from SMVT to Howrah, but I am unable to do so. Please assist me with this.",
   "What discounts and coupons are available for Gayatri Travells bus from Hubli to Bangalore?",
   "Please provide the price for a 6-seater car for a round trip from Beeramguda to Karimnagar.",
   "What is the logic behind the guaranteed seat for my ticket from Ajmer to Mumbai?",
   "I need a bus ticket from Trichy to Palasa",
   "I need information about bus services available for travel.",
   "I need to find bus travel options from Kalaburagi to Gova for my trip to Govardhan.",
   "Where can I find the gift card option for the bus service?",
   "I want to book a bus ticket from Dandeli to Bangalore on 30th November using a gift card.",
   "What is the cancellation fee for a bus from Bangalore to Hyderabad?",
   "I want to know about the Trip Guarantee for my booking.",
   "Please confirm the ticket for the Sou Pune Exp (12150) from Cheeoki to Pune on 02 Dec.",
   "What happens if the operator of 'Ashoka Travels' cancels the bus for my journey from Miraj to Pune?",
   "The bus from Amritsar to Haridwar is very poor. Can you help me find better options for this route?",
   "I need details about my trip car.",
   "Please connect me with a customer agent.",
   "What discounts and coupons are available for the APSRTC bus from Bangalore to Vijayawada?",
   "I need to arrange a full bus for group travel from Chennai to Palani for 40 passengers, departing on 21st November 2025 and returning on 23rd November 2025.",
   "Is there a cancellation fee for my bus booking with 'SHARMA TRANSPORTS' from Bangalore to Chennai?",
   "What is the premium cost for Trip Assured today?",
   "I want a single berth option in the upper seat for the bus from Rudrapur to Ayodhya with 'Vijay Tour and Travels'.",
   "Initiate the booking process for a trip from Kolkata to Raipur on 14 Jan 2026 using an e-coupon.",
   "What discounts and coupons are available for the Just Bus service from Delhi to Gorakhpur?",
   "I am searching for a car from Shimla to Chandigarh.",
   "I want a carrier at the top of my vehicle for luggage",
   "Is there a cancellation fee for my bus booking from Thrissur to Kattappana with KSRTC (Kerala)?",
   "I want to know the details about the ticket waiting list for my upcoming travel plans.",
   "What is Free Cancellation for bus from Greater Noida, Uttar Pradesh to Prayagraj?",
   "What discounts and coupons are available for the National Travels CHN bus from Tirunelveli to Chennai?",
   "I am looking for non-AC buses from Calicut to Ernakulam for today evening.",
   "What are the penalty charges for cancellation of the ARTC TOURS AND TRAVELS bus from Nagpur to Ahmedabad?",
   "I need to find a bus from Avinashi to Coimbatore for tomorrow, 23rd October 2025.",
   "Tell me about the itinerary for the Maharajas' Express.",
   "What is the free cancellation policy for the 'SAAM BUS' from Bangalore to Kalamaserry?",
   "Is there a cancellation fee for the Sethi Yatra Company bus from Gorakhpur (Uttar Pradesh) to Bharatpur?",
   "I need assistance regarding Rupali Patidar. Can you provide more information or options related to her?",
   "What is the coupon for the bus?",
   "Where can I redeem my voucher?",
   "I want to book a bus from Akalkot to Mumbai on 2025-10-05 for 2 travelers. Please provide the exact route and details for the bus service.",
   "Please connect me to customer support regarding my refund status for my bus booking.",
   "I want to book bus tickets from Bangalore to Tirupati for next Friday, 19 September 2025.",
   "I need a barah seater tempo traveler from Jaipur to Vaishali Nagar with a pickup time of 6:00 AM on 19/01/2026.",
   "i wish to reschedule my booking",
   "What is the cancellation policy for the GSRTC bus from Rajkot (Gujarat) to Somnath?",
   "I want to book a bus ticket from Tirunelveli to Vellore.",
   "When will I get the driver details for the Journey with KRT Travels Bus from Devakottai to Chennai?",
   "Mujhe Lucknow se Delhi ka ticket karna hai kal ka, 26th October 2025.",
   "What discounts and coupons are available for Milan Travels bus from Kota (Rajasthan) to Bikaner?",
   "What is the free cancellation policy for the Jain travels registered bus from Jodhpur to Kanpur (Uttar Pradesh)?",
   "I want to book 3 tickets at one time from Andhirampara to Kolkata.",
   "Will I receive the ticket fare only, or will I also get the extra amount I paid under the Trip Guarantee to book my ticket if I cancel it?",
   "Is there a cancellation fee for the Mahanayek Bus Service from Barasat (West Bengal) to Haldia?",
   "When will I receive the driver details for my journey with FlixBus from Delhi to Ujjain?",
   "Your 3x refund service is like fake. I want to understand why it seems that way and what options I have for a refund from Jalgaon to Bhopal.",
   "I will total payment 2735",
   "Please find bus options from Kadapa, Andhra Pradesh to Coimbatore on 8th October.",
   "What is the policy if my Vikas Travels Jaipur bus from Khatushyamji to Gurugram (Gurgaon) is cancelled by the operator?",
   "What are the seating options available for female travelers on the 'Sai Baba Bus Service' from Cuttack to Visakhapatnam?",
   "What discounts and coupons are available for the bus service Raj Ratan Tours And Travels from Indore to Pune?",
   "Which I write in name.",
   "I want to book an AC and TV bus from Ayyampettai to Kilambakkam for an onward journey.",
   "What is the phone number of Maharani Travels bus from Jaipur to Delhi?",
   "What is the bus service from Patiala?",
   "Where can I find the option to select the Seat Lock feature for my ticket on the KAVIGURU EXP from Jharsuguda to Kharagpur tomorrow?",
   "What is the bus number for the Dahod to Jaipur route?",
   "I want to talk to an agent about transportation from Varanasi to Ayodhya.",
   "Is there a cancellation fee for the VRL Travels bus from Pune to Ankola?",
   "What is the pick-up point for the bus from Pune to Goa?",
   "Which is closer to Sector 69, Subhash Chowk or Rajeev Chowk?",
   "What discounts and coupons are available for my bus journey with A1 Travels from Bangalore to Kayamkulam?",
   "Yes, I would like to know more about how the 3X refund works for the Alternate Trip (Previously known as Trip Guarantee).",
   "I want to file a TDR for my Varanasi trip as I paid 880, but the transaction was canceled and my money was deducted.",
   "I have a query about my bus.",
   "I want to travel from Mumbai to Bengaluru.",
   "i have no idea of the pondychery places need help here",
   "What are the penalty charges for canceling my ticket with Manish Travels Private Limited for my journey from Haveri to Bangalore?",
   "Where is my 3x in the ticket from Bhopal to Gondal?",
   "Is there a cancellation fee for the Manish Travel bus from Mumbai to Mangaluru?",
   "Will my ticket get confirmed? I opted for the '3X Refund' and I want to know if my wait-listed ticket will be confirmed or if I will receive a refund.",
   "I want to travel to Bihar by bus. Please provide me with available options.",
   "Please confirm if the Naveen Travels bus departing at 12:00 PM from Mumbai to Nashik has a women-only seat option available for booking.",
   "Update my ticket booking to change my meal preference from vegetarian to non-vegetarian.",
   "Show me the 9 PM sleeper bus from Hyderabad airport to Vijayawada on 2025-09-06.",
   "Will it conform?",
   "What discounts and coupons are available for the OSRTC bus from Nabarangpur to Visakhapatnam?",
   "I am trying to book a ticket for the 'Omkar Darshan Aryaman Travels' bus from Indore to Omkareshwar, but the payment option is not active.",
   "I am looking for KSRTC bus options within Karnataka.",
   "I want to travel from Kochi to Varkala.",
   "I want to know about the bus options from Berhampore to Purulia.",
   "I have just booked a ticket. Can you provide me with the details of my booking and any next steps I should take?",
   "Will a 3 WL ticket in 1 AC get confirmed for my journey from Jammu to Bareilly on 06 Feb 2026?",
   "Please arrange a call with an executive regarding the Trip Guarantee.",
   "Is there a cancellation fee for the NueGo bus from Chandigarh to Gurugram (Gurgaon)?",
   "What discounts and coupons are available for the Vijay Tour and Travels bus from Jammu (j and k) to Ratangarh?",
   "What places will be covered during the sightseeing in the round trip package from Agra to Jaipur?",
   "What is Trip Guarantee?",
   "Is there a cancellation fee for my bus booking with 'Shree Swami Travels' from Dhule to Ahmedabad?",
   "Is there a cancellation fee for the B R Travels bus from Anand to Bangalore?",
   "I want to book a ticket from Nimach to Bhopal.",
   "I want to make a payment for my bus booking with GreenLine Travels And Holidays from Raichur to Bangalore.",
   "Is there a cancellation fee for the chartered bus from Neemuch (Madhya Pradesh) to Indore?",
   "What is the estimated time of arrival for my refund?",
   "What is Free Cancellation for bus from Gurugram (Gurgaon) to Haridwar?",
   "What discounts and coupons are available for Yadav Travels bus from Vadodara to Somnath?",
   "Why is my refund being delayed",
   "I want to rent a car in Goa, picking it up at 15:00 on 17 October after arriving from Pune.",
   "I want to know about trip guarantee for my ticket from Kishanganj to Bhagalpur.",
   "Why are Lakshmi Holidays buses not showing up for me?",
   "Please provide information on alternative transportation options from Delhi to Kerala.",
   "I want to confirm my ticket from Warangal to Agra.",
   "Is there a cancellation fee for my bus booking with 'GGR TRAVELS' from Coimbatore to Tiruchirapalli?",
   "What is the policy if my bus with SHREE SHAKTI TRAVELS AND CARGO from Jaipur to Delhi is cancelled by the operator?",
   "Need my travel date",
   "Show me the best coupons available for Jabbar Travels bus from Bangalore to Nellore.",
   "What is TripAssured for bus?",
   "Show me transport options from Sarwate Bus Stand in Indore to the MPPSC office.",
   "I would like to know how to book a wait-listed ticket with the Alternate Trip (Previously known as Trip Guarantee) offer from Chengannur to Hyderabad.",
   "I want to book bus tickets from Coimbatore to Tirumala Tirupati for my mom and dad.",
   "Please confirm if the buses from Surat to Mumbai provide live location tracking during the journey.",
   "Show me buses from Jammu to Chandigarh.",
   "Please assist me with the payment for my cancelled ticket, as I have not received it in my account yet.",
   "Provide details for the Shivneri bus service from Mumbai to Pune.",
   "Why am I not eligible for the new user coupon code for booking a bus from Hyderabad to Bhadrachalam?",
   "Please confirm my booking so that I can download my ticket.",
   "What is the refund amount I will receive if I choose Free Cancellation for the bus with PADIKKAL TRAVELS PRIVATE LIMITED from Guruvayoor to Bangalore?",
   "I want to know about today's journey from Mumbai to Parbhani on 22nd January 2026.",
   "Show me bus options from Kamareddy to Hyderabad.",
   "I want to find bus options from Rajendra Nagar to Indore Dhakkan Wala Kuha on 17-11-2025 at night.",
   "Show me the available buses from Delhi to Katra, Jammu and Kashmir for 5th August 2025.",
   "Show me only the Primo buses available from Hyderabad to Bengaluru on 23 Jan 2026 with a sleeper seat preference.",
   "Is there a cancellation fee for my booking with Rathimeena Travels from Bangalore to Cuddalore?",
   "Please check the confirmation status of my trip and provide any updates regarding why it has not been confirmed yet.",
   "I need help discovering destinations for my bus travel. I'm not sure where to go yet, so please provide some suggestions.",
   "Please provide me with comprehensive details about the Swiss Travel Pass, focusing on its advantages, current pricing options, and the steps I need to follow to purchase it.",
   "I need a bus for a family group traveling onward with 4 travelers.",
   "Shirdi temple ",
   "I want to use the Trip Guarantee feature, but it's not working. The first page shows adding Trip Guarantee, but when I go to the payment section, an error occurs. Can you help me resolve this issue?",
   "Please connect me to a customer support operator regarding modifying the date of my chartered bus ticket from Indore to Kishangarh.",
   "Please book my 2 tickets.",
   "Why is my booking process for Sri Vaari Travels from Vellore to Pondicherry not proceeding further?",
   "I would like to proceed with the bus selection from Katpadi (Tamil Nadu) to Ooty with Shri Bhagiyalakshimi Travels (MAARA).",
   "Please arrange a call with an executive regarding bus bookings.",
   "The trip guarantee option is not available on my account.",
   "Provide information on whether a ticket is necessary for a 5-year-old child traveling in 3E class on the Gorakhpur Express from Anand to Ujjain.",
   "Show me all available bus options from Yelhanka to Jammalamadugu for today, including departure times, duration, and fare.",
   "What discounts and coupons are available for my bus journey with Krish Travels from Tiruchirapalli to Coimbatore?",
   "Please provide details about my ticket, including the booking reference and any specific information I need to know.",
   "What discounts and coupons are available for the MAHA BUS from Visakhapatnam to Bangalore?",
   "In the name of Chahat Saini booked",
   "Please find bus options for traveling from Gorakhpur to Agra.",
   "I want to book a ticket from Kota to Akbarpur, Basti, Sultanpur, Lucknow, Khalilabad, or Azamgarh on 17 October 2025.",
   "Main kahan click karna hai, yeh mujhe samajh mein nahi a raha hai.",
   "I have booked a ticket from Chandigarh to Delhi on the 19th of November 2025. Please confirm the details and any additional information I might need for my trip.",
   "I have filled all the details for the bus journey from Harihar to Hyderabad, but the booking is not being accepted.",
   "I want to talk to a customer care person regarding my cancelled ticket from Pune to Jaipur. I am a senior citizen and I have already explained my situation multiple times, but I keep getting asked the same questions. Please connect me with someone who can assist me.",
   "Is there a bus option available from Hyderabad to Ranchi on 14 March 2026?",
   "So not to call make my trip",
   "Is there a cancellation fee for the bus with Raj Ratan Tours And Travels from Pune to Indore?",
   "My coupon's expiry date is September 29th. Can you help me understand why it's not valid for my booking with MakeMyTrip?",
   "I am looking for luxury bus options from Amravati to Pune.",
   "What discounts and coupons are available for my bus journey from Hyderabad to Visakhapatnam with 'VARAHI TRAVELS'?",
   "I want to book my ticket from Bengaluru to Patna for 07-09-2025, but please ensure I get a middle seat.",
   "Please find bus options for traveling from Shahjahanpur, Uttar Pradesh to Udaipur, Rajasthan on December 25, 2025.",
   "I want a 5-star bus from Bangalore to Mumbai.",
   "I'm looking for the bus driver number for my journey from Surathkal to Bangalore.",
   "Provide information on how to apply for a frequent flyer program.",
   "What is the free cancellation policy for my bus booking with 'Madhavi Travels' from Kollam to Mahe?",
   "What discounts and coupons are available for the GSRTC bus from Rajkot (Gujarat) to Vadodara?",
   "Pls confirm my ticket",
   "Is the price shown for the round trip from Dimapur to Kaziranga National Park correct? It's showing a different price than expected.",
   "What is the seat lock-in feature for my booking from Dehradun to Patna on 29-12-2025?",
   "Please provide information on confirmed seats available after 6 PM on 28 October 2025 for my journey from Delhi to Mumbai. I want all waiting seats to be allocated in one car.",
   "Will our ticket from Abhaipur to Delhi be confirmed?",
   "What is TripAssured for the Journey with UPSRTC Bus from Lucknow to Kanpur? Also, can you confirm if the bus is an AC seater?",
   "I need to find a confirmed ticket from Guwahati to Dhanbad.",
   "I want to book a ticket for the 7th of January from Nagpur to Lalitpur.",
   "I need to book 2 tickets on the Sanvi Travels bus from Bangalore to Mantralayam, including a separate ticket for my 8-year-old child.",
   "Please find bus options from Kannur or Payyanur to Bangalore on December 12, 2025, excluding Arya Travels.",
   "Show me the available discounts or offers for my booking from Bangalore to Gwalior.",
   "Yes, please tell me how to apply the available coupons for my journey with VEE VEE BUS from Salem to Kutralam.",
   "ticket na ban paye to main dusra bana lu",
   "Is there a cancellation fee for my bus ticket from Bangalore to Pune with 'Shyamoli Paribahan Pvt Ltd'?",
   "I want to understand alternate trip plans from Mumbai to Bhokar.",
   "I can't log in to my office account to access my bus ticket booking ID NU911591148711516.",
   "I need to find bus tickets from Tup to Bangalore.",
   "Please send me alternative route plans for traveling from Vizianagaram to Guwahati on 11-10-2025.",
   "Is my ticket from Mumbai to Guwahati confirmed for 26-09-2025?",
   "The phone number of my assigned driver is switched off.",
   "I want to book a bus from Kashmir to Gulmarg.",
   "I was available 5 minutes ago, but the MMTTG promo is still not working.",
   "I want to book 3 tickets from Jammu to Ujjain.",
   "What is the refund amount I will receive if I choose Free Cancellation for my bus booking with Deltin Travels Pvt Ltd from Katra to Delhi?",
   "Show me Primo buses from Gurgaon to Jaipur with live tracking.",
   "Please provide the different departure times of the Madhur Express from Lucknow to Jaipur on November 16, 2025.",
   "I read that booking a bus ticket for the third time is usually free.",
   "Is there a cancellation fee for my booking on the Krishna Travels Airavat bus from Pune to Latur?",
   "I'm frustrated because I'm not able to use the voucher code. Can you help me resolve this issue?",
   "What discounts and coupons are available for the WBTC (CTC) SHYAMBAZAR - DIGHA VIA- ESPLANADE (AC-VOLVO) bus from Kolkata to Digha?",
   "Show me bus options from Ashok Nagar, Hyderabad to Bantumilli for tomorrow, 25 September 2025.",
   "Oh no",
   "I want to make a 25 percent payment for my travel from Khammam to Delhi.",
   "I want to book a ticket from Vijayawada to Vishakapatnam in an AC sleeper bus.",
   "I want to know about the cancellation policy for the Yolo Bus from Bangalore to Tirupati.",
   "Please connect me to an agent for assistance with obtaining a quotation invoice for the above tour with price bifurcation.",
   "I wanted to correct the name on ticket",
   "I want to use my voucher for my ISS journey from Kalyan to Janghai on 23-11-2025",
   "I am unable to select a seat for the Metrolink Tours and Travels bus from Chennai to Karur.",
   "What is the cancellation policy for the Ram Dalal Holidays Pvt Ltd bus from Chandigarh to Kasol?",
   "My sister was born in 2017. Does she need a ticket for the bus from Allahabad to Khatushyamji?",
   "Why am I unable to book the ticket for the Journey with IntrCity SmartBus from Pune to Mumbai, even though it shows availability?",
   "What discounts and coupons are available for the Shree Mokambika Travels bus from Kumta to Pune?",
   "Where does the driver sleep during the trip?",
   "What is the refund amount I will receive if I choose Free Cancellation for my New Royal Travels bus from Ambikapur to Kondagaon?",
   "What is the cancellation fee if I cancel my ticket 1 day before travel with EMPIRE TRAVELS?",
   "What discounts and coupons are available for the bus service INDO CANADIAN TRANSPORT CO from Chandigarh (Punjab) to Delhi Airport?",
   "What is the status of the canceled bus?",
   "I would like to rent a vehicle for 8 hours in Mumbai.",
   "Please proceed with booking the sleeper bus from Udaipur, Rajasthan to Merta City, Nagaur.",
   "What discounts and coupons are available for the Highway Star Travel and Cargo bus from Allahabad to Nagpur?",
   "If I want to see minaksh temple in this tour",
   "This is first time I&#39;m facing this issue",
   "What are the bus coupons available for the Journey with Kaveri Travels Bus from Hyderabad to Eluru?",
   "I need to apply the voucher code to both tickets.",
   "Please provide detailed information about E vouchers, including their benefits, usage, and how to obtain them.",
   "What discounts and coupons are available for the bus service GRV Yatrikha LLP from Mysore to Vijayawada?",
   "I need to find a 14-seater vehicle for a round trip from Coimbatore to Madurai.",
   "Is there a cancellation fee for the Shree Siddhivinayak Travels bus from Ballia (Uttar Pradesh) to Delhi?",
   "Show me bus options for traveling from Patna to Rajgir.",
   "Will I receive a confirmation message or email after my booking?",
   "What happens if my waiting list ticket doesn't get confirmed?",
   "Is the 3X refund for the Alternate Trip based on the base price of the ticket, or is there a specific voucher amount involved?",
   "I need to book a bus from Bangalore to Tiruvannamalai on 12 January 2026.",
   "I am traveling with a 3-year-old baby on the bus from Ahmedabad to Veraval with 'Madhuram Travels'.",
   "What is the bus fare from Shiliguri to Krishnanagar?",
   "Please provide the contact details for the Shymoli bus that is departing from Bangalore to Hyderabad on November 18, 2025, with a boarding point at Silkboard Skoda showroom, scheduled to arrive at 6:45 PM.",
   "What are the penalty charges for cancelling my journey with FlixBus from Chennai to Bangalore?",
   "I need a bus from Hyderabad to Tiruthanni on 03 February 2026.",
   "What discounts and coupons are available for the BSS Cool Cool Travels bus from Ambala (Haryana) to Pathankot?",
   "Refund status",
   "Is there a cancellation fee for the Neeta Tours & Travels bus from Mumbai to Ahmedabad?",
   "Insurance claim for delay",
   "I would like to know more about the cancellation process for A1 Travels, specifically regarding the fees and conditions for cancellations.",
   "Please cancel",
   "I need to link my Aadhar before I can proceed with booking my ticket. How can I do that?",
   "I need to book a Verna car for my wedding from Hapur to Meerut on 8 April 2026.",
   "Please provide the driver details for the Punchiry Travels and Holidays bus from Bangalore to Thiruvananthapuram.",
   "I need to book a ticket.",
   "What discounts and coupons are available for the APSRTC bus from Kuppam to Anantapur?",
   "What is the cancellation policy for the APSRTC bus from Visakhapatnam to Razole?",
   "I only want to make a booking.",
   "Suppose I stay 2 days so it will cover in 3090 fare?",
   "The promo code is not working for my travel from Koraput to Bhubaneswar. Can you help me resolve this issue?",
   "What is Free Cancellation? I want to understand how it works and what it includes, especially regarding the refund policy.",
   "I can’t do it",
   "I want to know about Zingbus Max ticket.",
   "Why can't I get the MMTGPay coupon code?",
   "I want to book a bus ticket from Tirupur to Chennai.",
   "I want to book a round trip on the FlixBus from Bangalore to Hyderabad.",
   "Rent a car from Jaipur to Udaipur on December 31, 2025, pickup at Jaipur and drop off at Udaipur.",
   "I want to book tickets for the Statue of Unity.",
   "I need a car to travel from Kolhapur city to Pune for 2 travelers, with some luggage and small pets.",
   "What are the charges for a 9-year-old passenger traveling from Mumbai to Rewari?",
   "Is khajjiar sightseeing included ?",
   "We only want a car for our Kerala trip from Trivandrum to Kovalam, Poovar, Varkala, Jatayu Earth Station, Alleppey, Thekkady, Munnar, and Kochi for 6 days starting on December 24, 2025, for 2 travelers.",
   "I need assistance regarding my bus that did not arrive at my destination. Please help me understand the next steps I should take.",
   "Please confirm if an additional payment is required for your booking confirmation.",
   "Please provide the list of stops for the Avantika Express.",
   "I want to rent a car from Patna to Mahakaleshwar in Ujjain.",
   "What discounts and coupons are available for my bus journey from Hyderabad to Mumbai with 'Bharat Tours and Travels'?",
   "Where is your office in Moga so I can buy a ticket directly from there?",
   "The driver did not show up.",
   "Use Kharagpur, West Bengal as the source to find bus schedules for the route from Kharagpur to Dantan.",
   "I prefer a seater seat for my bus journey from Kurnool to Madanapalli on 11 January 2026.",
   "Please provide the information in Hindi.",
   "I want to travel from Indore to Jaipur.",
   "I want to book 2 tickets from Kolkata to Siliguri on 24-12-2025.",
   "Please provide the available Volvo sleeper bus options from Delhi to Dharamshala for 6 travelers.",
   "I'm looking for bus options from Jaipur to Srinagar.",
   "What happens if my bus with Anand Ashray Travels from Pune to Goa is cancelled by the operator?",
   "i am singal person and and i have 4 bag",
   "What are the chances of confirming a 1st AC ticket in GNWL 4 from Delhi to Ranchi?",
   "Is there any availability for couple seats on the bus from Bangalore to Ankola?",
   "Which bus should I board to reach Sanwariya Seth Mandir from Lucknow?",
   "I want to travel by bus from Nagpur, Maharashtra to Alibaug, Maharashtra on 10th February. Please search for available bus options.",
   "What discounts and coupons are available for the City Land Travels bus from Yamuna Nagar to Jammu (j and k)?",
   "I am looking for Volvo bus options from Chandigarh to Gurugram.",
   "Show me 3rd AC tickets for the Konark Express from Pune to Puri on December 7th for 10 adults.",
   "Will the ticket get confirmed for the journey from Pune to Gorakhpur on 21-10-2025?",
   "Is there a confirmed chance for RLWL 5 in 2nd AC from Mancherial to Lucknow on 18-10-2025?",
   "I want to book a tempo from Ernakulam to Munnar.",
   "It's my first time booking a bus, and the LIGHTNING coupon code is still not working for my trip from Bhopal to Savner. Can you help me resolve this issue?",
   "What discounts and coupons are available for the WBTC (CTC) HABRA - BAKKHALI bus from Kolkata to Bakkhali?",
   "What is the route from Prayagraj (Allahabad) to Jhansi?",
   "What is the confirmed option for my ticket bookings?",
   "stop in between",
   "I want to book a 3rd AC ticket for my journey from Hajipur to Delhi on 08 Mar 2026.",
   "Please provide the details of buses from Chandigarh to Manali on 27th January 2026.",
   "I have to use my voucher within how many days?",
   "What is the cancellation policy for the Grand bus from Bhubaneswar to Kolkata?",
   "Please provide detailed information about the Kalosonal bus, including its routes, schedule, and any other relevant details.",
   "I can't book buses with my gift card.",
   "I have a sleeper voucher code, but I want to know if I can use it for an AC booking from Ahmedabad to Rajahmundry, because my voucher is not being accepted.",
   "Process the user's request for a refund for their booking.",
   "So, I do not need to pay the road toll for my journey from Mumbai to Pune?",
   "What is the free cancellation policy for my bus booking with 'Patel Travels (Surat)' from Mumbai to Vadodara?",
   "Summarize my booking",
   "I am looking for even cheaper cab options for my drive from Kota to Jhalawar on 11 January 2026 at 12:00. The cab should have a roof carrier and the starting location is the bus stand.",
   "What is the weight limit for luggage on Sri Keerthana Sai Travels? I'm traveling from Bangalore to Visakhapatnam.",
   "I want to book a ticket from Swargate, Pune to Panjim, Goa.",
   "Show me the available bus operators for the route from Chennai to Athirampattinam.",
   "Is there a drop point near Shimla for the zingbus Maxx from Delhi?",
   "Investigate the issue preventing the user from seeing their booking on their mobile device.",
   "What discounts and coupons are available for the WBTC (CTC) KARUNAMOYEE - DURGAPUR - ASANSOL (AC Volvo) Banglashree Express bus?",
   "What is the cancellation policy for the Kallada Travels (Suresh Kallada) bus from Hyderabad to Thamarassery?",
   "Provide details for KBS Luxury bus service from Chennai to Bengaluru.",
   "I would like to explore bus options for my trip from Chennai airport to Puducherry on 12-10-2025 at 06:30.",
   "I would like to book a Swiss pass.",
   "I am unable to use my promo code.",
   "What is the price for the tickets on Lalbagh Express from Bengaluru to Ambur?",
   "Proceed with the booking for the Mahindra Thar to Calangute Beach, and please confirm the pickup date.",
   "I have raised name correction request",
   "Show evening departure AC buses from Ahmedabad to Mysore on 23 Jan 2026.",
   "I am unable to set my username.",
   "I would like to know more about the cancellation policy and other add-ons for the SVR Tours and Travels bus from Hyderabad to Aluva.",
   "I need to book a Cruze from Mumbai to Lakshadweep.",
   "What discounts and coupons are available for the Prasanna - Purple Bus from Pune to Goa?",
   "What is the cancellation policy for the Goga Sikotar Travels bus from Dwarka to Ahmedabad?",
   "I want my e ticket",
   "I want to find a bus from Lalgarh railway station to Nokha, Rajasthan.",
   "I urgently need a sleeper ticket from Old Delhi to Surat.",
   "I am looking for Vistadome tickets from Mumbai to Goa for my trip between September 10th and September 16th, 2025.",
   "What are the penalty charges if I cancel my bus ticket from Hyderabad to Chennai with Vikram Travels?",
   "I would like to know how to book a wheelchair for my upcoming travel.",
   "What do I need to do to book a ticket for the bus from Ahmedabad to Shirdi?",
   "Please show me buses from Bangalore to Chennai on October 27th.",
   "why convince fee?",
   "What is the cost for Free Cancellation for the Bharathi Travels bus from Chennai to Mangaluru?",
   "What is the cancellation policy for the Pooja Travels bus from Nagpur to Hyderabad?",
   "Process wheelchair request for both passengers due to knee pain problems.",
   "Please assist me in canceling my reserved ticket.",
   "Why is the MMTTG code not working while showing 3x refund on the SL class ticket and also showing a confirmed option?",
   "My vehicle is not getting attached in Makemytrip.",
   "What discounts and coupons are available for me for the Warsi Travels bus from Delhi to Azamgarh?",
   "I would like to book a window seat for my journey from Kuttippuram to Chottanikara on 29-12-2025.",
   "Please help me unblock my bus seat that got blocked after I navigated back from the payment option.",
   "I would like to know how to apply the WELCOMEMMT coupon for my booking from Rudrapur to Karnal.",
   "Show me the availability for a bus ticket on the 17th of November from Kalamboli to Bangalore.",
   "Yes, I would like to know more about the ticket confirmation process.",
   "The coupon code MMTGPAY is not expired, but it still isn't working. Can you help me understand why?",
   "Is the Express Line bus from Chilakaluripet to Berhampur a Primo bus?",
   "I need information about online platform tickets for various modes of transport.",
   "Yes, please proceed with the new search parameters: pickup location Gawchibowli, Hyderabad, drop location Srisailam, and add Mallikarjun Temple as a stop after Srisailam.",
   "Show me the available buses from Delhi to Rudarpur.",
   "I am looking for buses from Patna, Bihar to Madhepur on 14th January.",
   "Where can I find buses from Bhopal to Mumbai?",
   "SEND TICKET",
   "Yes, I would like to know more about the booking process or other details for my trip from Hyderabad to Mumbai.",
   "Please tell me how to create an R City ID and how to make a passport.",
   "Which bus has available coupons or discounts for my trip from Khammam to Hyderabad?",
   "I want to rent a car from Dehradun to Mussoorie from 25th February to 1st March.",
   "I'm looking for bus options from Vishakha to Hyderabad.",
   "I need help booking a bus ticket from Bangalore to Thodupuzha.",
   "Please find me alternative bus options from Pathankot to Chandigarh for 12 August 2025, ensuring that there are seats available for both a male and a female passenger together.",
   "Please check the availability and book Fulucnamavexpress tickets from Secunderabad to Rajahmundry for 21st September.",
   "No, I don't want to proceed with A1 Travels bus from Coimbatore to Chennai. Please find me alternative bus options for this route.",
   "Please provide the available bus options from Kolhapur to Chandratal.",
   "Yes, I would like to know more about the amenities available on the SABARMATI EXP from Ujjain to Varanasi.",
   "Show me bus options from Delhi to Tirupati for the next month.",
   "I am unable to proceed with my bus booking due to a technical error.",
   "Please guide me on how to customize my booking to increase the expected kilometers for my trip, as the included kilometers are currently fixed at 288.",
   "the link shared on whatsapp is just opening to the MMT home page",
   "What discounts and coupons are available for the APSRTC bus from Bangalore to Nandyala?",
   "I want to request a voucher.",
   "Mmt gift vouchers",
   "There is a discrepancy in the distance, so I want to talk to customer support.",
   "Provide detailed information about the bus options from Delhi to Gorakhpur on 1st December, including timings, duration, and fares for each bus service.",
   "What discounts and coupons are available for Sai Ganraj Travels bus from Talebazar to Mumbai?",
   "I would like to know about the luggage policy for the bus journey from Jamnagar to Andheri East.",
   "Is this ticket from Katra to Sawai Madhopur a 3x refund ticket?",
   "I want to book 2 AC 2 Tier tickets on the Dbrg Rjpb Exp from Dimapur to Guwahati for tomorrow around 10 am.",
   "Since you have your own car, I will provide you with recommendations for drivers available for your trip from Rudrapur to Haldwani at 10:00 AM today.",
   "I need an onward bus from Thalassery, Mahe, Kannur, or nearby places to Panvel or Mumbai.",
   "I want to travel by bus from Dehradun to Moradabad.",
   "Will GNWL WL 41 confirm?",
   "What are the bus model details for Mettur Super Services from Bangalore to Chennai?",
   "My MMTGPAY is not functioning properly.",
   "I would like to know about the Vande Bharat Express for my journey from Siliguri to Darjeeling on 20 March 2026.",
   "I need assistance in finding my bus owner's phone number, even though I don't know the pickup point.",
   "Show me bus options to Ujjain.",
   "Show me available bus options from Chennai to Bangalore.",
   "What is the cancellation policy for the Journey with Vijay Roadways Bus from Kolkata to Dhanbad (Jharkhand)?",
   "Ok. Can you provide me with the details on how to apply the available discounts and coupons for my bus journey from Bailadila to Hyderabad?",
   "Is there a cancellation fee for the NTC Nagpur Travels bus from Hyderabad to Katra?",
   "What is the cancellation policy for the Shree Krishna Travels bus from Siliguri to Balurghat?",
   "I want to book a bus from Solapur that departs in the morning and reaches Mumbai by 06:00 AM, traveling via Panvel, Belapur, CBD, and Washi. Please show me the available options for this route.",
   "I need a confirmed ticket for my journey from Prayagraj (Allahabad) to Durgapur on 18-10-2025. I don't want to discuss cancellation options; I only want information about getting a confirmed ticket.",
   "I am looking for KBS travel options from Tiruvannamalai to Hebbal, Bangalore under ₹500.",
   "What time does the Ashok Travels Mandsaur Group bus start from Mathura to Indore on October 7th?",
   "If I book a ticket from Kalyan and board from Manmad, will it be valid for my current booking?",
   "Is there a cancellation fee for the New Golden Travels bus from Indore to Satna?",
   "I want to find an MSRTC bus from Medha, Satara to Beed.",
   "I want to know about Slipr for my journey from Vadodara to Dwarka on 14-10-2025.",
   "What is the status of my date change request for my booking?",
   "Why doesn't the code for the KSRTC (Kerala) bus from Thiruvananthapuram to Muvattupuzha work?",
   "Is there a special deck for placing my luggage on the B R Travels bus from Bangalore to Palanpur, or do I need to manage it below my seat?",
   "I want to book a bus with RSRTC from Jodhpur to Udaipur on 02 November 2025.",
   "Is there a cancellation fee for the APSRTC bus from SriKalahasthi to Bangalore?",
   "What is the cancellation policy for the Yolo Bus from Delhi to Rishikesh?",
   "What are the penalty charges for cancelling my bus booking with 'SBM TRAANSPORT' from Chennai to Kaliakkavilai (Tamil Nadu)?",
   "Please confirm a ticket for the Pavan Express from Kalyan Junction to Madhubani on 22nd February.",
   "I want to know about SETC bus.",
   "I am trying to select a lower berth seat at the driver's cab side for one female traveller on a bus from Delhi to Varanasi, but it shows that at least one male traveller is required.",
   "What is the free cancellation policy for my booking on the 'ISHTA Bus' from Hyderabad to Shirdi?",
   "I want to go on a trip from Chandigarh to Mathura and Vrindavan.",
   "I need to find a bus from Delhi to Khutar.",
   "Please provide specific details about the voucher you are inquiring about so I can assist you better.",
   "I want to find bus options from Tirupati to Amravati for my journey on 7th September.",
   "Show me bus options for transport in Shimla.",
   "I need assistance with linking my Aadhar to my IRTC account.",
   "Show me the available Vande Bharat express options from Delhi to Mumbai.",
   "Is the booking for my trip from Vasai to Hyderabad on 24-11-2025 guaranteed?",
   "I need to find a bus from Ajmer to Vadodara on 17 August 2025, specifically between 2 PM and 6 PM.",
   "I want to book a 13-seater bus.",
   "Show me the bus options from Cuttack to Kolkata on 14 December.",
   "What discounts and coupons are available for the TGSRTC bus from Kurnool to Hyderabad?",
   "Show me other bus options for the route from Delhi to Ludhiana.",
   "I need to find a bus from Katai to Swargate bus stop for my trip to Pune.",
   "What discounts and coupons are available for my bus journey with Rapti Travels from Delhi to Balrampur?",
   "What discounts and coupons are available for the Safar Express bus from Udaipur to Delhi?",
   "Please provide information about train and bus services from Roorkee to Delhi. I want to know the options available for traveling from Roorkee to Delhi using either train or bus.",
   "I want to speak to a customer support executive now regarding my issue with the MMT bus gift card.",
   "Why is the Alternate Trip feature not applying to my booking? The Trip Guarantee feature was showing, but it seems like it’s not applying now.",
   "Show me bus options for traveling from Ludhiana to Chandigarh.",
   "What are the toilet facilities available on the Hans Travels bus from Rajnandgaon to Nashik?",
   "Kindly share the details of my trip guarantee.",
   "I would like to know more about the booking process for my small dog's ticket to travel with me in a first AC coupe from Bhubaneswar to Hyderabad on 16-10-2025.",
   "What is the full address of the Anand Vihar pickup point for the bus from Delhi to Mussoorie?",
   "Is that comes inside the charge",
   "I want to know about the cancellation policy for the bus operated by 'Shri Sai Travels - Laxmi' from Sinnar to Thane (Maharashtra).",
   "Show me bus options from Aizawl to Guwahati.",
   "What is the cost for Free Cancellation for the JBT TRAVELS bus from Hyderabad to Pondicherry?",
   "I am looking for HRTC buses.",
   "Please give me my refund back. I have cancelled it via make myvtrip app",
   "What discounts and coupons are available for ARK TRAVELS for a trip from Bangalore to Hatti (Karnataka)?",
   "I want to know about Zingbus for my onward journey.",
   "Please provide the link for bus details from Chennai to Bangalore for a night pickup on 12 Sep.",
   "I want to talk to an agent from MakeMyTrip.",
   "I need a wheelchair for my parents traveling to Chennai from Chandigarh.",
   "I would like to book the direct bus option from Dharwad to Mysuru for ₹812.",
   "I heard about your offer for a free trip after completing 4 trips with the same bus, but I can't see it.",
   "I want to book an MSRTC bus from Aurangabad to Shivaji Nagar, Pune.",
   "What is the cancellation policy for the Journey with FlixBus from Jalandhar to Chandigarh?",
   "I need to track my bus. Can you provide me with the current status and location of my bus?",
   "Please provide more details about the bus option for traveling from Thane to Mahabaleshwar.",
   "What is the cancellation policy for the Kaveri Travels bus from Hanuman Junction to Nellore?",
   "What is the refund amount I will receive if I choose Free Cancellation for the Golden Temple Express Volvo bus from Delhi to Amritsar?",
   "Show me bus options for transportation from Pune to Aare Ware Beach.",
   "What is the charge for kids on the bus from Mumbai to Ajmer with Mahadev Travels?",
   "My coupon is mmtweekend.",
   "What is the extra charge of ₹889 below the ticket price for my confirmed ticket from Wadi to Rajkot on 02 Feb 2026?",
   "Please find me a bus that departs at 8:00 AM from Panvel to Alibaug.",
   "I would like to rent a full‑day car from Ramoji Film City on 22 January at 10:00 AM to visit Charminar, Golconda Fort, Shilparamam Lake, and Birla Mandir in Hyderabad.",
   "Please provide details on how to book a service on an hourly basis.",
   "I want to talk to an agent regarding my travel plans from Samastipur to Bikaner, specifically starting from Samastipur and ending at Lalgarh.",
   "Yes, please help me regarding my bus journey from Palej to Ambaji with GSRTC on January 20, 2026.",
   "Is they pick up us from our residence ",
   "Please show me the available travel options from Madurai to Kodaikanal on September 30, 2025, using the bus.",
   "Please find late-night bus options from Lakshman to Alambagh, Lucknow, specifically around 4-5 AM.",
   "I am unable to book the FlixBus from Bangalore to Ernakulam.",
   "Request a refund for my Indigo booking.",
   "Provide information about the Vande Bharat Express service from Navi Mumbai to Trimbakeshwar.",
   "If my ticket has been canceled, how can I use the trip guarantee payment I made, and how long is it valid for?",
   "What discounts and coupons are available for my bus journey from Tiruchendur to Coimbatore with 'SPS Travels India'?",
   "We have 3 additional pick ups and drops in Pune",
   "Is the bus from Berhampur to Bangalore by Shyamoli Paribahan Pvt Ltd scheduled for 9:20 AM or 9:20 PM?",
   "Please provide details about the amenities available on the Pune Bhuj Exp (11092) for the AC sleeper class.",
   "Is the bus from Diamond Tours and Travels from Ernakulam to Bangalore a Primo bus?",
   "They don’t pick up",
   "I would like to know more about the bus amenities and cancellation policy for the TGSRTC bus from Kurnool to Hyderabad.",
   "I need bus service details from Delhi airport to Delhi railway station.",
   "Where can I find buses from Bangalore to Assam?",
   "What is TripAssured for bus bookings from Jaipur to Mohali?",
   "Refund full amount",
   "I would like to request 3 new tickets for the trip from Kalyan to Gorakhpur.",
   "What discounts and coupons are available for the KSRTC (Kerala) bus from Palakkad to Attingal?",
   "Want to upgrade my upcoming flight to business class",
   "I want to travel from Pachore to Agra on 9th February.",
   "What is the cancellation policy for the Raj Ratan Tours And Travels bus from Ahmedabad to Indore?",
   "Please find the bus timings for a morning 6 o'clock bus from Haridwar to Mukheriya, Punjab on 23 August 2025.",
   "Please help me plan a trip from Chatrapur to Hyderabad on 15-09-2025.",
   "Problem in typing",
   "I need to find a bus ticket from Darbhamga to Sakri on the evening of 1 November 2025.",
   "Is it true that the confirmed option suggested by MMT guarantees a ticket even if there is a waiting list?",
   "What additional details do I need to provide to book the Journey with INDO CANADIAN TRANSPORT CO PRIVATE LIMITED bus from Ambala Cantt to Phagwara?",
   "I want to know about the cancellation policy for the GSRTC bus from Morbi to Tharad.",
   "Provide bus details for Mahuli Travels from Ranchi to Bihar Sharif on 28 Nov.",
   "Why can't I see the ticket block feature for 25%?",
   "What discounts and coupons are available for my bus journey from Ernakulam to Thiruvananthapuram with KSRTC (Kerala)?",
   "What are the penalty charges for cancelling my journey with Yuvan Raja Travels?",
   "I want to know about the cancellation policy for the Kalyani Bus Services bus from Bhubaneswar to Jeypore.",
   "I am not able to copy the offer for my trip from Mumbai to Darbhanga.",
   "I want to book a bus ticket from Bangalore to Sompeta on 17th October 2025.",
   "Is sightseeing or halting allowed in Chopta during my round trip from Rishikesh to Auli Laga Salude, Joshimath, and Rudraprayag from 09 Feb 2026 to 13 Feb 2026?",
   "Where can I find my coupon codes for my journey from Bankura to Digha?",
   "I'm not receiving the OTP to my email and mobile number.",
   "Show me other available discounts or offers for my Hyderabad to Tirupati bus journey.",
   "I want to know the charges for a sleeper seat on a bus from Delhi to Jhanjharpur.",
   "Is it possible to book the same coach for my journey from Indore to Patna on 20-10-2025?",
   "I am looking for KSRTC bus options from Ernakulam to Bangalore.",
   "What are the evening bus timings from Ahmednagar to Baramati for today?",
   "What is the status of my trip cancellation?",
   "What is the luggage capacity for the bus from Bangalore to Berhampur, Orissa with 'Gopinath Travels'?",
   "I would like to proceed with booking separate tickets for 5 passengers, with 3 boarding from Delhi and 2 from Gurgaon.",
   "I am looking for buses from Katra, Uttar Pradesh to Delhi.",
   "I do not want to see the details for the onward journey from Katni to Puri. Please focus on finding a return ticket from Puri to Katni on 23 October 2025 for 1 traveler.",
   "What is the welcome code for my KSRTC (Kerala) bus from Kottarakara to Mangaluru?",
   "I want to book a bus from Kasaragod to Bangalore.",
   "What is the refund amount if I choose Free Cancellation for my bus booking with Dolphin tours and travels from Kolkata to Karanjia?",
   "I want to book a jeep ride to Dudhsagar Falls for tomorrow.",
   "What is the last bus from Ringas to Ujjain?",
   "Show me bus options for traveling from Mumbai to Manali.",
   "Show me only AC buses from Bharuch, Gujarat to Potta Jhorki, Chhattisgarh for travel on 28 December 2025.",
   "I want to know about the reservation chart for my ticket confirmed on 23 October 2025.",
   "Please provide the driver's contact number for the bus from Tata to Angul.",
   "I'm looking for a bus from Calcutta to Bangalore.",
   "I would like to pick up a rental car at 10 am on 23 January in Airoli, Navi Mumbai.",
   "Request a complete refund and compensation for booking ID NU211801153394664 due to bus breakdown and significant inconvenience caused by the delay.",
   "I want to book a bus from Bangalore to Ahmedabad on 14th November after 6:00 PM, and I'm looking for a great deal.",
   "I am looking for buses from Thane to Pune on 20th January 2026.",
   "What is the cancellation policy for the VEE VEE BUS from Kollam to Bangalore?",
   "I want to book 2 tickets from Kolkata to Delhi on 24 October with trip guarantee.",
   "I have forgotten my NCRTC ID.",
   "I want to know about the cancellation policy for the bus operated by 'Humsafar Travels' from Shirdi to Dharwad.",
   "I want to know about the cancellation policy for the Kallada Travels bus from Thiruvananthapuram to Hyderabad.",
   "I want to speak to the bus service before booking the Sugama Tourist bus from Bangalore to Quilandy.",
   "Will there be a refund of 200 rupees?",
   "I need information on buses from Vijayawada to Hyderabad right now.",
   "I want to book tickets from Tirupati to Kolhapur with partly payment.",
   "What discounts and coupons are available for the Sugama Tourist bus from Ramdurg to Bangalore?",
   "What will be the cost for hiring a car for a round trip from Vijayawada to Kothakudam on 18th September, departing at 6:30 AM?",
   "I want to know about the bus services to Manali, specifically looking for options that will take me to Manali by bus.",
   "I want to confirm 2 tickets from New Delhi (NDLS) to Chhapra (CPR) for the journey.",
   "I was booking a bus trip from Nandi to Pune, but when I pressed back, it took me back to the Seattle location on the main screen. I had selected a seat, so where can I continue my bus booking?",
   "Why can't I book the bus from Thrissur to Bangalore with Maaruti Travels?",
   "The taxes and charges included in the trip guarantee are not being applied. Can you please look into this issue?",
   "I confirm my understanding of the Primo bus service.",
   "Yes, I am traveling on a Primo bus from Hyderabad to Bangalore.",
   "Trip assurance.",
   "I need a bus from Mysore to Ballari.",
   "Yes, I would like to select a sleeper seat on the Raj Bus Services bus from Bakhtiyarpur to Kolkata.",
   "Is there a cancellation fee for my bus booking with 'Sharma Travels Nanded' from Pune to Nanded?",
   "When I apply the trip guarantee voucher for my trip, it shows that the selected departure station is not available.",
   "What is the Free Cancellation policy for my journey with Kamakshi Tours And Travels from Hyderabad to Bangalore? I want to know the details about how I can claim a refund upon cancellation.",
   "I need to find a luxury Volvo AC sleeper bus from Mumbai to Mahabaleshwar.",
   "I want to book a ticket on the Vaishali Express from New Delhi to Bara Banki for September 26, 2025.",
   "I am looking for HRTC bus options from ISBT 43 Chandigarh to Baijnath.",
   "Is there a cancellation fee for the Gola Bus Service from Delhi to Katra (Jammu and Kashmir)?",
   "I need to find a bus ticket coupon for my upcoming travel plans.",
   "What are the terms and conditions for the travel voucher associated with the Alternate Trip offer?",
   "I want to book a bus from Dharwad to Bangalore for today using MyCash.",
   "Please provide a coupon for my bus journey from Mandi (Himachal Pradesh) to Delhi with HRTC.",
   "Please arrange an AC bus from Saharanpur to Delhi on 3rd September, departing at 2 PM.",
   "Please help me link my Aadhaar card.",
   "I'm looking for the slowest bus journey from Belagavi to Bengaluru on 10 Oct 2025. Please provide options that take longer than the average duration of 9 hrs 19 mins.",
   "Please check for Vande Bharat Express availability from Jodhpur to Delhi on September 6, 2025.",
   "Is there a cancellation fee for the Gola Bus Service from Delhi to Dehradun?",
   "Show me the available seats on the Kavi Guru Express from Kamakhya to Udaipur on 09-10-2025.",
   "What should I do if the driver denies halts or sightseeing during my trip from Chennai to Madurai on December 24, 2025?",
   "I want to chat with assistance.",
   "What discounts and coupons are available for my bus journey from Kolkata to Digha on the 'SBSTC-GARIA-DIGHA -22:30 (DIGHA DEPOT)' bus?",
   "Is there a cancellation fee for the KSRTC (Kerala) bus from Perinthalmanna to Pala?",
   "Please provide me with the local bus schedules in Palani.",
   "When will the driver be assigned to me?",
   "What discounts and coupons are available for the Dolphin travel house bus from Amravati to Mumbai?",
   "I have a query regarding the checkbox asking for an additional ₹470 per person while booking or confirming tickets for my trip from Rajkot to Rameshwaram on February 17, 2026.",
   "I want to know about the cancellation policy for the 'zingbus Maxx' from Thiruvananthapuram to Chennai.",
   "What discounts and coupons are available for Baba Travels for travel from Nashik to Nagpur?",
   "Please alert me when AC chair car tickets are available on the Navjeevan Express from Surat to Nagpur on 06 February 2026.",
   "Is there a cancellation fee for the 'MAHALAXMI BUS' from Ranchi to Bhubaneswar?",
   "Is a sleeper class seat available for travel from Karwar to Cochin?",
   "Is there a cancellation fee for the Sahil Travels bus from Mumbai to Devrukh?",
   "What is the cancellation policy for the Journey with Chanakya Travels Bus from Pusad to Mumbai?",
   "Please help me find my ticket with the reference number 9EJW8Q.",
   "I need a seat in the middle (MSLE) for my bus journey from Tezpur to Guwahati with 'DEBOLINA TRAVELS' on 25 January 2026.",
   "I would like to know more about the cancellation policy for my ticket with Oneness Tours And Travels.",
   "What is the cost for Free Cancellation with Bhagyalaxmi Travels bus from Pune to Ahmedabad?",
   "My refund didn&#39;t come",
   "I am looking for KSRTC bus options from Hyderabad to Bangalore.",
   "I want to travel from Ludhiana to Mathura from 7th February to 10th February. What are the best and cheapest travel options?",
   "Please help me book a ticket from Jabalpur to Raipur without any cancellation charges. I do not need the free cancellation option.",
   "If my ticket is not confirmed even after opting for the Trip Guarantee, will I get a 3X refund as cashback?",
   "Start booking tickets for Bhanupriya, Geraldine S, and Melinda Rahan from Coimbatore to Tanjore on 2025-10-22 for 3 travelers.",
   "What is the refund amount if I choose Free Cancellation for the Shri Rishabh Travels bus from Udaipur to Delhi?",
   "Sir, can a ticket be booked for this date?",
   "I would like to know about reservation options for cancer patients traveling from Muzaffarpur to Varanasi on September 28, 2025.",
   "Is there a cancellation fee for the Spectra Connect bus from Bangalore to Mangaluru?",
   "I want to book a KSRTC Kerala bus from Majestic to Pazhayangadi.",
   "Show me the travel time for the next indirect route from Pune to Veraval.",
   "I am looking for SETC bus services from Kilambakkam to Kanyakumari.",
   "Is there a cancellation fee for the zingbus plus from Coimbatore to Chennai?",
   "Provide detailed information about Primo buses, including their features and how they compare to normal buses.",
   "What food options are available for the journey from Delhi to Ujjain?",
   "is the price 12000&#43; , shown is for total amount trip , both 2 ways or is it just one way price",
   "What discounts and coupons are available for my bus journey from Jalna to Kolhapur with 'MB Link Travels'?",
   "Please help me with booking a ticket.",
   "Suggest a bus from Vishakapatnam to Chennai via Ongole, and tell me the estimated arrival time in Ongole.",
   "What is the cancellation policy for the bus (SBLT) Shri Bhagiyalakshimi Travels from Chennai to Paramathi Velur?",
   "Please provide more details about the Kallada bus options for travel from Trivandrum to Hyderabad on December 9th.",
   "What is the cancellation policy for the RS Yadav Smart Bus from Gorakhpur (Uttar Pradesh) to Noida?",
   "Tell it&#39;s urgent",
   "Is there a cancellation fee for my bus booking with 'VRL Travels' from Nagpur to Pune?",
   "I need help with my booking. Can you assist me with the details?",
   "I would like to rent a car for a two-day sightseeing package in Darjeeling, with pickup on 14-10-2025 at 9 AM.",
   "I prefer non-AC services for MSRTC. Can you find me the available non-AC MSRTC bus options?",
   "Please tell me the dates when I can redeem my VOMTRAIN3PX9YXG5Z code for bus travel.",
   "I need to arrange a self-driving car for transportation from Mumbai.",
   "I want to find the best bus travel options from Ahmedabad to Dwarka.",
   "Show me the available buses from Kodak to Hyderabad for today, 20 October 2025.",
   "I want to know something from customer care, and after that I want to confirm my booking.",
   "I would like to know about the travel details for a female passenger on the IntrCity SmartBus from Murtizapur to Aurangabad.",
   "Show me buses from Bankhandi to Kangra.",
   "What discounts and coupons are available for my bus journey from Hyderabad to Kadapa with APSRTC?",
   "I want to hire an AC bus for 16 people from Kurnool to Velakanni.",
   "Show me bus options from Bilaspur to Puri.",
   "What discounts and coupons are available for the UPSRTC bus from Haldwani to Delhi?",
   "I need a ticket for Yoga Express from Haridwar to Ajmer on 27-10-2025 in AC 23 class.",
   "I would like to know the complete list of boarding and dropping points for the Sri Krishna Travels bus from Hubli to Mysore.",
   "VOID TKT",
   "Proceed with booking the Sleeper Class ticket for the Trivandrum Express on the 14th.",
   "I don't see the option for a 3x return policy here. Can you help me find it?",
   "Show me buses from Delhi to Lucknow for tomorrow, 15 December 2025.",
   "I want to book a car for local transport from Kukke Subramanya to Udupi.",
   "I would like to know more about the amenities and schedule for the TGSRTC bus from Yellandu to Hyderabad.",
   "I'm looking for sleeper bus options from Nigadi to Hyderabad.",
   "whole day the driver will be with me?",
   "I need 10 seats for a bus journey from ISBT Kashmiri Gate to Khatushyamji, Rajasthan, with seats near each other.",
   "I am looking for buses from Kasaragod to Cochin.",
   "I would like to submit a review for the bus service I used recently.",
   "If the driver asks if I want to drop off before 9:55 PM, then what should I do?",
   "What is the 25% lock payment option for my journey from Mumbai to Bhuj?",
   "Why is my promocode not working?",
   "Show me the best car options for my trip from Sterling Kodai Valley in Kodaikanal.",
   "What are the toll charges for my trip from Jaipur to Jhunjhunu on 04 Feb 2026 at 06:00?",
   "Show me the UPS RTC bus options from Lucknow to Mathura.",
   "Process the request to change the name of the passenger.",
   "I want to travel from Bangalore to Guntur tomorrow (2025-08-23) and would like to know the available bus options and the lowest prices.",
   "Is student ID compulsory for tickets booked under student",
   "I am unable to book tickets for the Morning Star Travels bus from Hyderabad to Kakinada.",
   "I want to check the live bus tracking status for the Br Travels bus from Bhopal to Jaipur with a departure date of today.",
   "Please provide me with the list of available buses from Pune to Mumbai on 24th January 2026 between 12 PM and 2 PM.",
   "Please book a morning bus from Koyambedu to Madurai.",
   "I need to arrange a pickup on [specific date and time] for a round trip from Guwahati to Pobitora Wildlife Sanctuary.",
   "I prefer the bus option for traveling from Bangalore to Chennai. Can you find me the best bus options available for this route?",
   "I want to find bus travel options from Pune to Akola on 20th October.",
   "I want to book tickets for 2 males from Panipat to Ludhiana with Laxmi Holidays Pvt Ltd.",
   "I am telling you to give me the email",
   "What is the cost to get Free Cancellation for bus bookings?",
   "Will I get a confirmed ticket from Hulhundu to Renigunta?",
   "What discounts and coupons are available for the bus service with Ram Dalal Holidays Pvt Ltd from Jalandhar to Jammu?",
   "I want to hire the vehicle named Celeste in Hireville.",
   "I want to find the cheapest bus from Murudeshwar to Mysore.",
   "What is the bus route for Morning Star Travels from Srikakulam to Guntur?",
   "Please provide information about luggage shipping services from Cherlapalle to Chennai.",
   "I am looking for travel options from Bhopal to Jaipur to New Delhi.",
   "I recently booked a ticket with trip guarantee, but it didn't get confirmed, and I received a refund in voucher form. How can I redeem it?",
   "I have complaints about my ongoing trip. Please assist me in addressing these issues and provide guidance on how to resolve them.",
   "I want to book a TNSTC bus ticket from Chennai to Velankanni on 03/10/2025.",
   "Yes, I would like to know more about the specific charges included in the fare for the TSRTC bus from Karimnagar to Hyderabad on September 27, 2025. The base fare is ₹260, but I noticed the total fare is ₹390, which includes an additional ₹130. Can you break down these specific charges for me?",
   "I want to book both onward and return tickets together with Verma Travels from Kalyan to Bhopal. The first option was available earlier, but now it is not showing.",
   "Please provide details on why my previous bus was cancelled.",
   "I need to book a ticket and add one more passenger for my journey from Amritsar to Delhi on 22-10-2025. This makes it a total of 2 travelers.",
   "I need to travel from Delhi to Ujjain. Please recommend the best transportation options for this route.",
   "I want to read all the SOPs about bus services.",
   "I mentioned 'Krctc', but it doesn't seem to correspond to a valid destination or travel preference. Can you help clarify or suggest alternatives?",
   "I mentioned 'Tvyvink', but I need to know if it's a valid destination or travel-related preference.",
   "Show me bus options from Chennai to Ooty for 2 adults traveling from 13th February 2026 to 16th February 2026.",
   "What does Alternate Trip mean in the context of the 3X Refund offer?",
   "I want to book a bus ticket from Aluva to Mysore with 'CITI TOURS' on 02 February 2026.",
   "I would like to know more about the amenities available on TRIBENI EXPRESS in Sleeper Class (SL) from Mirzapur to Prayagraj (Allahabad) on 28-10-2025.",
   "If the bus is canceled due to insufficient passengers, will the bus operator provide another bus, and will I have a choice in that situation?",
   "Where will the bus from Dolphin Travel House come from for my trip from Pune to Ambaji?",
   "What discounts and coupons are available for Shree Vijay Travels bus from Ahmedabad to Dhule?",
   "When will I receive the driver details for the NueGo bus journey from Chennai to Tiruchirapalli?",
   "What discounts and coupons are available for the TGSRTC bus from Bangalore to Warangal?",
   "I want to book a private bus for my family from Ahmedabad to Ambaji temple and then return from Ambaji to Ahmedabad for 4 travelers.",
   "Why there is an convenience fee?",
   "Is there a cancellation fee for the Hans Travels bus from Aurangabad (Maharashtra) to Pune?",
   "I want to book a bus from Hyderabad to Velguda on 25th September.",
   "I need to connect with an agent regarding my bus booking with Shree Mahaveer Travels from Moradabad to Chandigarh.",
   "What is premium of trip assured and free cancellation and also add total ticket price with addons",
   "Where can I find the vouchers in the application? I always apply them for tickets over ₹500.",
   "I need to get down near Kadugodi, Whitefield after my bus journey to Bengaluru on January 6th.",
   "I need to find a bus from Bangalore to Mysore for my trip on September 15, 2025.",
   "What is the cancellation policy for the Laxmi holidays bus from Nanded to Pune?",
   "I want to know about early morning travel options from Rajkot to Gandhinagar on January 4, 2026. Please provide options for departure between 6 to 7 AM.",
   "What is the refund amount if I choose Free Cancellation for my bus booking with Jaguar Travels from Hyderabad to Pune?",
   "I want to know how to travel from Ludhiana to Patna as I am not getting my ticket confirmed.",
   "I want to travel from Mumbai to Haridwar on 19 January 2026.",
   "I need detailed information about jet ferries, including routes, schedules, and pricing.",
   "What discounts and coupons are available for Yatra Travels from North Lakhimpur to Guwahati?",
   "Is the SBSTC-KOLKATA-PURULIA-VIA-ASN-11:00 bus departing from Kolkata Esplanade or Howrah?",
   "I want to see all available buses from Gorakhpur (GKP) to Nagpur (NGP).",
   "I need to rent a car in Ooty for 4 days, picking it up from Coimbatore on 21st January at 12 PM.",
   "We are 2 people traveling from Kolhapur to Mathura. Please recommend transportation options for this journey.",
   "Show me bus options from Bengaluru to Pondicherry for tonight after 10 PM.",
   "Is there a cancellation fee for the 'ACLS Navigator' bus from Thrissur to Bangalore?",
   "What sight seeing is available ",
   "What happens if my ticket from Bibinagar to Chennai on 17-09-2025 is in the waiting list?",
   "MMTDEAL not supported. Please assist with this issue.",
   "Is there a cancellation fee for Verma Travels bus from Ahmedabad to Hyderabad?",
   "I need a bus route from Chitkul to Jhakri, Himachal Pradesh.",
   "Show me the bus schedules for the journey from Ooty to Munnar.",
   "I want to know about KSTRC bus services.",
   "What platform is the Rayalaseema SF Express 12793 currently on?",
   "I would like to check for bus tickets from Bangalore to Hyderabad for the upcoming Tuesday, October 21, 2025.",
   "I want to know if the bus will drop us at Basohli bus stand or Dalhousie.",
   "What are the penalty charges for cancelling my bus ticket from Thrissur to Mysore with KSRTC?",
   "Is there a cancellation fee for the Shrinath Solitaire - Mahadev Travels bus from Ankleshwar to Jaipur?",
   "I want to book a bus from Agra to Varanasi.",
   "I want to book bus tickets from Pimple to Lonavala.",
   "I want to add a simpl option for the Chalo Bus (Sutra Sewa) from Chhindwara to Jabalpur.",
   "Please connect me to an agent for assistance with my booking issue.",
   "I am not seeing the option for part payment.",
   "Why am I getting an error while booking a bus from Tirupati to Bangalore?",
   "What about my refund ?",
   "What is the Trip Guarantee for my journey from Chennai to Srivilliputhur?",
   "I would like to rent a car from Hyderabad to Vikarabad for tomorrow, December 20, 2025.",
   "What are the penalty charges for cancelling my bus booking with Jakhar Travels from Chikhli to Disa?",
   "Show me good bus options for traveling from Hyderabad to Bangalore.",
   "What is the cancellation policy for the PSS Transport bus from Bangalore to Tirupur?",
   "Stop at Ahmedabad for the GSRTC bus to Ambaji.",
   "Of course. Please find me some travel options, as I haven't provided any specific preferences or destinations yet.",
   "What are the bus timings for the 'IntrCity SmartBus' from Ludhiana to Delhi?",
   "My refund coupon has expired. Can you help me with this issue?",
   "I would like to apply the WELCOMEMMT coupon for my booking from Pune to Goa.",
   "I want to make the payment in cash for the Sai Darshan Travels bus from Vapi to Pune.",
   "I need information about baby tickets for the bus journey from Delhi to Ujjain with 'Globehopper Mobility'.",
   "Is there a cancellation fee for my bus booking with 'Ashok Tour And Travels' from Delhi to Ghazipur?",
   "I need to find a red bus from Kolhapur Bus Stand to Latur Bus Stand.",
   "If I cancel my bus ticket, how much refund will I receive?",
   "I want to book the 'STARLINE BUS ®' from Ahmedabad to Ujjain.",
   "Link not working",
   "Where does the Nyay Rath bus from Kolkata to Begusarai depart from?",
   "I have a bus tracking ID that I would like to check.",
   "Please provide more details about the Anagha Travels bus from Tirupati to Hyderabad.",
   "What discounts and coupons are available for the Travel Express bus from Lucknow to Kathmandu?",
   "Please provide the contact number for 'Sri Krishna Rath' bus service from Siliguri to Phulparas.",
   "I need to find the exact bus departure times from OMR Chennai to Thiruchendur on 25 November 2025 for sleeper class. Please provide the schedule for the available options.",
   "I would like to book a bus from Rajiv Gandhi International Airport to Vemulawada, Telangana on September 5th.",
   "I need a self-drive rental car for 6 days starting from Jaipur.",
   "Yes, I would like to know more about the Sinhagad Express from Dadar to Chinchwad.",
   "I need to book a return ticket from Delhi to Kota on 26th December after 6 PM, but I see there are no direct confirmed tickets available.",
   "I need to plan a trip from Morena to Delhi.",
   "Why do I need to include 1 male traveler for the Journey with Rayeen Bus from Bhopal to Biaora?",
   "Please provide details for sleeper bus rentals from Bangalore to Vaitheeswarankoil, Tamil Nadu for 30 people, traveling on 13th February 2026 and returning on 15th February 2026.",
   "I am traveling from Hyderabad to Pune on December 3rd and returning on December 7th. Can you help me book a round trip ticket for this journey?",
   "Please help me troubleshoot the issue with the link for my holiday booking. It seems to be unresponsive, and I need assistance to access my reservation details.",
   "Is there a cancellation fee for my bus booking with 'Samay Travels' from Ahmedabad to Jamnagar?",
   "Show me more full sleeper bus options from Hyderabad to Bangalore on 26th January for under ₹1500.",
   "I want to book a car for 4 days in Sri Lanka, starting from 6th September 2025, coming from Hyderabad.",
   "Is Taramani pick-up available for bus services?",
   "Provide details about Rathimeena Travels for buses from Bangalore to Coimbatore.",
   "I would like to click on the cards above for more details and to book the bus from MG Road, Ernakulam to Kottakkal.",
   "I am taking a bus from Kurnool to Hyderabad on Tuesday (2025-10-21). Please provide the best bus options available for this route.",
   "What discounts and coupons are available for my bus journey from Ahmedabad to Bali with 'Shree Ashapura Travels'?",
   "I am looking for low-cost seater options for bus travel.",
   "What are the penalty charges for cancelling my bus ticket with 'V Kaveri Travels'?",
   "I want to book an APSRTC bus from Narasaraopeta to Hyderabad for tomorrow on the 18th.",
   "Which bus stop will CityLink Travels Mumbai depart from in Mumbai on the 3rd?",
   "What are the chances of my wait-listed ticket getting confirmed?",
   "I want to know about the cancellation policy for the bus operated by 'SHREYA ROADLINES(MANGALDEEP)' from Asansol to Digha.",
   "Please connect me with an agent regarding my issue with the coupon.",
   "What are the stations or locations that the bus from Delhi to Ghansali passes through?",
   "Suggest a bus route from Jhakri, Himachal Pradesh to Chitkul.",
   "What discounts and coupons are available for the Sugama Tourist bus from Vittal to Bangalore?",
   "I want to return on 01-01-2026 via Lonavala.",
   "I want to book my ticket from Delhi to Ujjain.",
   "I want to know about the cancellation policy for the bus operated by 'Pramukh Travels' from Kakinada to Bangalore.",
   "What discounts and coupons are available for the Classic Bus And Transport Private Limited from Nashik to Hyderabad?",
   "I want to book 4 tickets from Pune to Jaipur, Rajasthan.",
   "I need help with my travel plans, but I'm not sure what '5 eyr' means. Can you clarify what options are available for me?",
   "What is a Volvo bus? I'm looking for details similar to what I learned about the Primo bus, focusing on its features and services.",
   "Is the KBS Luxury Bus from Bangalore to Chennai a primo bus?",
   "I want to book a car for sightseeing in Puri.",
   "Show me buses from Pune to Akola for today, priced below ₹800.",
   "My Aadhaar card has not been verified.",
   "What is the cancellation fee if we cancel the NueGo bus from Bangalore to Hosur within an hour?",
   "Where can I find information about my trip guarantee cancellation refund?",
   "I am unable to complete my booking.",
   "What is the alternate trip plan in Trip Guarantee for my journey from Ambala to Patna?",
   "Please guide me on how to find the invoice for my previous booking.",
   "If I book a waiting ticket and it does not get confirmed, will it be cancelled?",
   "Is there a cancellation fee for my bus ticket?",
   "What is the cancellation policy for the Journey with Kalpaka Travels Bus from Bangalore to Payyanur?",
   "Trip guarantee coupon code mmtfestive.",
   "I want to talk with an agent because the Trip Guarantee option is not appearing.",
   "Please guide me on how to check the status of my bus ticket booked online in the app.",
   "What discounts and coupons are available for the Falcon Bus from Nadiad to Mumbai?",
   "What is the cancellation policy for the Mercy Travels bus from Mumbai to Udupi?",
   "I would like to know more about how to book a wait-listed ticket for my trip from Warangal to Jabalpur on 09 Feb 2026.",
   "Will I get a confirmed ticket if my waiting list number is 118?",
   "Podi pundachi",
   "What is the maximum limit for the trip guarantee?",
   "I want to know about the cancellation policy for the 'zingbus plus' from Thanjavur to Chennai.",
   "I need a bus from Latur to Mehkar, and I want to reach Mehkar by 6 am.",
   "Safe for women.. good driver",
   "jabbar travels and greenline",
   "What is the coupon code for a confirma ticket from Delhi to Kolkata?",
   "Rent a car from Bangalore to Mysore for pickup on January 10th at 10 AM.",
   "I want confirmation for my seat on the APSRTC bus from Hyderabad to Annavaram.",
   "Locate a private self-drive car for intercity travel from Hyderabad to Kanyakumari for 4 adults during the specified dates from 17th Jan to 26th Jan.",
   "Where can I book a SETC bus?",
   "I want to know if my ticket from Anand to Mumbai has been confirmed.",
   "I want to know about the cancellation policy for the bus operated by Delta Transports Pvt Ltd from Hyderabad to Chalakudi.",
   "Set the number of upper parent seats to 2 for the BigBus from Hyderabad to Madurai.",
   "I want to know about the cancellation policy for the bus operated by Nakoda Travels from Kalyan to Kolhapur.",
   "I want to book 2 bus tickets from Proddutoor to Hyderabad for tomorrow night, one sleeper seat for a female aged 48 and one sitting seat for a male aged 30.",
   "In case of 340 km in Nagpur ,what is the Final price ",
   "I need to book a 21-seater tempo traveler for pickup from Delhi to Ujjain at 7:00 o'clock on 25th December.",
   "What is the pickup time for my booking?",
   "Is there a cancellation fee for my journey with Prasanna - Purple Bus from Nagpur to Nashik? What are the penalty charges upon cancellation?",
   "Please provide details about the 3rd AC class amenities and fares for the Tutari Express from Sawantwadi to Thane on 1st November 2025.",
   "I need to find a sleeper bus from Pune to Mumbai, dropping in Goregaon East at 1pm today.",
   "what is the vehicle condition and age?",
   "Plan a road trip with a driver from Goa to Mangalore on February 10, 2026, at 9:00 AM, including pickup location, route preferences, and cost estimate.",
   "I want to know about the baggage",
   "What is the refund amount I will receive if I choose Free Cancellation for the BigBus from Tirupati to Visakhapatnam?",
   "Please arrange a call with an executive to discuss my actual problem.",
   "Please arrange a call with an executive regarding bus operator services.",
   "I prefer to travel by bus from Bengaluru to Kukke Subramanya Temple. Can you provide the best bus options available for this route?",
   "What are the GST details for my travel from Chennai to Visakhapatnam?",
   "I want to book a 3 AC ticket from Chhatrapati Sambhaji Nagar to Mathura station on 25 December.",
   "I need help",
   "Why is it showing Free Cancellation available for the bus trip from Manali to Delhi with 'Deltin Travels Pvt Ltd'?",
   "Show me the availability of buses from Chandanagar, Hyderabad to Sion flyover, Mumbai on the night of 6th October.",
   "Is the Sri SMS Travels bus from Virudhnagar to Bangalore a sleeper bus where we can sleep?",
   "I am unable to book the MRS Transport bus from Attur (Salem) to Chennai. Please help me with this.",
   "I have a voucher for Rs. 2700 and I'm unable to book the remaining amount for bus tickets.",
   "Show me the bus options from Hamirpur to Kasauli again.",
   "I need to find bus options from Vattapalam to Trivandrum with KSRTC.",
   "Please provide the bus timetable for travel from Bhiwani to Jaipur.",
   "I would like to know about bus services to Goa from Delhi.",
   "Is there a cancellation fee for my bus booking with 'Hans Travels (I) Private Limited' from Pune to Indore?",
   "What are the best sightseeing options in Chandigarh? I'm looking for recommendations for activities to do while visiting from Noida.",
   "Is there a cancellation fee for the 'IntrCity SmartBus' from Mumbai to Goa?",
   "What is the cancellation policy for the Journey with Amrut Tours And Travels bus from Aurangabad (Maharashtra) to Pune?",
   "Show me bus options to Kasol.",
   "Why am I unable to book a comfort seat for my journey from Coimbatore to Paramakudi with 'Jai Vishnu Travels'?",
   "What discounts and coupons are available for V Kaveri Travels from Hyderabad to Bangalore?",
   "What is the cancellation policy for the Journey with Poulami Paribahan Bus from Kolkata to Siliguri?",
   "Is there a cancellation fee for the bus ticket from Lucknow to Noida with 'Gola Bus Service'?",
   "Please find available sleeper bus options from Trichy to Chennai for this Sunday, September 7, 2025.",
   "I want to check bus ticket rates from Guruvayoor or Trissur to Chennai, with a budget of 1500.",
   "I need more information about the ticket booking process for children, specifically regarding the requirements for purchasing tickets for a 6 year old and a 9 year old boy.",
   "Where is the 'Classmates Voyages' bus from Paravoor to Mananthavady right now?",
   "What is free cancellation for my bus trip from Varkala(kerala) to Bangalore?",
   "What is the bus price from Basti to Delhi?",
   "Is there a cancellation fee for the Jamna Travels bus from Noida to Kanpur?",
   "Please passenger how many can seat in xylo",
   "What is the confirmed option for travel from Mumbai to Sikar?",
   "If my waiting list ticket doesn't get confirmed, will I get a refund?",
   "Is there any offer available for senior citizen bookings for 5 travelers from Mumbai to Panipat?",
   "Is there a cancellation fee for the Greenline bus from Kolkata to Siliguri?",
   "What are the pick-up and drop-off timings for local sightseeing in Manali during my round trip from Delhi to Manali and back?",
   "I am looking for KKR buses from Chennai to Bangalore departing around 8 or 9 PM.",
   "Please book a seat for me on the Kalingautkal Express from Delhi to Champa on 17th October.",
   "Why is my coupon not applicable for my bus booking from Hyderabad to Berhampur (Orissa) with 'Sri Keerthana Sai Travels'?",
   "What discounts and coupons are available for my journey on the 'IntrCity SmartBus' from Mumbai to Goa?",
   "My first bus booking is here. I need to book a bus from Morbi to Ahmedabad.",
   "Please help me book one of the bus options from Hanumangarh to Delhi on 02 Sep, excluding Jaap Express. The available options include ADVITYA TRAVELS (6 hrs 55 mins, ₹750, 4.2 stars), Poonia Transport (6 hrs 20 mins, ₹857, 3.7 stars), Virat Travels (6 hrs 45 mins, ₹799, 4.8 stars), and Pinky Gudiya Travels And Cargo (7 hrs 21 mins, ₹851, 4.9 stars). I would like to proceed with booking one of these alternatives.",
   "Please provide information regarding my refund status and process.",
   "Is dinner available on the Ujjaini Express in Sleeper Class?",
   "Please check for train or bus options from Hubli to Solapur for September 26, 2025.",
   "Please assist me in setting up customer care for my travel needs.",
   "Kindly open my MakeMyTrip account.",
   "I need a tempo traveler from Raheja Atharva to Haldwani on 19th February 2026, picking up at 9 am.",
   "Is there a coupon code available for the trip guarantee?",
   "Please provide details about bus number UK-07-PA-8899.",
   "What discounts and coupons are available for my bus journey from Delhi to Ayodhya with 'Travel Point'?",
   "I am looking for kashibus transportation from Delhi to Lucknow on 15 October.",
   "Is my cash only applicable for bus bookings?",
   "Please provide details about the Vistadome coach on the Gomateshwara Express, including its features and amenities.",
   "What is the trip guarantee for traveling from Delhi to Ujjain?",
   "I want to know about the interior of the Yolo Bus from Delhi to Dehradun.",
   "Show me all the stops for the Laxmi Holidays bus from Delhi to Katra.",
   "What is the cancellation policy for the Journey with Rubi Paribahan bus from Balisai to Kolkata?",
   "Why am I not seeing the trip guarantee option for my journey from Chandigarh to Thrissur?",
   "I want a 3x return option if my booking from Ujjain to Kanpur on 07-01-2026 is not confirmed.",
   "Please provide details about my booking.",
   "Is there a cancellation fee for the bus journey from Ujjain to Mumbai with 'Prasanna Purple MNK Travels'?",
   "Will the bus from Haldwani to Mathura with KAMYA TRAVELS PVT LTD depart on time for 3 travelers?",
   "What is the price of a sleeper class bus ticket from Mumbai to West Bengal?",
   "Show me the tickets for the Deccan Queen second seater from Pune to Mumbai on 8th February.",
   "I have not received the coupon code.",
   "I don't understand why you are asking me to fill in the discount column for this coupon code.",
   "I would like to request a refund for the Get Trip Guarantee payment for my confirmed ticket with EQ.",
   "I want to know about HRTC buses from Sector 17, Chandigarh to Haridwar today.",
   "What discounts and coupons are available for the Sri Vaari Travels bus from Pondicherry to Hyderabad?",
   "Is there a cancellation fee for the 'FRESHBUS' bus from Bangalore to Chennai?",
   "Show me luxury AC sleeper buses from Varanasi to Jaipur.",
   "What is the free cancellation policy for the 'RS Yadav Smart Bus' from Kushinagar to Delhi?",
   "I am unable to reset my password.",
   "I need to find a bus from Hinjewadi to CSMT airport after 7 PM on 9 October 2025.",
   "Is there a cancellation fee for the bus journey from Sullia to Mysore?",
   "I wanted to ask why the trip guarantee for my booking is not available.",
   "I want to travel from Miraj Junction to Chennai Sholinganallur.",
   "What discounts and coupons are available for the RS Yadav Smart Bus from Delhi to Salempur?",
   "I am unable to book the ticket from Chennai to Tiruchirappalli and need assistance with this issue.",
   "Will I get a confirmed ticket for my journey from Kolkata to Jaipur?",
   "My drop location is different. I need to find the best options for traveling from Pune to Begusarai, specifically to Barauni.",
   "I want to know about the cancellation policy for the 'PRM Roadways' bus from Tirunelveli to Chennai.",
   "Please provide details on bus options that allow pets to travel from Bangalore to Kalyan, including duration and fare for both available routes: Via Navi Mumbai and Via Pune.",
   "I need to find a bus from Jaipur to Nathdwara on 26th August.",
   "Please schedule a private car pickup from Jam Khambhaliya to Saranpur Hanuman on 24th October at 10 AM sharp.",
   "I want to travel from Eluru to Katpadi Junction today.",
   "I want to travel from Bangalore to Komuravelli.",
   "Will the pickup and drop for the Nandi Hills round trip be in the same car?",
   "Please connect me to an agent for more information about extra charges that may apply during my trip.",
   "Please arrange a call with an executive regarding travel from Thane to Bengaluru.",
   "Is there a cancellation fee for the Vikram Travels bus from Bangalore to Hyderabad?",
   "What is the cancellation policy for Babu Travels if my travel date is 18 October for the bus from Unjha to Jaipur?",
   "What are the chances of confirmation for my journey from Delhi to Ranchi?",
   "Please provide the booking reference for the user's recent booking.",
   "Send the ticket to the user's email as requested.",
   "What is the cancellation policy for the Journey with Maharani Travels Bus from Lucknow to Jaipur?"
]